Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: Each element of the list can be either an authentication indicator name or a pair <quote>service:indicator</quote>. Indicators not prefixed with the PAM service name will be required to access any PAM service configured to be used with <option>pam_gssapi_services</option>. A resulting list of indicators per PAM service is then checked against indicators in the Kerberos ticket during authentication by pam_sss_gss.so. Any indicator from the ticket that matches the resulting list of indicators for the PAM service would grant access. If none of the indicators in the list match, access will be denied. If the resulting list of indicators for the PAM service is empty, the check will not prevent the access.
pt: Cada elemento da lista pode ser ou um nome de indicador de autenticação ou um par <quote>serviço:indicador</quote>. Os indicadores não prefixados com o nome de serviço PAM serão requeridos para aceder a qualquer serviço PAM a ser usado com <option>pam_gssapi_services</option>. Uma lista resultante de indicadores por serviço PAM é então verificada contra os indicadores no bilhete Kerberos durante a autenticação por pam_sss_gss.so. Qualquer indicador a partir do bilhete que corresponda à lista resultante de indicadores para o serviço PAM irá garantir o acesso. Se nenhum dos indicadores na lista corresponder, o acesso será negado. Se a lista resultante de indicadores para o serviço PAM estiver vazia, a verificação não irá prevenir o acesso.

source: To disable GSSAPI authentication indicator check, set this option to <quote>-</quote> (dash). To disable the check for a specific PAM service, add <quote>service:-</quote>.
pt: Para desactivar a verificação de indicador de autenticação GSSAPI, defina esta opção para <quote>-</quote> (traço). Para desactivar a verificação para um serviço PAM específico, adicione <quote>service:-</quote>.

source: Following authentication indicators are supported by IPA Kerberos deployments:
pt: Os seguintes indicadores de autenticação são suportados pelo desenvolvimento Kerberos IPA:

source: pkinit -- pre-authentication using X.509 certificates -- whether stored in files or on smart cards.
pt: pkinit -- pre-autenticação usando certificados X.509 -- estejam armazenados em ficheiros ou em smart cards.

source: hardened -- SPAKE pre-authentication or any pre-authentication wrapped in a FAST channel.
pt: hardened -- pre-autenticação SPAKE ou qualquer pre-autenticação envolvida num canal FAST.

source: radius -- pre-authentication with the help of a RADIUS server.
pt: radius -- pre-autenticação com a ajuda dum servidor RADIUS.

source: otp -- pre-authentication using integrated two-factor authentication (2FA or one-time password, OTP) in IPA.
pt: otp -- pre-autenticação usando autenticação de dois factores integrada (2FA ou palavra passe de uma-vez, OTP) em IPA.

source: idp -- pre-authentication using external identity provider.
pt: idp -- pre-autenticação usando provedor de identidade externo.

source: Example: to require access to SUDO services only for users which obtained their Kerberos tickets with a X.509 certificate pre-authentication (PKINIT), set <placeholder type="programlisting" id="0"/>
pt: Exemplo: para requerer acesso a serviços do SUDO apenas para utilizadores que obtiveram os seus bilhetes Kerberos com uma pre-autenticação de certificado X.509 (PKINIT), defina <placeholder type="programlisting" id="0"/>

source: Default: not set (use of authentication indicators is not required)
pt: Predefinição: não definida (o uso de indicadores de autenticação não é requerido)

source: SUDO configuration options
pt: Opções de configuração do SUDO

source: These options can be used to configure the sudo service. The detailed instructions for configuration of <citerefentry> <refentrytitle>sudo</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> to work with <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> are in the manual page <citerefentry> <refentrytitle>sssd-sudo</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
pt: Estas opções podem ser usadas para configurar o serviço sudo. As instruções detalhadas para configuração do <citerefentry> <refentrytitle>sudo</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> para trabalhar com <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> estão no manual <citerefentry> <refentrytitle>sssd-sudo</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: sudo_timed (bool)
pt: sudo_timed (booleano)

source: Whether or not to evaluate the sudoNotBefore and sudoNotAfter attributes that implement time-dependent sudoers entries.
pt: Se se deve ou não avaliar os atributos sudoNotBefore e sudoNotAfter que implementam entradas de sudoers dependentes de tempo.

source: sudo_threshold (integer)
pt: sudo_threshold (inteiro)

source: Maximum number of expired rules that can be refreshed at once. If number of expired rules is below threshold, those rules are refreshed with <quote>rules refresh</quote> mechanism. If the threshold is exceeded a <quote>full refresh</quote> of sudo rules is triggered instead. This threshold number also applies to IPA sudo command and command group searches.
pt: Número máximo de regras expiradas que podem ser refrescadas de uma vez. Se o número de regras expiradas estiver abaixo do limiar, essas regras são refrescadas com o mecanismo <quote>rules refresh</quote>. Se o limiar for excedido, um <quote>full refresh</quote> de regras sudo é despoletado em vez do primeiro. Este número de limiar também se aplica ao comando sudo do IPA e a buscas de grupo de comando.

source: AUTOFS configuration options
pt: Opções de configuração do AUTOFS

source: These options can be used to configure the autofs service.
pt: Estas opções podem ser usadas para configurar o serviço autofs.

source: autofs_negative_timeout (integer)
pt: autofs_negative_timeout (inteiro)

source: Specifies for how many seconds should the autofs responder negative cache hits (that is, queries for invalid map entries, like nonexistent ones) before asking the back end again.
pt: Especifica durante quantos segundos deve o respondedor autofs manter em cache resposta negativas (isto é, consultas por entradas de mapa inválidas, como não existentes) antes de perguntar de novo ao backend.

source: SSH configuration options
pt: Opções de configuração do SSH

source: These options can be used to configure the SSH service.
pt: Estas opções podem ser usadas para configurar o serviço SSH.

source: ssh_use_certificate_keys (bool)
pt: ssh_use_certificate_keys (booleano)

source: If set to true the <command>sss_ssh_authorizedkeys</command> will return ssh keys derived from the public key of X.509 certificates stored in the user entry as well. See <citerefentry> <refentrytitle>sss_ssh_authorizedkeys</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> for details.
pt: Se definido para true o <command>sss_ssh_authorizedkeys</command> irá retornar chaves ssh derivadas da chave pública de certificados X.509 armazenados também na entrada do utilizador. Veja <citerefentry> <refentrytitle>sss_ssh_authorizedkeys</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> para detalhes.

source: By default the ssh responder will use all available certificate matching rules to filter the certificates so that ssh keys are only derived from the matching ones. With this option the used rules can be restricted with a comma separated list of mapping and matching rule names. All other rules will be ignored.
pt: Por predefinição, o respondedor ssh irá usar todos os certificados disponíveis que correspondam a regras para filtrar os certificados para que as chaves ssh sejam apenas derivadas dos correspondentes. Com esta opção as regras usadas podem ser restritas com uma lista separada por vírgulas de nomes de regras de mapeamento e correspondência. Todas as outras regras serão ignoradas.

source: There are two special key words 'all_rules' and 'no_rules' which will enable all or no rules, respectively. The latter means that no certificates will be filtered out and ssh keys will be generated from all valid certificates.
pt: Existem duas palavras chave especiais 'all_rules' e 'no_rules' as quais irão activar todas ou nenhuma regra, respetivamente. A posterior significa que nenhum certificado será filtrado a as chaves ssh serão geradas a partir de todos os certificados válidos.

source: If no rules are configured using 'all_rules' will enable a default rule which enables all certificates suitable for client authentication. This is the same behavior as for the PAM responder if certificate authentication is enabled.
pt: Se nenhuma regra estiver configurada usar 'all_rules' irá activar uma regra predefinida que activa todos os certificados apropriados para autenticação de cliente. Este é o mesmo comportamento que para o respondedor PAM se a autenticação de certificados estiver activa.

source: A non-existing rule name is considered an error. If as a result no rule is selected all certificates will be ignored.
pt: Um nome de regra não existente é considerado um erro. Se for um resultado nenhuma regra é selecionada e todos os certificados são ignorados.

source: Default: not set, equivalent to 'all_rules', all found rules or the default rule are used
pt: Predefinição: não usada, equivalente a 'all_rules', são usadas todas as regras encontradas, ou a regra predefinida

source: Path to a storage of trusted CA certificates. The option is used to validate user certificates before deriving public ssh keys from them.
pt: Caminho para um armazém de certificados CA de confiança. A opção é usada para validar certificados de utilizador antes de derivar chaves ssh públicas a partir deles.

source: PAC responder configuration options
pt: Opções de configuração do respondedor PAC

source: The PAC responder works together with the authorization data plugin for MIT Kerberos sssd_pac_plugin.so and a sub-domain provider. The plugin sends the PAC data during a GSSAPI authentication to the PAC responder. The sub-domain provider collects domain SID and ID ranges of the domain the client is joined to and of remote trusted domains from the local domain controller. If the PAC is decoded and evaluated some of the following operations are done:
pt: O respondedor PAC trabalha em conjunto com o plugin de dados de autorização para MIT Kerberos sssd_pac_plugin.so e um provedor de sub-domínio. O plugin envia os dados PAC durante uma autenticação GSSAPI para o respondedor PAC. O provedor de sub-domínio recolhe os alcances de SID e ID do domínio a que o cliente está junto e de domínios de confiança remotos a partir do controlador de domínio local. Se o PAC for descodificado e avaliado algumas das seguintes operações são feitas:

source: If the remote user does not exist in the cache, it is created. The UID is determined with the help of the SID, trusted domains will have UPGs and the GID will have the same value as the UID. The home directory is set based on the subdomain_homedir parameter. The shell will be empty by default, i.e. the system defaults are used, but can be overwritten with the default_shell parameter.
pt: Se o utilizador remoto não existir na cache, é criado. O UID é determinado com a ajuda do SID, domínios de confiança irão ter UPGs e o GID irá ter o mesmo valor que o UID. O directório home é definido com base no parâmetro subdomain_homedir. A shell irá estar vazia por predefinição, isto é, são usadas as predefinições do sistema, mas isto pode ser sobreposto com o parâmetro default_shell.

source: If there are SIDs of groups from domains sssd knows about, the user will be added to those groups.
pt: Se existirem SIDs de grupos de domínios conhecidos do sssd, o utilizador será adicionado a esses grupos.

source: These options can be used to configure the PAC responder.
pt: Estas opções podem ser usadas para configurar o respondedor PAC.

source: Specifies the comma-separated list of UID values or user names that are allowed to access the PAC responder. User names are resolved to UIDs at startup.
pt: Especifica a lista de valores UID ou nomes de utilizador separados por vírgulas que têm permissão de acesso ao respondedor PAC. Os nomes de utilizadores são resolvidos em UIDs no arranque.

source: Default: 0, &sssd_user_name; (only root and SSSD service users are allowed to access the PAC responder)
pt: Predefinição: 0, &sssd_user_name; (apenas o root e utilizadores do serviço SSSD têm permissão de acesso ao respondedor do PAC)

source: Default: 0 (only the root user is allowed to access the PAC responder)
pt: Predefinição: 0 (apenas o utilizador root ter permissão de acesso ao respondedor do PAC)

source: Please note that defaults will be overwritten with this option. If you still want to allow the root and/or '&sssd_user_name;' user to access the PAC responder, which would be the typical case, you have to add those to the list of allowed UIDs explicitly.
pt: Por favor note que as predefinições serão sobrepostas por esta opção. Se ainda deseja permitir ao root e/ou utilizador '&sssd_user_name;' acesso ao respondedor PAC, o que seria o caso típico, você tem de adicionar esses à lista dos UIDs permitidos explicitamente.

source: Please note that although the UID 0 is used as the default it will be overwritten with this option. If you still want to allow the root user to access the PAC responder, which would be the typical case, you have to add 0 to the list of allowed UIDs as well.
pt: Por favor note que apesar do UID 0 ser usado como predefinição irá ser sobreposto por esta opção. Se você ainda quiser permitir ao utilizador root ter acesso ao respondedor PAC, o que será um caso típico, você também tem de adicionar 0 à lista de UIDs permitidos.

source: pac_lifetime (integer)
pt: pac_lifetime (inteiro)

source: Lifetime of the PAC entry in seconds. As long as the PAC is valid the PAC data can be used to determine the group memberships of a user.
pt: Tempo de vida da entrada PAC em segundos. Enquanto o PAC for válido os dados do PAC podem ser usados para determinar os membros do grupo de um utilizador.

source: Apply additional checks on the PAC of the Kerberos ticket which is available in Active Directory and FreeIPA domains, if configured. Please note that Kerberos ticket validation must be enabled to be able to check the PAC, i.e. the krb5_validate option must be set to 'True' which is the default for the IPA and AD provider. If krb5_validate is set to 'False' the PAC checks will be skipped.
pt: Aplica verificações adicionais no PAC do bilhete Kerberos o qual está disponível nos domínios Active Directory e FreeIPA, se configurado. Por favor note que a validação de bilhete Kerberos tem de estar activa para ser capaz de verificar o PAC, isto é, a opção krb5_validate tem de estar definida para 'True' o que é a predefinição para o provedor IPA e AD. Se krb5_validate estiver definida para 'False' as verificações do PAC serão saltadas.

source: The PAC must not be present and even if it is present no additional checks will be done.
pt: O PAC não deve estar presente e mesmo que esteja presente nenhuma verificação adicional será feita.

source: The PAC must be present in the service ticket which SSSD will request with the help of the user's TGT. If the PAC is not available the authentication will fail.
pt: O PAC tem de estar presente no bilhete de serviço o qual o SSSD irá requerer com a ajuda do TGT do utilizador. Se o PAC não estiver disponível a autenticação irá falhar.

source: If the PAC is present check if the user principal name (UPN) information is consistent.
pt: Se o PAC estiver presente verifica se a informação de nome principal do utilizador (UPN) é consistente.

source: This option should be used together with 'check_upn' and handles the case where a UPN is set on the server-side but is not read by SSSD. The typical example is a FreeIPA domain where 'ldap_user_principal' is set to a not existing attribute name. This was typically done to work-around issues in the handling of enterprise principals. But this is fixed since quite some time and FreeIPA can handle enterprise principals just fine and there is no need anymore to set 'ldap_user_principal'.
pt: Esta opção deve ser usada juntamente com 'check_upn' e lida com o caso onde uma UPN é definida no lado do servidor mas não é lida pelo SSSD. O exemplo típico é um domínio FreeIPA onde 'ldap_user_principal' está definido para um nome de atributo não existente. Isto era feito tipicamente para contornar problemas com o lidar de principais de empresa. Mas isto está corrigido já há muito tempo e o FreeIPA consegue lidar com principais de empresa muito bem e não há mais necessidade de definir 'ldap_user_principal'.

source: Currently this option is set by default to avoid regressions in such environments. A log message will be added to the system log and SSSD's debug log in case a UPN is found in the PAC but not in SSSD's cache. To avoid this log message it would be best to evaluate if the 'ldap_user_principal' option can be removed. If this is not possible, removing 'check_upn' will skip the test and avoid the log message.
pt: Atualmente esta opção é definida por predefinição para evitar regressões em tais ambientes. Uma mensagem de relatório será adicionada ao log do sistema e ao log de depuração do SSSD no caso duma UPN ser encontrada no PAC mas não na cache do SSSD. Para evitar esta mensagem no relatório seria melhor avaliar se a opção 'ldap_user_principal' pode ser removida. Se isto não for possível, remover 'check_upn' irá saltar o teste e evitar a mensagem no log.

source: The PAC must contain the UPN-DNS-INFO buffer, implies 'check_upn'.
pt: O PAC tem de conter o buffer UPN-DNS-INFO, implica 'check_upn'.

source: If the PAC is present and the extension to the UPN-DNS-INFO buffer is available check if the information in the extension is consistent.
pt: Se o PAC estiver presente e a extensão para o buffer UPN-DNS-INFO estiver disponível verifica se a informação na extensão é consistente.

source: The PAC must contain the extension of the UPN-DNS-INFO buffer, implies 'check_upn_dns_info_ex', 'upn_dns_info_present' and 'check_upn'.
pt: O PAC tem de conter a extensão do buffer UPN-DNS-INFO buffer, implica 'check_upn_dns_info_ex', 'upn_dns_info_present' e 'check_upn'.

source: The following options can be used alone or in a comma-separated list: <placeholder type="variablelist" id="0"/>
pt: As seguintes opções podem ser usadas sozinhas ou numa lista separadas por vírgulas: <placeholder type="variablelist" id="0"/>

source: Default: no_check (AD and IPA provider 'check_upn, check_upn_allow_missing, check_upn_dns_info_ex')
pt: Predefinição: no_check (provedores AD e IPA 'check_upn, check_upn_allow_missing, check_upn_dns_info_ex')

source: Session recording configuration options
pt: Opções de configuração de registo de sessão

source: Session recording works in conjunction with <citerefentry> <refentrytitle>tlog-rec-session</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, a part of tlog package, to log what users see and type when they log in on a text terminal. See also <citerefentry> <refentrytitle>sssd-session-recording</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
pt: O registo de sessão funciona em conjunto com <citerefentry> <refentrytitle>tlog-rec-session</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, uma parte do pacote tlog, para registar o que os utilizadores vêm e escrevem quando fazem login num terminal de texto. Veja também <citerefentry> <refentrytitle>sssd-session-recording</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: These options can be used to configure session recording.
pt: Estas opções podem ser usadas para configurar o registo de sessão.

source: No users are recorded.
pt: Nenhum utilizador é registado.

source: Users/groups specified by <replaceable>users</replaceable> and <replaceable>groups</replaceable> options are recorded.
pt: Os utilizadores/grupos especificados pelas opções <replaceable>users</replaceable> e <replaceable>groups</replaceable> são registados.

source: All users are recorded.
pt: Todos os utilizadores são registados.

source: One of the following strings specifying the scope of session recording: <placeholder type="variablelist" id="0"/>
pt: Uma das seguintes strings especificando o escopo de registo de sessão: <placeholder type="variablelist" id="0"/>

source: Default: "none"
pt: Predefinição: "none"

source: A comma-separated list of users which should have session recording enabled. Matches user names as returned by NSS. I.e. after the possible space replacement, case changes, etc.
pt: Uma lista separada por vírgulas de utilizadores que deverão ter registo de sessão activo. Corresponde a nomes de utilizadores como retornados pelo NSS, isto é, após a possível substituição de espaços, alterações de minúscula/maiúscula, etc.

source: Default: Empty. Matches no users.
pt: Predefinição: Vazio. Não corresponde a nenhum utilizador.

source: A comma-separated list of groups, members of which should have session recording enabled. Matches group names as returned by NSS. I.e. after the possible space replacement, case changes, etc.
pt: Uma lista separada por vírgulas de grupos, cujos membros deverão ter registo de sessão activo. Corresponde a nomes de grupos como retornados pelo NSS, isto é, após a possível substituição de espaços, alterações de minúscula/maiúscula, etc.

source: NOTE: using this option (having it set to anything) has a considerable performance cost, because each uncached request for a user requires retrieving and matching the groups the user is member of.
pt: NOTA: usar esta opção (tê-la definida para qualquer coisa) tem um custo de performance considerável, porque cada pedido não-em-cache para um utilizador requer obter e corresponder os grupos do qual o utilizador é membro.

source: Default: Empty. Matches no groups.
pt: Predefinição: Vazio. Não corresponde a nenhum grupo.

source: A comma-separated list of users to be excluded from recording, only applicable with 'scope=all'.
pt: Uma lista de utilizadores que devem a serem excluídos do registo, apenas aplicável com 'scope=all'.

source: Default: Empty. No users excluded.
pt: Predefinição: Empty. Nenhum utilizador excluído.

source: A comma-separated list of groups, members of which should be excluded from recording. Only applicable with 'scope=all'.
pt: Uma lista de grupos separados por vírgulas, cujos membros devem ser excluídos do registo. Apenas aplicável com 'scope=all'.

source: Default: Empty. No groups excluded.
pt: Predefinição: Empty. Nenhum grupo excluído.

source: DOMAIN SECTIONS
pt: SECÇÕES DE DOMÍNIO

source: Explicitly enable or disable the domain. If <quote>true</quote>, the domain is always <quote>enabled</quote>. If <quote>false</quote>, the domain is always <quote>disabled</quote>. If this option is not set, the domain is enabled only if it is listed in the domains option in the <quote>[sssd]</quote> section.
pt: Explicitamente activa ou desactiva o domínio. Se <quote>true</quote>, o domínio está sempre <quote>activo</quote>. Se <quote>false</quote>, o domínio está sempre <quote>inactivo</quote>. Se esta opção não for definida, o domínio é activado apenas se estiver listado na opção domains na secção <quote>[sssd]</quote>.
