Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: Directory to store credential caches. All the substitution sequences of krb5_ccname_template can be used here, too, except %d and %P. The directory is created as private and owned by the user, with permissions set to 0700.
pt: Directório para guardar as caches de credenciais. Todas as sequências de substituição de krb5_ccname_template podem ser usadas aqui também, excepto %d e %P. O directório é criado como privado e com o utilizador como dono, com as permissões definidas para 0700.

source: Default: /tmp
pt: Predefinição: /tmp

source: login name
pt: nome de login

source: login UID
pt: UID de login

source: principal name
pt: nome principal

source: realm name
pt: nome de reino

source: home directory
pt: directório home

source: value of krb5_ccachedir
pt: valor de krb5_ccachedir

source: the process ID of the SSSD client
pt: o ID de processo do cliente SSSD

source: a literal '%'
pt: um literal '%'

source: Location of the user's credential cache. Three credential cache types are currently supported: <quote>FILE</quote>, <quote>DIR</quote> and <quote>KEYRING:persistent</quote>. The cache can be specified either as <replaceable>TYPE:RESIDUAL</replaceable>, or as an absolute path, which implies the <quote>FILE</quote> type. In the template, the following sequences are substituted: <placeholder type="variablelist" id="0"/> If the template ends with 'XXXXXX' mkstemp(3) is used to create a unique filename in a safe way.
pt: Localização da cache de credenciais do utilizador. Actualmente são suportados três tipos de cache de credenciais: <quote>FILE</quote>, <quote>DIR</quote> e <quote>KEYRING:persistent</quote>. A cache pode ser especificada como <replaceable>TYPE:RESIDUAL</replaceable>, ou como um caminho absoluto, o que implica o tipo <quote>FILE</quote>. No modelo, as seguintes sequências são substituídas: <placeholder type="variablelist" id="0"/> Se o modelo terminar com 'XXXXXX' é usado o mkstemp(3) para criar um nome de ficheiro único numa maneira segura.

source: When using KEYRING types, the only supported mechanism is <quote>KEYRING:persistent:%U</quote>, which uses the Linux kernel keyring to store credentials on a per-UID basis. This is also the recommended choice, as it is the most secure and predictable method.
pt: Quando se usam tipos KEYRING, o único mecanismo suportado é <quote>KEYRING:persistent:%U</quote>, o qual usa o chaveiro do kernel Linux para guardar as credenciais numa base por UID. Esta é também a escolha recomendada, pois é o método mas seguro e previsível.

source: The default value for the credential cache name is sourced from the profile stored in the system wide krb5.conf configuration file in the [libdefaults] section. The option name is default_ccache_name. See krb5.conf(5)'s PARAMETER EXPANSION paragraph for additional information on the expansion format defined by krb5.conf.
pt: O valor predefinido para o nome da cache de credenciais é obtido a partir do perfil guardado no ficheiro de configuração krb5.conf de todo o sistema na secção [libdefaults]. O nome da opção é default_ccache_name. Veja o parágrafo EXPANSÃO DE PARÂMETROS em krb5.conf(5)'s para informação adicional sobre o formato de expansão definido pelo krb5.conf.

source: NOTE: Please be aware that libkrb5 ccache expansion template from <citerefentry> <refentrytitle>krb5.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> uses different expansion sequences than SSSD.
pt: NOTA: Por favor tenha atenção que o modelo de expansão de cache libkrb5 de <citerefentry> <refentrytitle>krb5.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> usa sequências de expansão diferentes do SSSD.

source: Default: (from libkrb5)
pt: Predefinição: (de libkrb5)

source: The location of the keytab to use when validating credentials obtained from KDCs.
pt: A localização da keytab a usar quando se valida credenciais obtidas a partir de KDCs.

source: krb5_store_password_if_offline (boolean)
pt: krb5_store_password_if_offline (booleano)

source: Store the password of the user if the provider is offline and use it to request a TGT when the provider comes online again.
pt: Guarda a palavra passe do utilizador se o provedor estiver offline e usa-a para pedir um TGT quando o provedor ficar online de novo.

source: NOTE: this feature is only available on Linux. Passwords stored in this way are kept in plaintext in the kernel keyring and are potentially accessible by the root user (with difficulty).
pt: NOTA: esta funcionalidade só está disponível em Linux. As palavras passe guardadas deste modo são mantidas em texto simples no chaveiro do kernel e são potencialmente acessíveis pelo utilizador root (com dificuldade).

source: Enables flexible authentication secure tunneling (FAST) for Kerberos pre-authentication. The following options are supported:
pt: Activa autenticação segura flexível em túnel (FAST) para a pré-autenticação do Kerberos. As seguintes opções são suportadas:

source: <emphasis>never</emphasis> use FAST. This is equivalent to not setting this option at all.
pt: <emphasis>never</emphasis> (nunca) usa FAST. Isto é equivalente a não definir de todo esta opção.

source: <emphasis>try</emphasis> to use FAST. If the server does not support FAST, continue the authentication without it.
pt: <emphasis>try</emphasis> (tenta) usar FAST. Se o servidor não suportar FAST, continua com a autenticação sem isso.

source: <emphasis>demand</emphasis> to use FAST. The authentication fails if the server does not require fast.
pt: <emphasis>demand</emphasis> (obriga) a usar FAST. A autenticação falha se o servidor não requerer fast.

source: Default: not set, i.e. FAST is not used.
pt: Predefinição: não definida, isto é, FAST não é usado.

source: NOTE: a keytab or support for anonymous PKINIT is required to use FAST.
pt: NOTA: é requerido uma keytab ou suporte a PKINIT anônimo para se usar FAST.

source: NOTE: SSSD supports FAST only with MIT Kerberos version 1.8 and later. If SSSD is used with an older version of MIT Kerberos, using this option is a configuration error.
pt: NOTA: SSSD suporta FAST apenas com MIT Kerberos versão 1.8 e posterior. Se o SSSD for usado com uma versão antiga do MIT Kerberos, usar esta opção é um erro de configuração.

source: Specifies the server principal to use for FAST.
pt: Especifica o principal servidor a usar para FAST.

source: krb5_fast_use_anonymous_pkinit (boolean)
pt: krb5_fast_use_anonymous_pkinit (booleano)

source: If set to true try to use anonymous PKINIT instead of a keytab to get the required credential for FAST. The krb5_fast_principal options is ignored in this case.
pt: Se definido para true tenta usar PKINIT anônimo em vez de uma keytab para obter a credencial requerida para FAST. A opção krb5_fast_principal é ignorada neste caso.

source: When krb5_use_kdcinfo is set to true, you can limit the amount of servers handed to <citerefentry> <refentrytitle>sssd_krb5_locator_plugin</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. This might be helpful when there are too many servers discovered using SRV record.
pt: Quando krb5_use_kdcinfo é definida para true, você pode limitar a quantidade de servidores lidados para <citerefentry> <refentrytitle>sssd_krb5_locator_plugin</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Isto pode ser útil quando existem demasiados servidores descobertos usando o registo SRV.

source: The krb5_kdcinfo_lookahead option contains two numbers separated by a colon. The first number represents number of primary servers used and the second number specifies the number of backup servers.
pt: A opção krb5_kdcinfo_lookahead contém dois números separados pelo caractere dois pontos. O primeiro número representa o número de servidores primários usados e o segundo número especifica o número de servidores de backup.

source: For example <emphasis>10:0</emphasis> means that up to 10 primary servers will be handed to <citerefentry> <refentrytitle>sssd_krb5_locator_plugin</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> but no backup servers.
pt: Por exemplo, <emphasis>10:0</emphasis> significa que até 10 servidores primários serão lidados para <citerefentry> <refentrytitle>sssd_krb5_locator_plugin</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> mas nenhum servidor de recurso.

source: Default: 3:1
pt: Predefinição: 3:1

source: krb5_use_enterprise_principal (boolean)
pt: krb5_use_enterprise_principal (booleano)

source: Specifies if the user principal should be treated as enterprise principal. See section 5 of RFC 6806 for more details about enterprise principals.
pt: Especifica se o principal de utilizador deve ser tratado como principal de empresa. Veja a secção 5 de RFC 6806 para mais detalhes sobre principais de empresa.

source: Default: false (AD provider: true)
pt: Predefinição: false (fornecedor AD: true)

source: The IPA provider will set to option to 'true' if it detects that the server is capable of handling enterprise principals and the option is not set explicitly in the config file.
pt: O provedor IPA irá definir a opção para 'true' se detectar que o servidor é capaz de lidar principais de empresa e a opção não está definida explicitamente no ficheiro de configuração.

source: krb5_use_subdomain_realm (boolean)
pt: krb5_use_subdomain_realm (booleano)

source: Specifies to use subdomains realms for the authentication of users from trusted domains. This option can be set to 'true' if enterprise principals are used with upnSuffixes which are not known on the parent domain KDCs. If the option is set to 'true' SSSD will try to send the request directly to a KDC of the trusted domain the user is coming from.
pt: Especifica para se usar reinos de sub-domínios para a autenticação de utilizadores de domínios de confiança. Esta opção pode ser definida para 'true' se principais de empresa foram usadas com upnSuffixes que são desconhecidos nos KDCs do domínio pai. Se a opção for definida para 'true' o SSSD irá tentar enviar o pedido directamente para um KDC do domínio de confiança de onde o utilizador venha.

source: The list of mappings is given as a comma-separated list of pairs <quote>username:primary</quote> where <quote>username</quote> is a UNIX user name and <quote>primary</quote> is a user part of a kerberos principal. This mapping is used when user is authenticating using <quote>auth_provider = krb5</quote>.
pt: A lista de mapeamentos é dada como uma lista separada por vírgulas de pares <quote>username:primary</quote> onde <quote>username</quote> é um nome de utilizador UNIX e <quote>primary</quote> é uma parte utilizador de um principal kerberos. Este mapeamento é usado quando o utilizador é autenticado usando <quote>auth_provider = krb5</quote>.

source: <quote>joe</quote> and <quote>dick</quote> are UNIX user names and <quote>juser</quote> and <quote>richard</quote> are primaries of kerberos principals. For user <quote>joe</quote> resp. <quote>dick</quote> SSSD will try to kinit as <quote>juser@REALM</quote> resp. <quote>richard@REALM</quote>.
pt: <quote>joe</quote> e <quote>dick</quote> são nomes de utilizador UNIX e <quote>juser</quote> e <quote>richard</quote> são primários de principais do kerberos. Para utilizador <quote>joe</quote> resp. <quote>dick</quote> o SSSD irá tentar fazer kinit como <quote>juser@REALM</quote> resp. <quote>richard@REALM</quote>.

source: If the auth-module krb5 is used in an SSSD domain, the following options must be used. See the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page, section <quote>DOMAIN SECTIONS</quote>, for details on the configuration of an SSSD domain. <placeholder type="variablelist" id="0"/>
pt: Se o auth-module krb5 for usado num domínio SSSD, as seguintes opções têm de ser usadas. Veja o manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>, secção <quote>SECÇÕES DE DOMÍNIO</quote>, para detalhes sobre a configuração de um domínio SSSD. <placeholder type="variablelist" id="0"/>

source: The following example assumes that SSSD is correctly configured and FOO is one of the domains in the <replaceable>[sssd]</replaceable> section. This example shows only configuration of Kerberos authentication; it does not include any identity provider.
pt: O exemplo seguinte assume que o SSSD está presentemente configurado e FOO é um dos domínios na secção <replaceable>[sssd]</replaceable>. Este exemplo mostra apenas configuração da autenticação Kerberos; não inclui nenhum provedor de identidade.

source: perform cache cleanup
pt: executa limpeza da cache

source: <command>sss_cache</command> <arg choice='opt'> <replaceable>options</replaceable> </arg>
pt: <command>sss_cache</command> <arg choice='opt'> <replaceable>opções</replaceable> </arg>

source: <command>sss_cache</command> invalidates records in SSSD cache. Invalidated records are forced to be reloaded from server as soon as related SSSD backend is online. Options that invalidate a single object only accept a single provided argument.
pt: O <command>sss_cache</command> invalida registos na cache do SSSD. Os registos invalidados são forçados a ser recarregados a partir do servidor assim que o backend SSSD relacionado esteja online. AS opções que invalidam um único objecto apenas aceitam um único argumento fornecido.

source: Invalidate all cached entries.
pt: Invalida todas as entradas em cache.

source: Invalidate specific user.
pt: Invalida utilizador especifico.

source: Invalidate all user records. This option overrides invalidation of specific user if it was also set.
pt: Invalida todos os registos de utilizadores. Esta opção sobrepõe a invalidação de utilizador especifico se estiver também definida.

source: <option>-g</option>,<option>--group</option> <replaceable>group</replaceable>
pt: <option>-g</option>,<option>--group</option> <replaceable>grupo</replaceable>

source: Invalidate specific group.
pt: Invalida grupo especifico.

source: Invalidate all group records. This option overrides invalidation of specific group if it was also set.
pt: Invalida todos os registos de grupos. Esta opção sobrepõe a invalidação de grupo especifico se estiver também definida.

source: <option>-n</option>,<option>--netgroup</option> <replaceable>netgroup</replaceable>
pt: <option>-n</option>,<option>--netgroup</option> <replaceable>grupo-de-rede</replaceable>

source: Invalidate specific netgroup.
pt: Invalida grupo-de-rede especifico.

source: Invalidate all netgroup records. This option overrides invalidation of specific netgroup if it was also set.
pt: Invalida todos os registos de grupo-de-rede. Esta opção sobrepõe a invalidação de grupo-de-rede especifico se estiver também definida.

source: <option>-s</option>,<option>--service</option> <replaceable>service</replaceable>
pt: <option>-s</option>,<option>--service</option> <replaceable>serviço</replaceable>

source: Invalidate specific service.
pt: Invalida serviço especifico.

source: Invalidate all service records. This option overrides invalidation of specific service if it was also set.
pt: Invalida todos os registos de serviços. Esta opção sobrepõe a invalidação de serviço especifico se estiver também definida.

source: Invalidate specific autofs maps.
pt: Invalida mapas autofs específicos.

source: Invalidate all autofs maps. This option overrides invalidation of specific map if it was also set.
pt: Invalida todos os mapas autofs Esta opção sobrepõe a invalidação de mapa especifico se estiver também definida.

source: <option>-h</option>,<option>--ssh-host</option> <replaceable>hostname</replaceable>
pt: <option>-h</option>,<option>--ssh-host</option> <replaceable>nome-máquina</replaceable>

source: Invalidate SSH public keys of a specific host.
pt: Invalida chaves públicas SSH para uma máquina específica.

source: Invalidate SSH public keys of all hosts. This option overrides invalidation of SSH public keys of specific host if it was also set.
pt: Invalida chaves públicas SSH para todas as máquinas. Esta opção sobrepõe a invalidação de chaves públicas SSH para máquinas específicas se estiver também definida.

source: <option>-r</option>,<option>--sudo-rule</option> <replaceable>rule</replaceable>
pt: <option>-r</option>,<option>--sudo-rule</option> <replaceable>regra</replaceable>

source: Invalidate particular sudo rule.
pt: Invalida regra sudo particular.

source: Invalidate all cached sudo rules. This option overrides invalidation of specific sudo rule if it was also set.
pt: Invalida todas as regras sudo em cache. Esta opção sobrepõe a invalidação de regra sudo específica se estiver também definida.

source: <option>-d</option>,<option>--domain</option> <replaceable>domain</replaceable>
pt: <option>-d</option>,<option>--domain</option> <replaceable>domínio</replaceable>

source: Restrict invalidation process only to a particular domain.
pt: Restringe processo de invalidação apenas a um domínio particular.

source: EFFECTS ON THE FAST MEMORY CACHE
pt: EFEITOS NA CACHE DE MEMÓRIA RÁPIDA

source: <command>sss_cache</command> also invalidates the memory cache. Since the memory cache is a file which is mapped into the memory of each process which called SSSD to resolve users or groups the file cannot be truncated. A special flag is set in the header of the file to indicate that the content is invalid and then the file is unlinked by SSSD's NSS responder and a new cache file is created. Whenever a process is now doing a new lookup for a user or a group it will see the flag, close the old memory cache file and map the new one into its memory. When all processes which had opened the old memory cache file have closed it while looking up a user or a group the kernel can release the occupied disk space and the old memory cache file is finally removed completely.
pt: O <command>sss_cache</command> também invalida a cache de memória. Como a cache de memória é um ficheiro que é mapeado na memória de cada processo que chamou o SSSD para resolver utilizadores e grupos, o ficheiro não pode ser truncado. É definida uma bandeira especial no cabeçalho do ficheiro para indicar que o conteúdo é inválido e depois o ficheiro é desvinculado pelo respondedor NSS do SSSD e é criado um novo ficheiro de cache. Sempre que um processo está a fazer uma nova procura por um utilizador ou um grupo irá ver a bandeira, fechar o ficheiro de cache de memória antigo e mapear o novo na sua memória. Quando todos os processos que abriram o ficheiro de cache de memória antigo o tiverem fechado enquanto procuram um utilizador ou grupo o kernel pode libertar o espaço de disco ocupado e o ficheiro de cache de memória antigo é finalmente removido completamente.

source: A special case is long running processes which are doing user or group lookups only at startup, e.g. to determine the name of the user the process is running as. For those lookups the memory cache file is mapped into the memory of the process. But since there will be no further lookups this process would never detect if the memory cache file was invalidated and hence it will be kept in memory and will occupy disk space until the process stops. As a result calling <command>sss_cache</command> might increase the disk usage because old memory cache files cannot be removed from the disk because they are still mapped by long running processes.
pt: Um caso especial são processos de execução longa que fazem procuras de utilizadores ou grupos apenas no arranque, ex, para determinar o nome do utilizador com que o processo corre como. Para essas procuras o ficheiro de cache de memória é mapeado para a memória do processo. Mas como não irão existir mais procuras este processo nunca vai detectar se o ficheiro de cache de memória foi invalidado e assim vai ser mentido em memória e vai ocupar espaço no disco até que o processo pare. Como resultado chamar o <command>sss_cache</command> pode aumentar a utilização do disco porque os ficheiros de cache de memória antigos não podem ser removidos do disco porque ainda estão mapeados por processos de execução longa.

source: A possible work-around for long running processes which are looking up users and groups only at startup or very rarely is to run them with the environment variable SSS_NSS_USE_MEMCACHE set to "NO" so that they won't use the memory cache at all and not map the memory cache file into the memory. In general a better solution is to tune the cache timeout parameters so that they meet the local expectations and calling <command>sss_cache</command> is not needed.
pt: Um contorno possível para processos de execução longa que estão a procurar utilizadores e grupos apenas no arranque ou muito raramente são corridos com a variável de ambiente SSS_NSS_USE_MEMCACHE definida para "NO" para que não usem a cache de memória de todo e não mapearem o ficheiro de cache de memória na memória. Em geral uma solução melhor é afinar os parâmetros de tempo limite de cache para que corresponda às expectativas locais e chamar o <command>sss_cache</command> não seja necessário.

source: [DEPRECATED] change debug level while SSSD is running
pt: [DESCONTINUADO] muda o nível de depuração enquanto o SSSD está a correr

source: <command>sss_debuglevel</command> <arg choice='opt'> <replaceable>options</replaceable> </arg> <arg choice='plain'><replaceable>NEW_DEBUG_LEVEL</replaceable></arg>
pt: <command>sss_debuglevel</command> <arg choice='opt'> <replaceable>options</replaceable> </arg> <arg choice='plain'><replaceable>NOVO_NÍVEL_DEPURAÇÃO</replaceable></arg>

source: <command>sss_debuglevel</command> is deprecated and replaced by the sssctl debug-level command. Please refer to the <command>sssctl</command> man page for more information on sssctl usage.
pt: <command>sss_debuglevel</command> está descontinuado e foi substituído pelo comando debug-level do sssctl. Por favor consulte o manual do <command>sssctl</command> para mais informação sobre a utilização do sssctl.

source: seed the SSSD cache with a user
pt: semeia a cache do SSSD com um utilizador

source: <command>sss_seed</command> <arg choice='opt'> <replaceable>options</replaceable> </arg> <arg choice='plain'>-D <replaceable>DOMAIN</replaceable></arg> <arg choice='plain'>-n <replaceable>USER</replaceable></arg>
pt: <command>sss_seed</command> <arg choice='opt'> <replaceable>opções</replaceable> </arg> <arg choice='plain'>-D <replaceable>DOMÍNIO</replaceable></arg> <arg choice='plain'>-n <replaceable>UTILIZADOR</replaceable></arg>

source: <command>sss_seed</command> seeds the SSSD cache with a user entry and temporary password. If a user entry is already present in the SSSD cache then the entry is updated with the temporary password.
pt: <command>sss_seed</command> semeia a cache do SSSD com uma entrada de utilizador e palavra passe temporária. Se o utilizador já estiver presente na cache do SSSD então a entrada é actualizada com a palavra passe temporária.

source: <option>-D</option>,<option>--domain</option> <replaceable>DOMAIN</replaceable>
pt: <option>-D</option>,<option>--domain</option> <replaceable>DOMÍNIO</replaceable>

source: Provide the name of the domain in which the user is a member of. The domain is also used to retrieve user information. The domain must be configured in sssd.conf. The <replaceable>DOMAIN</replaceable> option must be provided. Information retrieved from the domain overrides what is provided in the options.
pt: Fornece o nome do domínio no qual o utilizador é membro. O domínio é também usado para obter informação do utilizador. O domínio tem de ser configurado no sssd.conf. A opção <replaceable>DOMAIN</replaceable> tem de ser fornecida. option must be provided. A informação obtida a partir do domínio sobrepõe a que é fornecida nas opções.
