Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: OR Logic Applies: A user will be denied access if they are listed in `simple_deny_users` or if they are a member of any group in `simple_deny_groups`.
pt: Aplica-se Lógica OR: Um utilizador terá acesso engado s estiver listado em `simple_deny_users` ou se for membro de qualquer grupo em `simple_deny_groups`.

source: Refer to the section <quote>DOMAIN SECTIONS</quote> of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page for details on the configuration of an SSSD domain. <placeholder type="variablelist" id="0"/>
pt: Consulte a secção <quote>SECÇÕES DE DOMÍNIO</quote> do manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para detalhes da configuração de um domínio SSSD. <placeholder type="variablelist" id="0"/>

source: Specifying no values for any of the lists is equivalent to skipping it entirely. Beware of this while generating parameters for the simple provider using automated scripts.
pt: Especificar nenhum valor para nenhuma das listas é equivalente a saltar todas inteiramente. Tenha cuidado com isto enquanto gera parâmetros para o provedor simples usando scripts automatizados.

source: The following example assumes that SSSD is correctly configured and example.com is one of the domains in the <replaceable>[sssd]</replaceable> section. This example shows only the simple access provider-specific options.
pt: O seguinte exemplo assume que o SSSD está actualmente configurado e example.com é um dos domínios na secção <replaceable>[sssd]</replaceable>. Este exemplo mostra apenas as opções específicas do provedor de acesso simples.

source: The complete group membership hierarchy is resolved before the access check, thus even nested groups can be included in the access lists. Please be aware that the <quote>ldap_group_nesting_level</quote> option may impact the results and should be set to a sufficient value. (<citerefentry> <refentrytitle>sssd-ldap</refentrytitle><manvolnum>5</manvolnum> </citerefentry>) option.
pt: A hierarquia completa de membros do grupo é resolvida antes da verificação de acesso, assim até os grupos aninhados podem ser incluídos nas listas de acesso. Por favor lembre-se que a opção <quote>ldap_group_nesting_level</quote> pode ter impacto nos resultados e deve ser definida para um valor suficiente. Opção (<citerefentry> <refentrytitle>sssd-ldap</refentrytitle><manvolnum>5</manvolnum> </citerefentry>).

source: SSSD Certificate Matching and Mapping Rules
pt: Correspondência de Certificados e Regras de Mapeamento do SSSD

source: The manual page describes the rules which can be used by SSSD and other components to match X.509 certificates and map them to accounts.
pt: Este manual descreve as regras que podem ser usadas pelo SSSD e outros componentes para corresponder a certificados X.509 e os mapear em contas.

source: Each rule has four components, a <quote>priority</quote>, a <quote>matching rule</quote>, a <quote>mapping rule</quote> and a <quote>domain list</quote>. All components are optional. A missing <quote>priority</quote> will add the rule with the lowest priority. The default <quote>matching rule</quote> will match certificates with the digitalSignature key usage and clientAuth extended key usage. If the <quote>mapping rule</quote> is empty the certificates will be searched in the userCertificate attribute as DER encoded binary. If no domains are given only the local domain will be searched.
pt: Cada regra tem quatro componentes, um <quote>priority</quote>, um <quote>matching rule</quote>, um <quote>mapping rule</quote> e um <quote>domain list</quote>. Todos os componentes são opcionais. Um <quote>priority</quote> em falta irá adicionar a regra com a prioridade mais baixa. A <quote>matching rule</quote> predefinida irá corresponder a certificados com a utilização de chave digitalSignature e utilização de chave estendida clientAuth, Se a <quote>mapping rule</quote> estiver vazia os certificados serão procurados no atributo userCertificate como binário codificado em DER. Se nenhum domínio for dado apenas será procurado o domínio local.

source: To allow extensions or completely different style of rule the <quote>mapping</quote> and <quote>matching rules</quote> can contain a prefix separated with a ':' from the main part of the rule. The prefix may only contain upper-case ASCII letters and numbers. If the prefix is omitted the default type will be used which is 'KRB5' for the matching rules and 'LDAP' for the mapping rules.
pt: Para permitir extensões ou estilo completamente diferente de regra o <quote>mapping</quote> e <quote>matching rules</quote> podem conter um prefixo separado por um ':' da principal parte de regra. O prefixo só pode conter letras maiúsculas ASCII e números. Se o prefixo for omitido será usado o tipo predefinido que é 'KRB5' para as regras de correspondência e "LDAP' para as regras de mapeamento.

source: The 'sssctl' utility provides the 'cert-eval-rule' command to check if a given certificate matches a matching rules and how the output of a mapping rule would look like.
pt: O utilitário 'sssctl' fornece o comando 'cert-eval-rule' para verificar se um dado certificado corresponde a uma regra de correspondência e como o resultado de uma regra de mapeamento se iria parecer.

source: RULE COMPONENTS
pt: COMPONENTES DE REGRA

source: PRIORITY
pt: PRIORIDADE

source: The rules are processed by priority while the number '0' (zero) indicates the highest priority. The higher the number the lower is the priority. A missing value indicates the lowest priority. The rules processing is stopped when a matched rule is found and no further rules are checked.
pt: As regras são processadas pela prioridade e o número '0' (zero) indica a prioridade mais alta. Quanto mais alto o número mais baixa a prioridade. Um valor em falta indica a prioridade mais baixa. O processamento de regras é parado quando é encontrada uma regra correspondente e não são verificadas mais regras.

source: Internally the priority is treated as unsigned 32bit integer, using a priority value larger than 4294967295 will cause an error.
pt: Internamente a prioridade é tratada como um inteiro de 32bit não assinado, usar um valor de prioridade maior que 4294967295 irá causar um erro.

source: If multiple rules have the same priority and only one of the related matching rules applies, this rule will be chosen. If there are multiple rules with the same priority which matches, one is chosen but which one is undefined. To avoid this undefined behavior either use different priorities or make the matching rules more specific e.g. by using distinct &lt;ISSUER&gt; patterns.
pt: Se várias regras tiverem a mesma prioridade e apenas uma das regras correspondentes relacionadas se aplica, essa regra será escolhida. Se existirem com a mesma prioridade que correspondem, é escolhida uma mas qual delas é não está definido. Para evitar este comportamento indefinido ou se usa diferentes prioridades ou torne as regras de correspondência mas específicas ex. ao usar padrões &lt;ISSUER&gt; distintos.

source: MATCHING RULE
pt: REGRA DE CORRESPONDÊNCIA

source: The matching rule is used to select a certificate to which the mapping rule should be applied. It uses a system similar to the one used by <quote>pkinit_cert_match</quote> option of MIT Kerberos. It consists of a keyword enclosed by '&lt;' and '&gt;' which identified a certain part of the certificate and a pattern which should be found for the rule to match. Multiple keyword pattern pairs can be either joined with '&amp;&amp;' (and) or '&#124;&#124;' (or).
pt: A regra correspondente é usada para selecionar o certificado ao qual a regra de mapeamento deve ser aplicada. Usa um sistema semelhante aquele usado pela opção <quote>pkinit_cert_match</quote> do MIT Kerberos. Consiste de uma palavra chave envolta por '&lt;' e '&gt;' o que identifica uma certa parte do certificado e um padrão que deve ser encontrado para que a regra corresponda. Múltiplos pares de padrões de palavra chave pode ser ou juntados com '&amp;&amp;' (e) ou '&#124;&#124;' (ou).

source: Given the similarity to MIT Kerberos the type prefix for this rule is 'KRB5'. But 'KRB5' will also be the default for <quote>matching rules</quote> so that "&lt;SUBJECT&gt;.*,DC=MY,DC=DOMAIN" and "KRB5:&lt;SUBJECT&gt;.*,DC=MY,DC=DOMAIN" are equivalent.
pt: Dada a semelhança com o MIT Kerberos o prefixo de tipo para esta regra é 'KRB5'. Mas 'KRB5' irá ser também a predefinição para <quote>matching rules</quote> para que "&lt;SUBJECT&gt;.*,DC=MY,DC=DOMAIN" e "KRB5:&lt;SUBJECT&gt;.*,DC=MY,DC=DOMAIN" sejam equivalentes.

source: &lt;SUBJECT&gt;regular-expression
pt: &lt;SUBJECT&gt;expressão-regular

source: With this a part or the whole subject name of the certificate can be matched. For the matching POSIX Extended Regular Expression syntax is used, see regex(7) for details.
pt: Com isto uma parte ou o nome completo de sujeito do certificado pode ser correspondido. Para correspondência é usada sintaxe Extended Regular Expression do POSIX, veja regex(7) para detalhes.

source: For the matching the subject name stored in the certificate in DER encoded ASN.1 is converted into a string according to RFC 4514. This means the most specific name component comes first. Please note that not all possible attribute names are covered by RFC 4514. The names included are 'CN', 'L', 'ST', 'O', 'OU', 'C', 'STREET', 'DC' and 'UID'. Other attribute names might be shown differently on different platform and by different tools. To avoid confusion those attribute names are best not used or covered by a suitable regular-expression.
pt: Para corresponder o nome do sujeito guardado no certificado em ASN.1 codificado em DER é convertido numa string de acordo com RFC 4514. Isto significa que o componente nome mais especifico vem primeiro. Por favor note que nem todos os nomes de atributo possíveis são cobertos por by RFC 4514. Os nomes incluídos são 'CN', 'L', 'ST', 'O', 'OU', 'C', 'STREET', 'DC' e 'UID'. Outros nomes de atributos podem ser mostrados de maneira diferente em plataformas diferentes ou por diferentes ferramentas. Para evitar confusões é melhor não usar esses nomes de atributos ou cobri-los por uma expressão regular apropriada.

source: Example: &lt;SUBJECT&gt;.*,DC=MY,DC=DOMAIN
pt: Exemplo: &lt;SUBJECT&gt;.*,DC=MY,DC=DOMAIN

source: Please note that the characters "^.[$()|*+?{\" have a special meaning in regular expressions and must be escaped with the help of the '\' character so that they are matched as ordinary characters.
pt: Por favor note que os caracteres "^.[$()|*+?{\\" têm um significado especial em expressões regulares e têm de ser escapados com a ajuda do caractere '\' para que correspondam como caracteres normais.

source: Example: &lt;SUBJECT&gt;^CN=.* \(Admin\),DC=MY,DC=DOMAIN$
pt: Exemplo: &lt;SUBJECT&gt;^CN=.* \(Admin\),DC=MY,DC=DOMAIN$

source: &lt;ISSUER&gt;regular-expression
pt: &lt;ISSUER&gt;expressão-regular

source: With this a part or the whole issuer name of the certificate can be matched. All comments for &lt;SUBJECT&gt; apply her as well.
pt: Com isto uma parte do nome completo do emissor do certificado pode ser correspondida. Todos os comentários para &lt;SUBJECT&gt; também se aplicam aqui.

source: Example: &lt;ISSUER&gt;^CN=My-CA,DC=MY,DC=DOMAIN$
pt: Exemplo: &lt;ISSUER&gt;^CN=My-CA,DC=MY,DC=DOMAIN$

source: This option can be used to specify which key usage values the certificate should have. The following values can be used in a comma separated list:
pt: Esta opção pode ser usada para especificar quais valores de utilização de chave o certificado deve ter. Os seguintes valores podem ser usados numa lista separados por vírgulas:

source: A numerical value in the range of a 32bit unsigned integer can be used as well to cover special use cases.
pt: Um valor numérico no alcance de inteiro de 32bit não assinado pode ser usado também para cobrir casos de utilização especiais.

source: Example: &lt;KU&gt;digitalSignature,keyEncipherment
pt: Exemplo: &lt;KU&gt;digitalSignature,keyEncipherment

source: This option can be used to specify which extended key usage the certificate should have. The following value can be used in a comma separated list:
pt: Esta opção pode ser usada para especificar qual utilização de chave estendida o certificado deve ter. Os seguintes valores podem ser usados numa lista separados por vírgulas:

source: Extended key usages which are not listed above can be specified with their OID in dotted-decimal notation.
pt: Utilizações de chave estendida que não estejam listadas em cima podem ser especificadas com o seu OID em notação de pontuação-decimal.

source: Example: &lt;EKU&gt;clientAuth,1.3.6.1.5.2.3.4
pt: Exemplo: &lt;EKU&gt;clientAuth,1.3.6.1.5.2.3.4

source: &lt;SAN&gt;regular-expression
pt: &lt;SAN&gt;expressão-regular

source: To be compatible with the usage of MIT Kerberos this option will match the Kerberos principals in the PKINIT or AD NT Principal SAN as &lt;SAN:Principal&gt; does.
pt: Para ser compatível com a utilização de MIT Kerberos esta opção irá corresponder aos principais de Kerberos no SAN Principal PKINIT ou AD NT como faz o &lt;SAN:Principal&gt;.

source: Example: &lt;SAN&gt;.*@MY\.REALM
pt: Exemplo: &lt;SAN&gt;.*@MY\.REALM

source: &lt;SAN:Principal&gt;regular-expression
pt: &lt;SAN:Principal&gt;expressão-regular

source: Match the Kerberos principals in the PKINIT or AD NT Principal SAN.
pt: Corresponde aos principais de Kerberos no SAN Principal PKINIT ou AD NT.

source: Example: &lt;SAN:Principal&gt;.*@MY\.REALM
pt: Exemplo: &lt;SAN:Principal&gt;.*@MY\.REALM

source: &lt;SAN:ntPrincipalName&gt;regular-expression
pt: &lt;SAN:ntPrincipalName&gt;expressão-regular

source: Match the Kerberos principals from the AD NT Principal SAN.
pt: Corresponde aos principais de Kerberos no SAN Principal AD NT.

source: Example: &lt;SAN:ntPrincipalName&gt;.*@MY.AD.REALM
pt: Exemplo: &lt;SAN:ntPrincipalName&gt;.*@MY.AD.REALM

source: &lt;SAN:pkinit&gt;regular-expression
pt: &lt;SAN:pkinit&gt;expressão-regular

source: Match the Kerberos principals from the PKINIT SAN.
pt: Corresponde aos principais de Kerberos no SAN PKINIT.

source: Example: &lt;SAN:ntPrincipalName&gt;.*@MY\.PKINIT\.REALM
pt: Exemplo: &lt;SAN:ntPrincipalName&gt;.*@MY\.PKINIT\.REALM

source: &lt;SAN:dotted-decimal-oid&gt;regular-expression
pt: &lt;SAN:dotted-decimal-oid&gt;expressão-regular

source: Take the value of the otherName SAN component given by the OID in dotted-decimal notation, interpret it as string and try to match it against the regular expression.
pt: Toma o valor do componente SAN otherName dado pelo OID em notação de pontuação-decimal, interpreta-o como uma string e tenta corresponde-lo com a expressão regular.

source: Example: &lt;SAN:1.2.3.4&gt;test
pt: Exemplo: &lt;SAN:1.2.3.4&gt;test

source: Do a binary match with the base64 encoded blob against all otherName SAN components. With this option it is possible to match against custom otherName components with special encodings which could not be treated as strings.
pt: Faz uma correspondência binária com o borrão codificado em base64 contra todos os componentes SAN otherName. Com esta opção é possível corresponder contra componentes otherName personalizados com codificações especiais que não podem ser tratados como strings.

source: Example: &lt;SAN:otherName&gt;MTIz
pt: Exemplo: &lt;SAN:otherName&gt;MTIz

source: &lt;SAN:rfc822Name&gt;regular-expression
pt: &lt;SAN:rfc822Name&gt;expressão-regular

source: Match the value of the rfc822Name SAN.
pt: Corresponde ao valor de rfc822Name SAN.

source: Example: &lt;SAN:rfc822Name&gt;.*@email\.domain
pt: Exemplo: &lt;SAN:rfc822Name&gt;.*@email\\.domain

source: &lt;SAN:dNSName&gt;regular-expression
pt: &lt;SAN:dNSName&gt;expressão-regular

source: Match the value of the dNSName SAN.
pt: Corresponde ao valor de dNSName SAN.

source: Example: &lt;SAN:dNSName&gt;.*\.my\.dns\.domain
pt: Exemplo: &lt;SAN:dNSName&gt;.*\\.my\\.dns\\.domain

source: Binary match the value of the x400Address SAN.
pt: Corresponde em binário ao valor de x400Address SAN.

source: Example: &lt;SAN:x400Address&gt;MTIz
pt: Exemplo: &lt;SAN:x400Address&gt;MTIz

source: &lt;SAN:directoryName&gt;regular-expression
pt: &lt;SAN:directoryName&gt;expressão-regular

source: Match the value of the directoryName SAN. The same comments as given for &lt;ISSUER&gt; and &lt;SUBJECT&gt; apply here as well.
pt: Corresponde o valor do SAN directoryName. OS mesmos comentários que são dados para &lt;ISSUER&gt; e &lt;SUBJECT&gt; aplicam-se aqui também.

source: Example: &lt;SAN:directoryName&gt;.*,DC=com
pt: Exemplo: &lt;SAN:directoryName&gt;.*,DC=com

source: Binary match the value of the ediPartyName SAN.
pt: Corresponde em binário ao valor de ediPartyName SAN.

source: Example: &lt;SAN:ediPartyName&gt;MTIz
pt: Exemplo: &lt;SAN:ediPartyName&gt;MTIz

source: &lt;SAN:uniformResourceIdentifier&gt;regular-expression
pt: &lt;SAN:uniformResourceIdentifier&gt;expressão-regular

source: Match the value of the uniformResourceIdentifier SAN.
pt: Corresponde ao valor de uniformResourceIdentifier SAN.

source: Example: &lt;SAN:uniformResourceIdentifier&gt;URN:.*
pt: Exemplo: &lt;SAN:uniformResourceIdentifier&gt;URN:.*

source: &lt;SAN:iPAddress&gt;regular-expression
pt: &lt;SAN:iPAddress&gt;expressão-regular

source: Match the value of the iPAddress SAN.
pt: Corresponde ao valor de iPAddress SAN.

source: Example: &lt;SAN:iPAddress&gt;192\.168\..*
pt: Exemplo: &lt;SAN:iPAddress&gt;192\\.168\\..*

source: &lt;SAN:registeredID&gt;regular-expression
pt: &lt;SAN:registeredID&gt;expressão-regular

source: Match the value of the registeredID SAN as dotted-decimal string.
pt: Corresponde o valor de SAN registeredID como string de pontuação-decimal.

source: Example: &lt;SAN:registeredID&gt;1\.2\.3\..*
pt: Exemplo: &lt;SAN:registeredID&gt;1\\.2\\.3\\..*

source: The available options are: <placeholder type="variablelist" id="0"/>
pt: As opções disponíveis são: <placeholder type="variablelist" id="0"/>

source: MAPPING RULE
pt: REGRA DE MAPEAMENTO

source: The mapping rule is used to associate a certificate with one or more accounts. A Smartcard with the certificate and the matching private key can then be used to authenticate as one of those accounts.
pt: A regra de mapeamento é usada para associar um certificado com uma ou mais contas. Uma Smartcard com o certificado e a chave privada correspondente podem então ser usadas para autenticar como uma dessas contas.

source: Currently SSSD basically only supports LDAP to lookup user information (the exception is the proxy provider which is not of relevance here). Because of this the mapping rule is based on LDAP search filter syntax with templates to add certificate content to the filter. It is expected that the filter will only contain the specific data needed for the mapping and that the caller will embed it in another filter to do the actual search. Because of this the filter string should start and stop with '(' and ')' respectively.
pt: Actualmente o SSSD basicamente apenas suporta o LDAP para procurar informação do utilizador (a excepção é o provedor proxy o qual não é relevante aqui). Devido a isto, a regra de mapeamento é baseada na sintaxe do filtro de busca do LDAP com modelos para adicionar o conteúdo de certificados ao filtro. É esperado que o filtro apenas contenha os dados específicos necessários para o mapeamento e que o chamador irá embebe-lo noutro filtro para fazer a própria procura. Devido a isto, a string do filtro deve começar e terminar com '(' e ')' respetivamente.

source: In general it is recommended to use attributes from the certificate and add them to special attributes to the LDAP user object. E.g. the 'altSecurityIdentities' attribute in AD or the 'ipaCertMapData' attribute for IPA can be used.
pt: Em geral é recomendado usar atributos a partir do certificado e adiciona-los a atributos especiais ao objecto utilizador do LDAP. Ex. pode ser usado o atributo 'altSecurityIdentities' em AD ou o atributo 'ipaCertMapData' para IPA.

source: This should be preferred to read user specific data from the certificate like e.g. an email address and search for it in the LDAP server. The reason is that the user specific data in LDAP might change for various reasons would break the mapping. On the other hand it would be hard to break the mapping on purpose for a specific user.
pt: Isto deve ser preferido a ler dados específicos do utilizador a partir do certificado tal como, ex. um endereço de email e procurar por ele no servidor LDAP. A razão é que os dados específicos do utilizador podem mudar por várias razões e iria quebrar o mapeamento. Do outro modo, seria difícil quebrar o mapeamento de propósito a um utilizador específico.

source: The default <quote>mapping rule</quote> type is 'LDAP' which can be added as a prefix to a rule like e.g. 'LDAP:(userCertificate;binary={cert!bin})'. There is an extension called 'LDAPU1' which offer more templates for more flexibility. To allow older versions of this library to ignore the extension the prefix 'LDAPU1' must be used when using the new templates in a <quote>mapping rule</quote> otherwise the old version of this library will fail with a parsing error. The new templates are described in section <xref linkend="map_ldapu1"/>.
pt: O tipo predefinido de <quote>mapping rule</quote> é 'LDAP' que pode ser adicionado como prefixo a uma regra como ex. 'LDAP:(userCertificate;binary={cert!bin})'. Existe uma extensão chamada 'LDAPU1' que oferece mais modelos para mais flexibilidade. Para permitir a versões mais antigas desta biblioteca ignorar a extensão, o prefixo 'LDAPU1' tem de ser usado quando se usa os novos modelos numa <quote>mapping rule</quote> caso contrário a versão antiga desta biblioteca irá falhar com um erro de análise. Os novos modelos estão descritos na secção <xref linkend="map_ldapu1"/>.

source: This template will add the full issuer DN converted to a string according to RFC 4514. If X.500 ordering (most specific RDN comes last) an option with the '_x500' prefix should be used.
pt: Este modelo irá adicionar o emissor total DN convertido numa string conforme RFC 4514. Se encomendar X.500 (RDN mais específico chega em último) deve ser usado uma opção com o prefixo '_x500'.

source: The conversion options starting with 'ad_' will use attribute names as used by AD, e.g. 'S' instead of 'ST'.
pt: As opções de conversão que começam com 'ad_' irão usar nomes de atributo como usado pelo AD, ex. 'S' em vez de 'ST'.

source: The conversion options starting with 'nss_' will use attribute names as used by NSS.
pt: As opções de conversão que começam com 'nss_' irão usar nomes de atributo como usado pelo NSS.

source: The default conversion option is 'nss', i.e. attribute names according to NSS and LDAP/RFC 4514 ordering.
pt: A opção de conversão predefinida é 'nss', isto é, nomes de atributos de acordo para pedidos NSS e LDAP/RFC 4514.

source: Example: (ipacertmapdata=X509:&lt;I&gt;{issuer_dn!ad}&lt;S&gt;{subject_dn!ad})
pt: Exemplo: (ipacertmapdata=X509:&lt;I&gt;{issuer_dn!ad}&lt;S&gt;{subject_dn!ad})

source: This template will add the full subject DN converted to string according to RFC 4514. If X.500 ordering (most specific RDN comes last) an option with the '_x500' prefix should be used.
pt: Este modelo irá adicionar o sujeito total DN convertido numa string conforme RFC 4514. Se encomendar X.500 (RDN mais específico chega em último) deve ser usado uma opção com o prefixo '_x500'.

source: Example: (ipacertmapdata=X509:&lt;I&gt;{issuer_dn!nss_x500}&lt;S&gt;{subject_dn!nss_x500})
pt: Exemplo: (ipacertmapdata=X509:&lt;I&gt;{issuer_dn!nss_x500}&lt;S&gt;{subject_dn!nss_x500})
