Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: Specifies whether the domain is meant to be used by POSIX-aware clients such as the Name Service Switch or by applications that do not need POSIX data to be present or generated. Only objects from POSIX domains are available to the operating system interfaces and utilities.
pt: Especifica se o domínio destina-se a ser usado por clientes conhecedores-de-POSIX como o Name Service Switch ou por aplicações que não precisam de dados POSIX para estarem presentes ou serem geradas. Apenas objetos de domínios POSIX estão disponíveis para as interfaces e utilitários do sistema operativo.

source: Allowed values for this option are <quote>posix</quote> and <quote>application</quote>.
pt: Os valores permitidos para esta opção são <quote>posix</quote> e <quote>application</quote>.

source: POSIX domains are reachable by all services. Application domains are only reachable from the InfoPipe responder (see <citerefentry> <refentrytitle>sssd-ifp</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>) and the PAM responder.
pt: Os domínios POSIX são alcançáveis por todos os serviços. Os domínios application são apenas alcançáveis a partir do respondedor InfoPipe (veja <citerefentry> <refentrytitle>sssd-ifp</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>) e o respondedor PAM.

source: NOTE: The application domains are currently well tested with <quote>id_provider=ldap</quote> only.
pt: NOTA: Os domínios application estão atualmente bem testados apenas com <quote>id_provider=ldap</quote>.

source: For an easy way to configure a non-POSIX domains, please see the <quote>Application domains</quote> section.
pt: Para uma maneira fácil de configurar domínios não-POSIX, por favor consulte a secção <quote>Domínios Application</quote>.

source: Default: posix
pt: Predefinição: posix

source: min_id,max_id (integer)
pt: min_id,max_id (inteiro)

source: UID and GID limits for the domain. If a domain contains an entry that is outside these limits, it is ignored.
pt: Limites de UID e GID para o domínio. Se um domínio conter uma entrada que está fora destes limites, ela é ignorada.

source: For users, this affects the primary GID limit. The user will not be returned to NSS if either the UID or the primary GID is outside the range. For non-primary group memberships, those that are in range will be reported as expected.
pt: Para utilizadores, isto afecta o limite de GID principal. O utilizador não será retornado ao NSS se ou o UID ou o GID principal estiverem fora do alcance. Para membros de grupo não-principal, aqueles que estiverem dentro do alcance serão reportados como esperado.

source: These ID limits affect even saving entries to cache, not only returning them by name or ID.
pt: Estes limites de ID afectam até o salvar de entradas na cache, não apenas retornando eles por nome ou ID.

source: Default: 1 for min_id, 0 (no limit) for max_id
pt: Predefinição: 1 para min_id, 0 (sem limite) para max_id

source: enumerate (bool)
pt: enumerate (booleano)

source: Determines if a domain can be enumerated, that is, whether the domain can list all the users and group it contains. Note that it is not required to enable enumeration in order for secondary groups to be displayed. This parameter can have one of the following values:
pt: Determina se um domínio pode ser enumerado, isto é, se o domínio consegue listar todos os utilizadores e grupos que contém. Note que não é necessário activar a enumeração para que grupos secundários sejam mostrados. Este parâmetro pode ter um dos seguintes valores:

source: TRUE = Users and groups are enumerated
pt: TRUE = Utilizadores e grupos são enumerados

source: FALSE = No enumerations for this domain
pt: FALSE = Nenhuma enumeração para este domínio

source: Default: FALSE
pt: Predefinição: FALSE

source: Enumerating a domain requires SSSD to download and store ALL user and group entries from the remote server.
pt: Enumerar um domínio requer ao SSSD descarregar e armazenar TODAS as entradas de utilizadores e grupos a partir do servidor remoto.

source: Feature is only supported for domains with id_provider = ldap or id_provider = proxy.
pt: Funcionalidade é apenas suportada para domínios com id_provider = ldap ou id_provider = proxy.

source: Note: Enabling enumeration has a severe performance impact on SSSD while enumeration is running. It may take up to several minutes after SSSD startup to fully complete enumerations. During this time, individual requests for information will go directly to LDAP, though it may be slow, due to the heavy enumeration processing. Saving a large number of entries to cache after the enumeration completes might also be CPU intensive as the memberships have to be recomputed. This can lead to the <quote>sssd_be</quote> process becoming unresponsive or even restarted by the internal watchdog.
pt: Nota: Activar a enumeração tem um impacto de performance moderado no SSSD enquanto a enumeração está a correr. Pode demorar até vários minutos após o SSSD arrancar para completar totalmente as enumerações. Durante este tempo, os pedidos individuais por informação vão diretamente para o LDAP, embora possa ser lento, devido ao pesado processamento da enumeração. Salvar grandes números de entradas na cache após a enumeração completar também pode ser intensivo para a CPU pois as relações de membros têm de ser re-computadas. Isto pode levar a que o processo <quote>sssd_be</quote> deixe de responder ou até ser reiniciado por um watchdog interno.

source: While the first enumeration is running, requests for the complete user or group lists may return no results until it completes.
pt: Enquanto a primeira enumeração está a correr, os pedidos por listas de utilizadores ou grupos completas podem retornar sem resultados até que esta complete.

source: Further, enabling enumeration may increase the time necessary to detect network disconnection, as longer timeouts are required to ensure that enumeration lookups are completed successfully. For more information, refer to the man pages for the specific id_provider in use.
pt: Mais ainda, activar a enumeração pode aumentar o tempo necessário para detectar o desligar da rede, desde que sejam requeridos tempos limite para assegurar que as buscas da enumeração sejam completadas com sucesso. Para mais informação, consulte o manual específico do provedor de id em uso.

source: For the reasons cited above, enabling enumeration is not recommended, especially in large environments.
pt: Pelas razões citadas em cima, activar a enumeração não é recomendado, especialmente em grandes ambientes.

source: Note: the proxy provider is tested with open source modules like 'libnss_files' and 'libnss_ldap'. 3rd party modules must follow the documented behavior of nss modules to be used in this configuration.
pt: Nota: o provedor proxy é testado com módulos de fonte aberta como 'libnss_files' e 'libnss_ldap'. Os módulos de terceiros têm de seguir o comportamento documentado dos módulos nss para serem usados nesta configuração.

source: entry_cache_timeout (integer)
pt: entry_cache_timeout (inteiro)

source: How many seconds should nss_sss consider entries valid before asking the backend again
pt: Durante quantos segundos deve o nss_sss considerar as entradas válidas antes de questionar o backend outra vez

source: The cache expiration timestamps are stored as attributes of individual objects in the cache. Therefore, changing the cache timeout only has effect for newly added or expired entries. You should run the <citerefentry> <refentrytitle>sss_cache</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> tool in order to force refresh of entries that have already been cached.
pt: As marcas temporais de expiração da cache são guardadas como atributos de objectos individuais na cache. Assim, alterar o tempo limite da cache apenas tem efeito em entradas recentemente adicionadas ou expiradas. Você deve correr a ferramenta <citerefentry> <refentrytitle>sss_cache</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> de modo a forçar o refrescamento das entradas que já estão em cache.

source: Default: 5400
pt: Predefinição: 5400

source: entry_cache_user_timeout (integer)
pt: entry_cache_user_timeout (inteiro)

source: How many seconds should nss_sss consider user entries valid before asking the backend again
pt: Durante quantos segundos deve o nss_sss considerar as entradas de utilizador válidas antes de questionar o backend outra vez

source: Default: entry_cache_timeout
pt: Predefinição: entry_cache_timeout

source: entry_cache_group_timeout (integer)
pt: entry_cache_group_timeout (inteiro)

source: How many seconds should nss_sss consider group entries valid before asking the backend again
pt: Durante quantos segundos deve o nss_sss considerar as entradas de grupo válidas antes de questionar o backend outra vez

source: entry_cache_netgroup_timeout (integer)
pt: entry_cache_netgroup_timeout (inteiro)

source: How many seconds should nss_sss consider netgroup entries valid before asking the backend again
pt: Durante quantos segundos deve o nss_sss considerar as entradas de netgroup válidas antes de questionar o backend outra vez

source: entry_cache_service_timeout (integer)
pt: entry_cache_service_timeout (inteiro)

source: How many seconds should nss_sss consider service entries valid before asking the backend again
pt: Durante quantos segundos deve o nss_sss considerar as entradas de serviço válidas antes de questionar o backend outra vez

source: entry_cache_resolver_timeout (integer)
pt: entry_cache_resolver_timeout (inteiro)

source: How many seconds should nss_sss consider hosts and networks entries valid before asking the backend again
pt: Durante quantos segundos deve o nss_sss considerar as entradas de máquinas e redes válidas antes de questionar o backend outra vez

source: entry_cache_sudo_timeout (integer)
pt: entry_cache_sudo_timeout (inteiro)

source: How many seconds should sudo consider rules valid before asking the backend again
pt: Durante quantos segundos deve o sudo considerar as regras válidas antes de questionar o backend outra vez

source: entry_cache_autofs_timeout (integer)
pt: entry_cache_autofs_timeout (inteiro)

source: How many seconds should the autofs service consider automounter maps valid before asking the backend again
pt: Durante quantos segundos deve o serviço autofs considerar os mapas automounter válidos antes de questionar o backend outra vez

source: entry_cache_ssh_host_timeout (integer)
pt: entry_cache_ssh_host_timeout (inteiro)

source: How many seconds to keep a host ssh key after refresh. IE how long to cache the host key for.
pt: Durante quantos segundos manter uma chave ssh de máquina após refrescar. Isto é, durante quanto tempo manter a chave da máquina em cache.

source: entry_cache_computer_timeout (integer)
pt: entry_cache_computer_timeout (inteiro)

source: How many seconds to keep the local computer entry before asking the backend again
pt: Durante quantos segundos manter a entrada de computador local antes de questionar o backend outra vez

source: refresh_expired_interval (integer)
pt: refresh_expired_interval (inteiro)

source: Specifies how many seconds SSSD has to wait before triggering a background refresh task which will refresh all expired or nearly expired records.
pt: Especifica quantos segundos o SSSD tem de esperar antes de despoletar uma tarefa de refrescamento em segundo plano a qual irá refrescar todos os registos expirados ou quase expirados.

source: The background refresh will process users, groups and netgroups in the cache. For users who have performed the initgroups (get group membership for user, typically ran at login) operation in the past, both the user entry and the group membership are updated.
pt: O refrescamento em segundo plano irá processar utilizadores, grupos e netgroups na cache. Para utilizadores que tenham executado a operação initgroups (obter membros de grupo para utilizador, tipicamente corrido no login) no passado, ambas as entradas de utilizador e membros do grupo são actualizadas.

source: This option is automatically inherited for all trusted domains.
pt: Esta opção é herdada automaticamente para todos os domínios de confiança.

source: You can consider setting this value to 3/4 * entry_cache_timeout.
pt: Você pode considerar definir este valor para 3/4 * entry_cache_timeout.

source: Cache entry will be refreshed by background task when 2/3 of cache timeout has already passed. If there are existing cached entries, the background task will refer to their original cache timeout values instead of current configuration value. This may lead to a situation in which background refresh task appears to not be working. This is done by design to improve offline mode operation and reuse of existing valid cache entries. To make this change instant the user may want to manually invalidate existing cache.
pt: A entrada em cache será refrescada por tarefa em segundo plano quando 2/3 do tempo limite de cache tiver sido atingido. Se existirem entradas em cache, a tarefa de segundo plano irá regular-se pelos seus valores originais de tempo limite de cache em vez do valor de configuração actual. Isto pode levar a uma situação na qual a tarefa de refrescamento em segundo plano pareça não estar a funcionar. Isto é feito propositadamente para melhorar a operação em modo offline e a reutilização das entradas em cache válidas existentes. Para tornar esta alteração instantânea o utilizador pode querer invalidar manualmente a cache existente.

source: Default: 0 (disabled)
pt: Predefinição: 0 (desactivado)

source: cache_credentials (bool)
pt: cache_credentials (booleano)

source: Determines if user credentials are also cached in the local LDB cache. The cached credentials refer to passwords, which includes the first (long term) factor of two-factor authentication, not other authentication mechanisms. Passkey and Smartcard authentications are expected to work offline as long as a successful online authentication is recorded in the cache without additional configuration.
pt: Determina se as credenciais do utilizador são também postas em cache na cache LDB local. As credenciais e cache referem-se a palavras passe, o que inclui o primeiro factor (termo longo) de autenticação de dois-factores, não outros mecanismos de autenticação. Espera-se que as autenticações Passkey e Smartcard funcionem offline desde que uma autenticação online com sucesso esteja guardada na cache sem configuração adicional.

source: Take a note that while credentials are stored as a salted SHA512 hash, this still potentially poses some security risk in case an attacker manages to get access to a cache file (normally requires privileged access) and to break a password using brute force attack.
pt: Tome nota que apesar das credenciais serem guardadas como uma cinza SHA512 salgada, isto ainda tem potencialmente algum risco de segurança no caso dum atacante conseguir ter acesso a um ficheiro de cache (normalmente requer acesso privilegiado) e para quebrar uma palavra passe usando ataque de força bruta.

source: cache_credentials_minimal_first_factor_length (int)
pt: cache_credentials_minimal_first_factor_length (inteiro)

source: If 2-Factor-Authentication (2FA) is used and credentials should be saved this value determines the minimal length the first authentication factor (long term password) must have to be saved as SHA512 hash into the cache.
pt: Se for usado 2-Factor-Authentication (2FA) e as credenciais devem ser guardadas este valor determina o comprimento mínimo do primeiro factor de autenticação (palavra passe de longo termo) tem de ser guardado como cinza SHA512 na cache.

source: This should avoid that the short PINs of a PIN based 2FA scheme are saved in the cache which would make them easy targets for brute-force attacks.
pt: Isto deve evitar que PINs curtos de um PIN baseado em esquema 2FA sejam guardados na cache o que os tornaria alvos fáceis para ataques de força bruta.

source: account_cache_expiration (integer)
pt: account_cache_expiration (inteiro)

source: Number of days entries are left in cache after last successful login before being removed during a cleanup of the cache. 0 means keep forever. The value of this parameter must be greater than or equal to offline_credentials_expiration.
pt: O número de dias que as entradas são deixadas na cache após o último login com sucesso e antes de serem removidos durante uma limpeza da cache. 0 significa manter para sempre. O valor deste parâmetro tem de ser maior ou igual a offline_credentials_expiration.

source: Default: 0 (unlimited)
pt: Predefinição: 0 (ilimitado)

source: pwd_expiration_warning (integer)
pt: pwd_expiration_warning (inteiro)

source: Please note that the backend server has to provide information about the expiration time of the password. If this information is missing, sssd cannot display a warning. Also an auth provider has to be configured for the backend.
pt: Por favor note que o servidor backend tem de fornecer informação acerca do tempo de expiração da palavra passe. Se esta informação estiver em falta, o sssd não pode mostrar um aviso.. E também tem de ser configurado um provedor de autenticação para o backend.

source: Default: 7 (Kerberos), 0 (LDAP)
pt: Predefinição: 7 (Kerberos), 0 (LDAP)

source: The identification provider used for the domain. Supported ID providers are:
pt: O provedor de identificação usado para o domínio. Os provedores de ID suportados são:

source: <quote>proxy</quote>: Support a legacy NSS provider.
pt: <quote>proxy</quote>: Suporta um provedor NSS legado.

source: <quote>ldap</quote>: LDAP provider. See <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring LDAP.
pt: <quote>ldap</quote>: Provedor LDAP. Veja <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração do LDAP.

source: <quote>ipa</quote>: FreeIPA and Red Hat Identity Management provider. See <citerefentry> <refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring FreeIPA.
pt: <quote>ipa</quote>: Provedor FreeIPA e Red Hat Enterprise Identity Management. Veja <citerefentry> <refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração do FreeIPA.

source: <quote>ad</quote>: Active Directory provider. See <citerefentry> <refentrytitle>sssd-ad</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring Active Directory.
pt: <quote>ad</quote>: Provedor Active Directory. Veja <citerefentry> <refentrytitle>sssd-ad</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configurar Active Directory.

source: <quote>idp</quote>: Provider for OAuth 2.0/OIDC based Identity Providers (IdP). See <citerefentry> <refentrytitle>sssd-idp</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information.
pt: <quote>idp</quote>: Provedor para OAuth 2.0/Provedores de Identidade (IdP) baseado em OIDC. Veja <citerefentry> <refentrytitle>sssd-idp</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação.

source: use_fully_qualified_names (bool)
pt: use_fully_qualified_names (booleano)

source: Use the full name and domain (as formatted by the domain's full_name_format) as the user's login name reported to NSS.
pt: Usa o nome completo e domínio (formatado pelo full_name_format do domínio) como o nome de login do utilizador reportado ao NSS.

source: If set to TRUE, all requests to this domain must use fully qualified names. For example, if used in EXAMPLE domain that contains a "test" user, <command>getent passwd test</command> wouldn't find the user while <command>getent passwd test@EXAMPLE</command> would.
pt: Se definido para TRUE, todos os pedidos a este domínio têm de usar nomes totalmente qualificados. Por exemplo, se usado em domínio EXEMPLO que contém um utilizador "test", <command>getent passwd test</command> não iria encontrar o utilizador ao passo que <command>getent passwd test@EXEMPLO</command> já iria.

source: NOTE: This option has no effect on netgroup lookups due to their tendency to include nested netgroups without qualified names. For netgroups, all domains will be searched when an unqualified name is requested.
pt: NOTA: Esta opção não tem efeito em pesquisas netgroup devido à sua tendência a incluir netgroups aninhados sem nomes qualificados. Para netgroups, todos os domínios serão pesquisados quando um nome não qualificado é requisitado.

source: Default: FALSE (TRUE for trusted domain/sub-domains or if default_domain_suffix is used)
pt: Predefinição: FALSE (TRUE para domínios/sub-domínios ou se default_domain_suffix for usado)

source: ignore_group_members (bool)
pt: ignore_group_members (booleano)

source: Do not return group members for group lookups.
pt: Não retorna membros de grupo para pesquisas de grupo.

source: If set to TRUE, the group membership attribute is not requested from the ldap server, and group members are not returned when processing group lookup calls, such as <citerefentry> <refentrytitle>getgrnam</refentrytitle> <manvolnum>3</manvolnum> </citerefentry> or <citerefentry> <refentrytitle>getgrgid</refentrytitle> <manvolnum>3</manvolnum> </citerefentry>. As an effect, <quote>getent group $groupname</quote> would return the requested group as if it was empty.
pt: Se definido para TRUE, o atributo de membros do grupo não é requisitado a partir do servidor ldap, e os membros de grupo não são retornados quando se processam chamadas de pesquisa de grupo, tais como <citerefentry> <refentrytitle>getgrnam</refentrytitle> <manvolnum>3</manvolnum> </citerefentry> ou <citerefentry> <refentrytitle>getgrgid</refentrytitle> <manvolnum>3</manvolnum> </citerefentry>. Como um efeito, <quote>getent group $groupname</quote> iria retornar o grupo requisitado como se estivesse vazio.

source: Enabling this option can also make access provider checks for group membership significantly faster, especially for groups containing many members.
pt: Activar esta opção pode também tornar as verificações de provedor de acesso para membros de grupo significativamente mais rápidas, especialmente para grupos que contenham muitos membros.

source: This option can be also set per subdomain or inherited via <emphasis>subdomain_inherit</emphasis>.
pt: Esta opção pode ser definida por-domínio ou herdada via <emphasis>subdomain_inherit</emphasis>.

source: The authentication provider used for the domain. Supported auth providers are:
pt: O provedor de autenticação usado para o domínio. Os provedores de autenticação suportados são:

source: <quote>ldap</quote> for native LDAP authentication. See <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring LDAP.
pt: <quote>ldap</quote> para autenticação LDAP nativa. Veja <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração do LDAP.

source: <quote>krb5</quote> for Kerberos authentication. See <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring Kerberos.
pt: <quote>krb5</quote> para autenticação Kerberos. Veja <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração do Kerberos.
