Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: Specifies a list of configuration parameters that should be inherited by a subdomain. Please note that only selected parameters can be inherited. Currently the following options can be inherited:
pt: Especifica uma lista de parâmetros de configuração que devem ser herdados por um subdomínio. Por favor note que apenas os parâmetros selecionados podem ser herdados. Actualmente as seguintes opções podem ser herdadas:

source: ldap_krb5_keytab (the value of krb5_keytab will be used if ldap_krb5_keytab is not set explicitly)
pt: ldap_krb5_keytab (o valor de krb5_keytab será usado se ldap_krb5_keytab não estiver definido explicitamente)

source: Note: This option only works with the IPA and AD provider.
pt: Nota: Esta opção apenas funciona com provedores IPA e AD.

source: flat (NetBIOS) name of a subdomain.
pt: nome simples (NetBIOS) de um subdomínio.

source: Use this homedir as default value for all subdomains within this domain in IPA AD trust. See <emphasis>override_homedir</emphasis> for info about possible values. In addition to those, the expansion below can only be used with <emphasis>subdomain_homedir</emphasis>. <placeholder type="variablelist" id="0"/>
pt: Usa esta homedir como valor predefinido para todos os subdomínios dentro deste domínio em confiança IPA AD. Veja <emphasis>override_homedir</emphasis> para informação sobre possíveis valores. Adicionalmente a esses, a expansão em baixo só pode ser usada com <emphasis>subdomain_homedir</emphasis>. <placeholder type="variablelist" id="0"/>

source: The value can be overridden by <emphasis>override_homedir</emphasis> option.
pt: O valor pode ser sobreposto pela opção <emphasis>override_homedir</emphasis>.

source: Default: <filename>/home/%d/%u</filename>
pt: Predefinição: <filename>/home/%d/%u</filename>

source: Various tags stored by the realmd configuration service for this domain.
pt: Várias etiquetas armazenadas pelo serviço de configuração realmd para este domínio.

source: cached_auth_timeout (int)
pt: cached_auth_timeout (inteiro)

source: Specifies time in seconds since last successful online authentication for which user will be authenticated using cached credentials while SSSD is in the online mode. If the credentials are incorrect, SSSD falls back to online authentication.
pt: Especifica o tempo em segundos desde a última autenticação online com sucesso para qual o utilizador será autenticado usando credenciais em cache enquanto o SSSD está em modo online. Se as credenciais estiverem incorretas, o SSSD regressa à autenticação online.

source: This option's value is inherited by all trusted domains. At the moment it is not possible to set a different value per trusted domain.
pt: O valor desta opção é herdado por todos os domínios de confiança. Até ao momento não é possível definir um valor diferente por domínio de confiança.

source: Special value 0 implies that this feature is disabled.
pt: O valor especial 0 implica que esta funcionalidade é desactivada.

source: Please note that if <quote>cached_auth_timeout</quote> is longer than <quote>pam_id_timeout</quote> then the back end could be called to handle <quote>initgroups.</quote>
pt: Por favor note que se <quote>cached_auth_timeout</quote> for maior que <quote>pam_id_timeout</quote> então o backend poderá ser chamado para lidar com <quote>initgroups.</quote>

source: Local authentication methods policy. Some backends (i.e. LDAP, proxy provider) only support a password based authentication, while others can handle PKINIT based Smartcard authentication (AD, IPA), two-factor authentication (IPA), or other methods against a central instance. By default in such cases authentication is only performed with the methods supported by the backend. With this option additional methods can be enabled which are evaluated and checked locally.
pt: Política de métodos de autenticação local. Alguns backends (isto é, LDAP, provedor proxy) apenas suportam uma autenticação baseada em palavra passe, enquanto outros conseguem lidar com autenticação de Smartcard baseada em PKINIT (AD, IPA), autenticação de dois-factores (IPA), ou outros métodos contra uma instância central. Por predefinição em tais casos a autenticação é apenas executada com os métodos suportados pelo backend. Com esta opção podem ser ativados métodos adicionais que são avaliados e verificados localmente.

source: There are three possible values for this option: match, only, enable. <quote>match</quote> is used to match offline and online states for Kerberos methods. <quote>only</quote> ignores the online methods and only offer the local ones. enable allows explicitly defining the methods for local authentication. As an example, <quote>enable:passkey</quote>, only enables passkey for local authentication. Multiple enable values should be comma-separated, such as <quote>enable:passkey, enable:smartcard</quote>
pt: Existem três valores possíveis para esta opção: match, only, enable. <quote>match</quote> é usada para corresponder estados offline e online para métodos do Kerberos. <quote>only</quote> ignora os métodos online e apenas oferece os locais. enable permite definir explicitamente os métodos para autenticação local. Como exemplo, <quote>enable:passkey</quote>, apenas ativa passkey para autenticação local. Múltiplos valores de ativação devem ser separados por vírgulas, tal como <quote>enable:passkey, enable:smartcard</quote>

source: The following table shows which authentication methods, if configured properly, are currently enabled or disabled for each backend, with the default local_auth_policy: <quote>match</quote>
pt: A seguinte tabela mostra quais métodos de autenticação, se configurados de modo apropriado, estão atualmente ativos ou inativos para cada backend, com a local_auth_policy predefinida: <quote>match</quote>

source: local_auth_policy = match (default)
pt: local_auth_policy = match (predefinição)

source: disabled
pt: desactivado

source: Please note that if local Smartcard authentication is enabled and a Smartcard is present, Smartcard authentication will be preferred over the authentication methods supported by the backend. I.e. there will be a PIN prompt instead of e.g. a password prompt.
pt: Por favor note que se a autenticação Smartcard local estiver ativa e uma Smartcard presente, a autenticação Smartcard será preferida sobre os métodos de autenticação suportados pelo backend. Isto é, vai haver um pedido de PIN em vez de, por exemplo, um pedido de palavra passe.

source: The following configuration example allows local users to authenticate locally using any enabled method (i.e. smartcard, passkey). <placeholder type="programlisting" id="0"/>
pt: O seguinte exemplo de configuração permite aos utilizadores locais autenticarem-se localmente usando qualquer método ativo (isto é, smartcard, passkey). <placeholder type="programlisting" id="0"/>

source: Default: match
pt: Predefinição: match

source: Create user's private group unconditionally from user's UID number. The GID number is ignored in this case.
pt: Cria o grupo privado do utilizador incondicionalmente a partir do número UID do utilizador. O número GID é ignorado neste caso.

source: NOTE: Because the GID number and the user private group are inferred from the UID number, it is not supported to have multiple entries with the same UID or GID number with this option. In other words, enabling this option enforces uniqueness across the ID space.
pt: NOTA: Porque o número GID, e o grupo privado do utilizador são herdados a partir do número UID, não é suportado ter múltiplas entradas com o mesmo número UID ou GID nesta opção. Por outras palavras, activar esta opção reforça a singularidade entre o espaço de ID.

source: Always use the user's primary GID number. The GID number must refer to a group object in the LDAP database.
pt: Usa sempre o número GID principal do utilizador. O número GID tem de se referir a um objecto grupo na base de dados do LDAP.

source: A primary group is autogenerated for user entries whose UID and GID numbers have the same value and at the same time the GID number does not correspond to a real group object in LDAP. If the values are the same, but the primary GID in the user entry is also used by a group object, the primary GID of the user resolves to that group object.
pt: Um grupo primário é auto-gerado para entradas de utilizador cujos números UID e GID têm o mesmo valor e ao mesmo tempo o número GID não corresponde a um objecto grupo real no LDAP. Se os valores forem iguais, mas o GID primário na entrada no utilizador for também usado por um objecto grupo, o GID primário do utilizador resolve para esse objecto grupo.

source: If the UID and GID of a user are different, then the GID must correspond to a group entry, otherwise the GID is simply not resolvable.
pt: Se o UID e GID de um utilizador forem diferentes, então o GID tem de corresponder à entrada do grupo, caso contrário o GID é simplesmente não resolvível.

source: This feature is useful for environments that wish to stop maintaining a separate group objects for the user private groups, but also wish to retain the existing user private groups.
pt: Esta funcionalidade é útil para ambientes onde se deseja parar de manter objetos grupo separados para os grupos privados do utilizador, mas também se deseja reter os grupos privados existentes de utilizador.

source: This option takes any of three available values: <placeholder type="variablelist" id="0"/>
pt: Esta opção recebe qualquer um dos três valores disponíveis: <placeholder type="variablelist" id="0"/>

source: For the LDAP based id providers (LDAP, IPA and AD) the default for the configured domain is typically False because the sources have the concept of a primary group. <phrase condition="with_idp_provider">The IdP id provider is using True because IdPs typically do not have primary groups.</phrase>
pt: Para provedores de id baseados em LDAP (LDAP, IPA e AD) a predefinição para o domínio configurado é tipicamente False porque as fontes têm o conceito de um grupo primário. <phrase condition="with_idp_provider">O provedor de id IdP está a usar True porque IdPs tipicamente não têm grupos primários.</phrase>

source: For subdomains, the default value is False for subdomains that use assigned POSIX IDs and True for subdomains that use automatic ID-mapping.
pt: Para subdomínios, o valor predefinido é False para subdomínios que usem IDs POSIX assinados e True para subdomínios que usam mapeamento de ID automático.

source: The value of auto_private_groups can either be set per subdomains in a subsection, for example: <placeholder type="programlisting" id="0"/> or globally for all subdomains in the main domain section using the subdomain_inherit option: <placeholder type="programlisting" id="1"/>
pt: O valor de auto_private_groups pode ser ou definido por-subdomínio numa sub-secção, por exemplo: <placeholder type="programlisting" id="0"/> ou globalmente para todos os subdomínios na secção de domínio principal usando a opção subdomain_inherit: <placeholder type="programlisting" id="1"/>

source: These configuration options can be present in a domain configuration section, that is, in a section called <quote>[domain/<replaceable>NAME</replaceable>]</quote> <placeholder type="variablelist" id="0"/>
pt: Estas opções de configuração podem estar presentes numa secção de configuração de domínio, isto é, numa secção chamada <quote>[domain/<replaceable>NOME</replaceable>]</quote> <placeholder type="variablelist" id="0"/>

source: The proxy target PAM proxies to.
pt: O alvo proxy que o PAM "proxia".

source: Default: not set by default, you have to take an existing pam configuration or create a new one and add the service name here. As an alternative you can enable local authentication with the local_auth_policy option.
pt: Predefinição: não definida por predefinição, você tem de tomar uma configuração pam existente ou criar uma nova e adicionar o nome do serviço aqui. Como alternativa você pode activar autenticação local com a opção local_auth_policy.

source: The name of the NSS library to use in proxy domains. The NSS functions searched for in the library are in the form of _nss_$(libName)_$(function), for example _nss_files_getpwent.
pt: O nome da biblioteca NSS a usar em domínios proxy. As funções NSS procuradas na biblioteca estão no formato _nss_$(libName)_$(function), por exemplo _nss_files_getpwent.

source: The name of the NSS library to use for hosts and networks lookups in proxy domains. The NSS functions searched for in the library are in the form of _nss_$(libName)_$(function), for example _nss_dns_gethostbyname2_r.
pt: O nome da biblioteca NSS a usar para buscas de máquinas e redes em domínios proxy. As funções NSS procuradas na biblioteca estão no formato _nss_$(libName)_$(function), por exemplo _nss_dns_gethostbyname2_r.

source: proxy_fast_alias (boolean)
pt: proxy_fast_alias (booleano)

source: When a user or group is looked up by name in the proxy provider, a second lookup by ID is performed to "canonicalize" the name in case the requested name was an alias. Setting this option to true would cause the SSSD to perform the ID lookup from cache for performance reasons.
pt: Quando um utilizador ou grupo é procurado pelo nome no provedor proxy, é executada uma segunda procura pelo ID para "canonizar" o nome no caso de o nome pedido ser um alias. Definir esta opção para true irá fazer com que o SSSD execute a procura de ID a partir da cache por razões de performance.

source: proxy_max_children (integer)
pt: proxy_max_children (inteiro)

source: This option specifies the number of pre-forked proxy children. It is useful for high-load SSSD environments where sssd may run out of available child slots, which would cause some issues due to the requests being queued.
pt: Esta opção especifica o número de filhos proxy pré-forcados. É útil para ambientes SSSD de alta carga onde o sssd pode esgotar as slots para filhos disponíveis, o que iria causar alguns problemas devido a pedidos serem postos em fila de espera.

source: Options valid for proxy domains. <placeholder type="variablelist" id="0"/>
pt: Opções válidas para domínios proxy. <placeholder type="variablelist" id="0"/>

source: Application domains
pt: Domínios Application

source: SSSD, with its D-Bus interface (see <citerefentry> <refentrytitle>sssd-ifp</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>) is appealing to applications as a gateway to an LDAP directory where users and groups are stored. However, contrary to the traditional SSSD deployment where all users and groups either have POSIX attributes or those attributes can be inferred from the Windows SIDs, in many cases the users and groups in the application support scenario have no POSIX attributes. Instead of setting a <quote>[domain/<replaceable>NAME</replaceable>]</quote> section, the administrator can set up an <quote>[application/<replaceable>NAME</replaceable>]</quote> section that internally represents a domain with type <quote>application</quote> optionally inherits settings from a tradition SSSD domain.
pt: O SSSD, com a sua interface D-Bus (veja <citerefentry> <refentrytitle>sssd-ifp</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>) está a apelar a aplicações como uma porta para um directório LDAP onde os utilizadores e grupos são armazenados. No entanto, ao contrário do desenvolvimento tradicional do SSSD onde todos os utilizadores e grupos ou têm atributos POSIX ou esses atributos podem ser inferidos a partir de SIDs de Windows, em muitos casos os utilizadores e grupos no cenário de suporte de aplicação não têm atributos POSIX. Em vez de definir uma secção <quote>[domain/<replaceable>NOME</replaceable>]</quote>. o administrador pode definir uma secção <quote>[application/<replaceable>NOME</replaceable>]</quote> que representa internamente um domínio com definições de heranças opcionais tipo <quote>application</quote> a partir de um domínio tradicional SSSD.

source: Please note that the application domain must still be explicitly enabled in the <quote>domains</quote> parameter so that the lookup order between the application domain and its POSIX sibling domain is set correctly.
pt: Por favor note que o domínio application ainda tem de ser explicitamente activado no parâmetro <quote>domains</quote> para que a ordem de procura entre o domínio application e o seu domínio irmão POSIX seja definida corretamente.

source: Application domain parameters
pt: Parâmetros de domínio Application

source: The SSSD POSIX-type domain the application domain inherits all settings from. The application domain can moreover add its own settings to the application settings that augment or override the <quote>sibling</quote> domain settings.
pt: O domínio tipo-POSIX do SSSD de onde o domínio application herda todas as definições. O domínio application pode ainda adicionar as suas definições às definições application que ampliam ou sobrepõem as definições de domínio <quote>sibling</quote>.

source: The following example illustrates the use of an application domain. In this setup, the POSIX domain is connected to an LDAP server and is used by the OS through the NSS responder. In addition, the application domain also requests the telephoneNumber attribute, stores it as the phone attribute in the cache and makes the phone attribute reachable through the D-Bus interface.
pt: O seguinte exemplo ilustra o uso de um domínio application, Nesta configuração, o domínio POSIX é ligado a um servidor LDAP e é usado pelo SO através do respondedor NSS. Adicionalmente, o domínio application também requisita o atributo telephoneNumber, guarda-o como o atributo de telefone na cache e torna o atributo telefone acessível através da interface D-Bus.

source: TRUSTED DOMAIN SECTION
pt: SECÇÃO DE DOMÍNIO DE CONFIANÇA

source: Some options used in the domain section can also be used in the trusted domain section, that is, in a section called <quote>[domain/<replaceable>DOMAIN_NAME</replaceable>/<replaceable>TRUSTED_DOMAIN_NAME</replaceable>]</quote>. Where DOMAIN_NAME is the actual joined-to base domain. Please refer to examples below for explanation. Currently supported options in the trusted domain section are:
pt: Algumas opções usadas na secção domínio podem também ser usadas na secção dos domínios de confiança, isto é, na secção chamada <quote>[domain/<replaceable>DOMAIN_NAME</replaceable>/<replaceable>TRUSTED_DOMAIN_NAME</replaceable>]</quote>. Onde DOMAIN_NAME é o real domínio base unido. Por favor consulte os exemplos em baixo para explicação. As opções actualmente suportadas na secção de domínio de confiança são:

source: For more details about these options see their individual description in the manual page.
pt: Para mais detalhes acerca destas opções veja as suas descrições individuais no manual.

source: CERTIFICATE MAPPING SECTION
pt: SECÇÃO DE MAPEAMENTO DE CERTIFICADO

source: To allow authentication with Smartcards and certificates SSSD must be able to map certificates to users. This can be done by adding the full certificate to the LDAP object of the user or to a local override. While using the full certificate is required to use the Smartcard authentication feature of SSH (see <citerefentry> <refentrytitle>sss_ssh_authorizedkeys</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> for details) it might be cumbersome or not even possible to do this for the general case where local services use PAM for authentication.
pt: Para permitir a autenticação com Smartcards e certificados o SSSD deve ser capaz de mapear certificados para utilizadores. Isto pode ser feito ao adicionar o certificado completo ao objecto LDAP do utilizador ou a uma sobreposição global. Apesar de se usar o certificado completo seja requerido para se usar a funcionalidade de autenticação Smartcard do SSH (veja <citerefentry> <refentrytitle>sss_ssh_authorizedkeys</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> para detalhes) pode ser incomodo ou mesmo não possível fazer isto para os casos gerais onde os serviços locais usam PAM para autenticação..

source: To make the mapping more flexible mapping and matching rules were added to SSSD (see <citerefentry> <refentrytitle>sss-certmap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for details).
pt: Para tornar o mapeamento mais flexível as regras de mapeamento e correspondência foram adicionadas ao SSSD (veja <citerefentry> <refentrytitle>sss-certmap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para detalhes).

source: A mapping and matching rule can be added to the SSSD configuration in a section on its own with a name like <quote>[certmap/<replaceable>DOMAIN_NAME</replaceable>/<replaceable>RULE_NAME</replaceable>]</quote>. In this section the following options are allowed:
pt: Uma regra de mapeamento e correspondência pode se adicionada à configuração do SSSD numa secção própria com um nome como <quote>[certmap/<replaceable>NOME_DOMÍNIO</replaceable>/<replaceable>NOME_REGRA</replaceable>]</quote>. Nesta secção são permitidas as seguintes opções:

source: Only certificates from the Smartcard which matches this rule will be processed, all others are ignored.
pt: Apenas os certificados da Smartcard que corresponde a esta regra serão processados, todos os outros serão ignorados.

source: Default: KRB5:&lt;EKU&gt;clientAuth, i.e. only certificates which have the Extended Key Usage <quote>clientAuth</quote>
pt: Predefinição: KRB5:&lt;EKU&gt;clientAuth, isto é, apenas certificados que têm a Utilização de Chave Estendida <quote>clientAuth</quote>

source: Defines how the user is found for a given certificate.
pt: Define como um utilizador é encontrado para um dado certificado.

source: LDAP:(userCertificate;binary={cert!bin}) for LDAP based providers like <quote>ldap</quote>, <quote>AD</quote> or <quote>ipa</quote>.
pt: LDAP:(userCertificate;binary={cert!bin}) para provedores baseados em LDAP como <quote>ldap</quote>, <quote>AD</quote> ou <quote>ipa</quote>.

source: If maprule is not set and provider is <quote>proxy</quote>, the RULE_NAME name is assumed to be the name of the matching user.
pt: se maprule não estiver definida e o provedor for <quote>proxy</quote>, o nome RULE_NAME é assumido para ser o nome do utilizador correspondente.

source: Comma separated list of domain names the rule should be applied. By default a rule is only valid in the domain configured in sssd.conf. If the provider supports subdomains this option can be used to add the rule to subdomains as well.
pt: Lista de nomes de domínios separados por vírgulas em que a regra deve ser aplicada. Por predefinição uma regra é apenas válida no domínio configurado no sssd.conf. Se o provedor suportar subdomínios esta opção pode ser usada para adicionar a regra também a subdomínios.

source: Default: the configured domain in sssd.conf
pt: Predefinição: o domínio configurado em sssd.conf

source: priority (integer)
pt: priority (inteiro)

source: Unsigned integer value defining the priority of the rule. The higher the number the lower the priority. <quote>0</quote> stands for the highest priority while <quote>4294967295</quote> is the lowest.
pt: Valor inteiro não assinado que define a prioridade da regra. Quanto mais alto o número mais baixa a prioridade. <quote>0</quote> significa a mais alta prioridade enquanto <quote>4294967295</quote> é a mais baixa.

source: Default: the lowest priority
pt: Predefinição: a prioridade mais baixa

source: PROMPTING CONFIGURATION SECTION
pt: SECÇÃO DE CONFIGURAÇÃO DE INCITAÇÃO
