Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: It is possible to add another PAM service name to the default set by using <quote>+service_name</quote> or to explicitly remove a PAM service name from the default set by using <quote>-service_name</quote>. For example, in order to replace a default PAM service name for this logon right (e.g. <quote>login</quote>) with a custom pam service name (e.g. <quote>my_pam_service</quote>), you would use the following configuration: <placeholder type="programlisting" id="0"/>
pt: É possível adicionar outro nome de serviço PAM ao conjunto predefinido ao usar <quote>+service_name</quote> ou removendo explicitamente um nome de serviço PAM do conjunto predefinido ao usar <quote>-service_name</quote>. Por exemplo, de modo a substituir um nome de serviço PAM predefinido por este direito de login (ex. <quote>login</quote>) por um nome de serviço pam personalizado (ex. <quote>my_pam_service</quote>), você deverá usar a seguinte configuração: <placeholder type="programlisting" id="0"/>

source: A comma-separated list of PAM service names for which GPO-based access control is evaluated based on the RemoteInteractiveLogonRight and DenyRemoteInteractiveLogonRight policy settings. Only those GPOs are evaluated for which the user has Read and Apply Group Policy permission (see option <quote>ad_gpo_access_control</quote>). If an evaluated GPO contains the deny remote logon setting for the user or one of its groups, the user is denied remote interactive access. If none of the evaluated GPOs has a remote interactive logon right defined, the user is granted remote access. If at least one evaluated GPO contains remote interactive logon right settings, the user is granted remote access only, if it or at least one of its groups is part of the policy settings.
pt: Uma lista separada por vírgulas de nomes de serviço PAM para os quais o controle de acesso baseado em GPO é avaliado com base nas definições de política RemoteInteractiveLogonRight e DenyRemoteInteractiveLogonRight. Apenas esses GPOs são avaliados para os quais o utilizador tem permissão Read e Apply Group Policy (veja a opção <quote>ad_gpo_access_control</quote>). Se um GPO avaliado conter a definição de logon remoto interactivo deny para o utilizador ou para um dos seus grupos, ao utilizador é negado acesso remoto. Se nenhum dos GPOs avaliados tiver um direito de logon remoto interactivo definido, ao utilizador é concedido acesso remoto. Se pelo menos um GPO avaliado conter definições de direito de logon remoto interactivo, ao utilizador é concedido acesso remoto apenas, se ele ou pelo menos um dos seus grupos fizer parte das definições de política.

source: Note: Using the Group Policy Management Editor this value is called "Allow log on through Remote Desktop Services" and "Deny log on through Remote Desktop Services".
pt: Nota: Usando o Editor de Gestão de Política de Grupo este valor é chamado "Allow log on through Remote Desktop Services" e "Deny log on through Remote Desktop Services".

source: It is possible to add another PAM service name to the default set by using <quote>+service_name</quote> or to explicitly remove a PAM service name from the default set by using <quote>-service_name</quote>. For example, in order to replace a default PAM service name for this logon right (e.g. <quote>sshd</quote>) with a custom pam service name (e.g. <quote>my_pam_service</quote>), you would use the following configuration: <placeholder type="programlisting" id="0"/>
pt: É possível adicionar outro nome de serviço PAM ao conjunto predefinido ao usar <quote>+service_name</quote> ou removendo explicitamente um nome de serviço PAM do conjunto predefinido ao usar <quote>-service_name</quote>. Por exemplo, de modo a substituir um nome de serviço PAM predefinido por este direito de login (ex. <quote>sshd</quote>) por um nome de serviço pam personalizado (ex. <quote>my_pam_service</quote>), você deverá usar a seguinte configuração: <placeholder type="programlisting" id="0"/>

source: A comma-separated list of PAM service names for which GPO-based access control is evaluated based on the NetworkLogonRight and DenyNetworkLogonRight policy settings. Only those GPOs are evaluated for which the user has Read and Apply Group Policy permission (see option <quote>ad_gpo_access_control</quote>). If an evaluated GPO contains the deny network logon setting for the user or one of its groups, the user is denied network logon access. If none of the evaluated GPOs has a network logon right defined, the user is granted logon access. If at least one evaluated GPO contains network logon right settings, the user is granted logon access only, if it or at least one of its groups is part of the policy settings.
pt: Uma lista separada por vírgulas de nomes de serviço PAM para os quais o controle de acesso baseado em GPO é avaliado com base nas definições de política NetworkLogonRight e DenyNetworkLogonRigh. Apenas esses GPOs são avaliados para os quais o utilizador tem permissão Read e Apply Group Policy (veja a opção <quote>ad_gpo_access_control</quote>). Se um GPO avaliado conter a definição de logon de rede interactivo deny para o utilizador ou para um dos seus grupos, ao utilizador é negado acesso de rede. Se nenhum dos GPOs avaliados tiver um direito de logon de rede interactivo definido, ao utilizador é concedido acesso. Se pelo menos um GPO avaliado conter definições de direito de logon de rede interactivo, ao utilizador é concedido acesso apenas, se ele ou pelo menos um dos seus grupos fizer parte das definições de política.

source: Note: Using the Group Policy Management Editor this value is called "Access this computer from the network" and "Deny access to this computer from the network".
pt: Nota: Usando o Editor de Gestão de Política de Grupo este valor é chamado "Access this computer from the network" e "Deny access to this computer from the network".

source: It is possible to add another PAM service name to the default set by using <quote>+service_name</quote> or to explicitly remove a PAM service name from the default set by using <quote>-service_name</quote>. For example, in order to replace a default PAM service name for this logon right (e.g. <quote>ftp</quote>) with a custom pam service name (e.g. <quote>my_pam_service</quote>), you would use the following configuration: <placeholder type="programlisting" id="0"/>
pt: É possível adicionar outro nome de serviço PAM ao conjunto predefinido ao usar <quote>+service_name</quote> ou removendo explicitamente um nome de serviço PAM do conjunto predefinido ao usar <quote>-service_name</quote>. Por exemplo, de modo a substituir um nome de serviço PAM predefinido por este direito de login (ex. <quote>ftp</quote>) por um nome de serviço pam personalizado (ex. <quote>my_pam_service</quote>), você deverá usar a seguinte configuração: <placeholder type="programlisting" id="0"/>

source: A comma-separated list of PAM service names for which GPO-based access control is evaluated based on the BatchLogonRight and DenyBatchLogonRight policy settings. Only those GPOs are evaluated for which the user has Read and Apply Group Policy permission (see option <quote>ad_gpo_access_control</quote>). If an evaluated GPO contains the deny batch logon setting for the user or one of its groups, the user is denied batch logon access. If none of the evaluated GPOs has a batch logon right defined, the user is granted logon access. If at least one evaluated GPO contains batch logon right settings, the user is granted logon access only, if it or at least one of its groups is part of the policy settings.
pt: Uma lista separada por vírgulas de nomes de serviço PAM para os quais o controle de acesso baseado em GPO é avaliado com base nas definições de política BatchLogonRight e DenyBatchLogonRight. Apenas esses GPOs são avaliados para os quais o utilizador tem permissão Read e Apply Group Policy (veja a opção <quote>ad_gpo_access_control</quote>). Se um GPO avaliado conter a definição de logon em lote interactivo deny para o utilizador ou para um dos seus grupos, ao utilizador é negado acesso em lote. Se nenhum dos GPOs avaliados tiver um direito de logon em lote interactivo definido, ao utilizador é concedido acesso. Se pelo menos um GPO avaliado conter definições de direito de logon em lote interactivo, ao utilizador é concedido acesso apenas, se ele ou pelo menos um dos seus grupos fizer parte das definições de política.

source: Note: Using the Group Policy Management Editor this value is called "Allow log on as a batch job" and "Deny log on as a batch job".
pt: Nota: Usando o Editor de Gestão de Política de Grupo este valor é chamado "Allow log on as a batch job" e "Deny log on as a batch job".

source: It is possible to add another PAM service name to the default set by using <quote>+service_name</quote> or to explicitly remove a PAM service name from the default set by using <quote>-service_name</quote>. For example, in order to replace a default PAM service name for this logon right (e.g. <quote>crond</quote>) with a custom pam service name (e.g. <quote>my_pam_service</quote>), you would use the following configuration: <placeholder type="programlisting" id="0"/>
pt: É possível adicionar outro nome de serviço PAM ao conjunto predefinido ao usar <quote>+service_name</quote> ou removendo explicitamente um nome de serviço PAM do conjunto predefinido ao usar <quote>-service_name</quote>. Por exemplo, de modo a substituir um nome de serviço PAM predefinido por este direito de login (ex. <quote>crond</quote>) por um nome de serviço pam personalizado (ex. <quote>my_pam_service</quote>), você deverá usar a seguinte configuração: <placeholder type="programlisting" id="0"/>

source: Note: Cron service name may differ depending on Linux distribution used.
pt: Nota: O nome do serviço Cron pode diferir dependendo da distribuição Linux usada.

source: A comma-separated list of PAM service names for which GPO-based access control is evaluated based on the ServiceLogonRight and DenyServiceLogonRight policy settings. Only those GPOs are evaluated for which the user has Read and Apply Group Policy permission (see option <quote>ad_gpo_access_control</quote>). If an evaluated GPO contains the deny service logon setting for the user or one of its groups, the user is denied service logon access. If none of the evaluated GPOs has a service logon right defined, the user is granted logon access. If at least one evaluated GPO contains service logon right settings, the user is granted logon access only, if it or at least one of its groups is part of the policy settings.
pt: Uma lista separada por vírgulas de nomes de serviço PAM para os quais o controle de acesso baseado em GPO é avaliado com base nas definições de política ServiceLogonRight e DenyServiceLogonRight. Apenas esses GPOs são avaliados para os quais o utilizador tem permissão Read e Apply Group Policy (veja a opção <quote>ad_gpo_access_control</quote>). Se um GPO avaliado conter a definição de logon de serviço deny para o utilizador ou para um dos seus grupos, ao utilizador é negado acesso de serviço. Se nenhum dos GPOs avaliados tiver um direito de logon de serviço definido, ao utilizador é concedido acesso. Se pelo menos um GPO avaliado conter definições de direito de logon de serviço, ao utilizador é concedido acesso apenas, se ele ou pelo menos um dos seus grupos fizer parte das definições de política.

source: Note: Using the Group Policy Management Editor this value is called "Allow log on as a service" and "Deny log on as a service".
pt: Nota: Usando o Editor de Gestão de Política de Grupo este valor é chamado "Allow log on as a service" e "Deny log on as a service".

source: It is possible to add a PAM service name to the default set by using <quote>+service_name</quote>. Since the default set is empty, it is not possible to remove a PAM service name from the default set. For example, in order to add a custom pam service name (e.g. <quote>my_pam_service</quote>), you would use the following configuration: <placeholder type="programlisting" id="0"/>
pt: É possível adicionar um nome de serviço PAM ao conjunto predefinido ao usar <quote>+service_name</quote>. Como o conjunto predefinido está vazio, não é possível remover um nome de serviço PAM do conjunto predefinido. Por exemplo, de modo a adicionar um serviço pam personalizado (ex. <quote>my_pam_service</quote>), você deve usar a seguinte configuração: <placeholder type="programlisting" id="0"/>

source: A comma-separated list of PAM service names for which GPO-based access is always granted, regardless of any GPO Logon Rights.
pt: Uma lista separada por vírgulas de nomes de serviço PAM para os quais o acesso baseado em GPO é sempre concedido, independentemente de quaisquer Direitos de Logon GPO.

source: It is possible to add another PAM service name to the default set by using <quote>+service_name</quote> or to explicitly remove a PAM service name from the default set by using <quote>-service_name</quote>. For example, in order to replace a default PAM service name for unconditionally permitted access (e.g. <quote>sudo</quote>) with a custom pam service name (e.g. <quote>my_pam_service</quote>), you would use the following configuration: <placeholder type="programlisting" id="0"/>
pt: É possível adicionar outro nome de serviço PAM ao conjunto predefinido ao usar <quote>+service_name</quote> ou removendo explicitamente um nome de serviço PAM do conjunto predefinido ao usar <quote>-service_name</quote>. Por exemplo, de modo a substituir um nome de serviço PAM predefinido por um de acesso permitido incondicionalmente (ex. <quote>sudo</quote>) por um nome de serviço pam personalizado (ex. <quote>my_pam_service</quote>), você deverá usar a seguinte configuração: <placeholder type="programlisting" id="0"/>

source: A comma-separated list of PAM service names for which GPO-based access is always denied, regardless of any GPO Logon Rights.
pt: Uma lista separada por vírgulas de nomes de serviço PAM para os quais o acesso baseado em GPO é sempre negado, independentemente de quaisquer Direitos de Logon GPO.

source: This option defines how access control is evaluated for PAM service names that are not explicitly listed in one of the ad_gpo_map_* options. This option can be set in two different manners. First, this option can be set to use a default logon right. For example, if this option is set to 'interactive', it means that unmapped PAM service names will be processed based on the InteractiveLogonRight and DenyInteractiveLogonRight policy settings. Alternatively, this option can be set to either always permit or always deny access for unmapped PAM service names.
pt: Esta opção define como o controle de acesso é avaliado para nomes de serviço PAM que não estão listados explicitamente em uma das opções ad_gpo_map_*. Esta opção pode ser definida de duas maneiras diferentes. Primeiro, esta opção pode ser definida para se usar um direito de login predefinido. Por exemplo, se esta opção for definida para 'interactive', significa que os nomes de serviços PAM não mapeados irão ser processados com base nas definições de política InteractiveLogonRight e DenyInteractiveLogonRight. Em alternativa, esta opção pode ser definida para ou permitir sempre ou negar sempre o acesso a nomes de serviços PAM não mapeados.

source: Supported values for this option include:
pt: Os valores suportados para esta opção incluem:

source: Default: deny
pt: Predefinição: deny

source: ad_maximum_machine_account_password_age (integer)
pt: ad_maximum_machine_account_password_age (inteiro)

source: SSSD will check once a day if the machine account password is older than the given age in days and try to renew it. A value of 0 will disable the renewal attempt.
pt: O SSSD irá verificar uma vez por dia se a palavra passe da conta da máquina é mais antiga que a idade dada em dias e tentar renova-la. Um valor de 0 irá desactivar a tentativa de renovação.

source: Default: 30 days
pt: Predefinição: 30 dias

source: This option should only be used to test the machine account renewal task. The option expects 3 integers and a string separated by a colon (':'). The first integer defines the interval in seconds how often the task is run. The second specifies the initial timeout in seconds before the task is run for the first time after startup. The optional third value specifies a maximal random offset to the previous two values to avoid updates of many hosts at the same time ("thundering herd problem"). If this value is missing or empty in the value string '0' will be used.
pt: Esta opção só deve ser usada para testar a tarefa de renovação de conta da maquina. A opção espera 3 inteiros separados por dois pontos (':'). O primeiro inteiro define o intervalo em segundos da frequência que a tarefa irá correr. O segundo especifica o tempo limite inicial em segundos antes da tarefa correr pela primeira vez após o arranque. O terceiro valor opcional especifica um desvio aleatório máximo aos dois valores anteriores para evitar atualizações de muitas máquinas ao mesmo tempo ("problema estranho trovejante"). Se este valor estiver em falta ou vazio será usado o valor string '0'.

source: The optional fourth string value identifies the helper binary which should be used for the renewal. Currently <command>adcli</command> and <command>realm</command> are supported. If this value is missing or empty in the value string <command>realm</command> will be used. Since the helper is started as the user SSSD is running as there might be the chance that the renewal will fail if this user does not has permissions to modify the keytab file where the machine account credentials are stored. This will typically be the case for <command>adcli</command>.
pt: O quarto valor string opcional identifica o binário ajudante que deve ser usado para a renovação. Atualmente são suportados <command>adcli</command> e <command>realm</command>. Se este valor estiver em falta ou vazio na string de valor será usado <command>realm</command> . Como o ajudante é arrancado como o utilizador do SSSD que o corre pode haver uma hipótese que a renovação vá falhar se este utilizador não tiver permissão para modificar o ficheiro keytab onde estão guardadas as credenciais da conta da máquina. Este será tipicamente o caso de <command>adcli</command>.

source: <command>realm</command> is not updating the keytab directly but is calling the <command>realmd</command> process, which runs as root user, for this task. <command>realmd</command> can allow access to non-privileged users with the help of PolicyKit and by default SSSD provides suitable rules for the user SSSD is running as.
pt: <command>realm</command> não está a atualizar a keytab diretamente mas está a chamar o processo <command>realmd</command>, o qual corre como utilizador root, para esta tarefa. <command>realmd</command> pode permitir acesso a utilizadores não-privilegiados coma a ajuda de PolicyKit e por predefinição o SSSD fornece regras apropriadas para o utilizador que o SSSD está a correr como.

source: Default: 86400:750:300:realm (24h, 12m30s and 5m)
pt: Predefinição: 86400:750:300:realm (24h, 12m30s and 5m)

source: ad_update_samba_machine_account_password (boolean)
pt: ad_update_samba_machine_account_password (booleano)

source: If enabled, when SSSD renews the machine account password, it will also be updated in Samba's database. This prevents Samba's copy of the machine account password from getting out of date when it is set up to use AD for authentication.
pt: Se activa, quando o SSSD renova a palavra passe da conta da máquina, será também actualizada na base de dados do Samba. Isto previne que a cópia do Samba da palavra passe da conta da máquina fique desactualizada quando é configurada para usar AD para autenticação.

source: ad_use_ldaps (bool)
pt: ad_use_ldaps (booleano)

source: By default SSSD uses the plain LDAP port 389 and the Global Catalog port 3628. If this option is set to True SSSD will use the LDAPS port 636 and Global Catalog port 3629 with LDAPS protection. Since AD does not allow to have multiple encryption layers on a single connection and we still want to use SASL/GSSAPI or SASL/GSS-SPNEGO for authentication the SASL security property maxssf is set to 0 (zero) for those connections.
pt: Por predefinição o SSSD usa o porto 389 do LDAP simples e o porto 3628 do Global Catalog. Se esta opção estiver definida para True, o SSSD irá usar o porto 636 do LDAPS e o porto 3629 do Global Catalog com proteção LDAPS. Como o AD não permite ter múltiplas camadas de encriptação numa única ligação, e nós ainda queremos usar SASL/GSSAPI ou SASL/GSS-SPNEGO para autenticação a propriedade de segurança do SASL maxssf é definida para 0 (zero) para essas ligações.

source: Optional. This option tells SSSD to automatically update the Active Directory DNS server with the IP address of this client. The update is secured using GSS-TSIG. As a consequence, the Active Directory administrator only needs to allow secure updates for the DNS zone. The IP address of the AD LDAP connection is used for the updates, if it is not otherwise specified by using the <quote>dyndns_iface</quote> option.
pt: Opcional. Esta opção diz ao SSSD para actualizar automaticamente o servidor DNS Active Directory com o endereço IP deste cliente. A actualização é segura usando GSS-TSIG. Como uma consequência, o administrador do Active Directory só precisa de permitir actualizações seguras para a zona do DNS. O endereço IP da ligação LDAP AD é usado para as actualizações, se não for caso contrário especificado ao se usar a opção <quote>dyndns_iface</quote>.

source: Default: 3600 (seconds)
pt: Predefinição: 3600 (segundos)

source: NOTE: While it is still possible to use the old <emphasis>ipa_dyndns_iface</emphasis> option, users should migrate to using <emphasis>dyndns_iface</emphasis> in their config file.
pt: NOTA: Apesar de ainda ser possível usar a opção antiga <emphasis>ipa_dyndns_iface</emphasis>, os utilizadores devem migrar para usar<emphasis>dyndns_iface</emphasis> no seu ficheiro de configuração.

source: Default: Use the IP addresses of the interface which is used for AD LDAP connection
pt: Predefinição: Usa o endereço IP da interface que é usada para ligação AD LDAP

source: How often should the back end perform periodic DNS update in addition to the automatic update performed when the back end goes online. This option is optional and applicable only when dyndns_update is true. Note that the lowest possible value is 60 seconds in-case if value is provided less than 60, parameter will assume lowest value only.
pt: Quão frequente deve o backend executar a actualização DNS periódica em adição à actualização automática executada quando o backend fica online. Esta opção é opcional e aplicável apenas quando dyndns_update é true. Note que o valor mais baixo possível é 60 segundos, no caso de o valor fornecido ser inferior a 60, o parâmetro irá assumir apenas o menor valor.

source: The following example assumes that SSSD is correctly configured and example.com is one of the domains in the <replaceable>[sssd]</replaceable> section. This example shows only the AD provider-specific options.
pt: O seguinte exemplo assume que o SSSD está actualmente configurado e example.com é um dos domínios na secção <replaceable>[sssd]</replaceable>. Este exemplo mostra apenas as opções específicas do provedor AD.

source: The AD access control provider checks if the account is expired. It has the same effect as the following configuration of the LDAP provider: <placeholder type="programlisting" id="0"/>
pt: O provedor de controle de acesso AD verifica se a conta expirou. Tem o mesmo efeito que a seguinte configuração do provedor LDAP: <placeholder type="programlisting" id="0"/>
