Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: This template will add the whole DER encoded certificate as a string to the search filter. Depending on the conversion option the binary certificate is either converted to an escaped hex sequence '\xx' or base64. The escaped hex sequence is the default and can e.g. be used with the LDAP attribute 'userCertificate;binary'.
pt: Este modelo irá adicionar o certificado completo codificado em DER como uma string ao filtro de busca. Dependendo da opção de conversão o certificado binário é ou convertido para uma sequência hexadecimal escapada \\xx' ou base64. A sequência hexadecimal escapada é a predefinição e pode, por exemplo, ser usada com o atributo do LDAP 'userCertificate;binary'.

source: Example: (userCertificate;binary={cert!bin})
pt: Exemplo: (userCertificate;binary={cert!bin})

source: This template will add the Kerberos principal which is taken either from the SAN used by pkinit or the one used by AD. The 'short_name' component represents the first part of the principal before the '@' sign.
pt: Este modelo irá adicionar o principal Kerberos o qual é tomado ou a partir do SAN usado pelo pkinit ou daquele usado pelo AD. O componente 'short_name' representa a primeira parte do principal antes do sinal '@'.

source: Example: (|(userPrincipal={subject_principal})(samAccountName={subject_principal.short_name}))
pt: Exemplo: (|(userPrincipal={subject_principal})(samAccountName={subject_principal.short_name}))

source: This template will add the Kerberos principal which is given by the SAN used by pkinit. The 'short_name' component represents the first part of the principal before the '@' sign.
pt: Este modelo irá adicionar o principal Kerberos o qual é dado pelo SAN usado pelo pkinit. O componente 'short_name' representa a primeira parte do principal antes do sinal '@'.

source: Example: (|(userPrincipal={subject_pkinit_principal})(uid={subject_pkinit_principal.short_name}))
pt: Exemplo: (|(userPrincipal={subject_pkinit_principal})(uid={subject_pkinit_principal.short_name}))

source: This template will add the Kerberos principal which is given by the SAN used by AD. The 'short_name' component represent the first part of the principal before the '@' sign.
pt: Este modelo irá adicionar o principal Kerberos o qual é dado pelo SAN usado pelo AD. O componente 'short_name' representa a primeira parte do principal antes do sinal '@'.

source: Example: (|(userPrincipalName={subject_nt_principal})(samAccountName={subject_nt_principal.short_name}))
pt: Exemplo: (|(userPrincipalName={subject_nt_principal})(samAccountName={subject_nt_principal.short_name}))

source: This template will add the string which is stored in the rfc822Name component of the SAN, typically an email address. The 'short_name' component represents the first part of the address before the '@' sign.
pt: Este modelo irá adicionar a string que está guardada no componente rfc822Name do SAN, tipicamente um endereço de email. O componente 'short_name' representa a primeira parte do endereço antes do sinal '@'.

source: Example: (|(mail={subject_rfc822_name})(uid={subject_rfc822_name.short_name}))
pt: Exemplo: (|(mail={subject_rfc822_name})(uid={subject_rfc822_name.short_name}))

source: This template will add the string which is stored in the dNSName component of the SAN, typically a fully-qualified host name. The 'short_name' component represents the first part of the name before the first '.' sign.
pt: Este modelo irá adicionar a string que está guardada no componente dNSName do SAN, tipicamente um nome de máquina totalmente qualificado. O componente 'short_name' representa a primeira parte do nome antes do primeiro sinal '.'.

source: Example: (|(fqdn={subject_dns_name})(host={subject_dns_name.short_name}))
pt: Exemplo: (|(fqdn={subject_dns_name})(host={subject_dns_name.short_name}))

source: This template will add the string which is stored in the uniformResourceIdentifier component of the SAN.
pt: Este modelo irá adicionar a string que está guardada no componente uniformResourceIdentifier do SAN.

source: Example: (uri={subject_uri})
pt: Exemplo: (uri={subject_uri})

source: This template will add the string which is stored in the iPAddress component of the SAN.
pt: Este modelo irá adicionar a string que está guardada no componente iPAddress do SAN.

source: Example: (ip={subject_ip_address})
pt: Exemplo: (ip={subject_ip_address})

source: This template will add the value which is stored in the x400Address component of the SAN as escaped hex sequence.
pt: Este modelo irá adicionar o valor que está guardado no componente x400Address do SAN como sequência hexadecimal escapada.

source: Example: (attr:binary={subject_x400_address})
pt: Exemplo: (attr:binary={subject_x400_address})

source: This template will add the DN string of the value which is stored in the directoryName component of the SAN.
pt: Este modelo irá adicionar a string DN do valor que está guardado no componente directoryName do SAN.

source: Example: (orig_dn={subject_directory_name})
pt: Exemplo: (orig_dn={subject_directory_name})

source: This template will add the value which is stored in the ediPartyName component of the SAN as escaped hex sequence.
pt: Este modelo irá adicionar o valor que está guardado no componente ediPartyName do SAN como sequência hexadecimal escapada.

source: Example: (attr:binary={subject_ediparty_name})
pt: Exemplo: (attr:binary={subject_ediparty_name})

source: This template will add the OID which is stored in the registeredID component of the SAN as a dotted-decimal string.
pt: Este modelo irá adicionar o OID que está guardado no componente registeredID do SAN como uma string decimal-pontuada.

source: Example: (oid={subject_registered_id})
pt: Exemplo: (oid={subject_registered_id})

source: The templates to add certificate data to the search filter are based on Python-style formatting strings. They consist of a keyword in curly braces with an optional sub-component specifier separated by a '.' or an optional conversion/formatting option separated by a '!'. Allowed values are: <placeholder type="variablelist" id="0"/>
pt: Os modelos para adicionar dados de certificados aos filtros de busca são baseados em strings de formatação de estilo-Python. Consistem duma palavra chave entre chavetas com um especificador de sub-componente opcional separado por um '.' ou uma opção de conversão/formatação opcional separada por um '!'. Os valores permitidos são: <placeholder type="variablelist" id="0"/>

source: LDAPU1 extension
pt: Extensão LDAPU1

source: This template will add the serial number of the certificate. By default it will be printed as a hexadecimal number with lower-case letters.
pt: Este modelo irá adicionar o número de série do certificado. Por predefinição será escrito como um número hexadecimal com letras minúsculas.

source: With the formatting option '!dec' the number will be printed as decimal string. The hexadecimal output can be printed with upper-case letters ('!hex_u'), with a colon separating the hexadecimal bytes ('!hex_c') or with the hexadecimal bytes in reverse order ('!hex_r'). The postfix letters can be combined so that e.g. '!hex_uc' will produce a colon-separated hexadecimal string with upper-case letters.
pt: Com a opção de formatação '!dec' o número será escrito em string decimal. O resultado hexadecimal pode ser escrito com letras maiúsculas ('!hex_u'), com dois-pontos a separar os bytes hexadecimais ('!hex_c') ou com os bytes hexadecimais em ordem reversa ('!hex_r'). As letras posteriores podem ser combinadas para que ex. '!hex_uc' produza uma string hexadecimal separada por dois-pontos com letras maiúsculas.

source: Example: LDAPU1:(serial={serial_number})
pt: Exemplo: LDAPU1:(serial={serial_number})

source: This template will add the subject key id of the certificate. By default it will be printed as a hexadecimal number with lower-case letters.
pt: Este modelo irá adicionar o id de chave de objeto do certificado. Por predefinição será escrito como um número hexadecimal com letras minúsculas.

source: The hexadecimal output can be printed with upper-case letters ('!hex_u'), with a colon separating the hexadecimal bytes ('!hex_c') or with the hexadecimal bytes in reverse order ('!hex_r'). The postfix letters can be combined so that e.g. '!hex_uc' will produce a colon-separated hexadecimal string with upper-case letters.
pt: O resultado em hexadecimal pode ser escrito com letras maiúsculas ('!hex_u'), com dois-pontos a separar os bytes hexadecimais ('!hex_c') ou com os bytes hexadecimais em ordem reversa ('!hex_r'). As letras posteriores podem ser combinadas para que ex. '!hex_uc' produza uma string hexadecimal com dois-pontos a separar e letras maiúsculas.

source: Example: LDAPU1:(ski={subject_key_id})
pt: Exemplo: LDAPU1:(ski={subject_key_id})

source: This template will add the hexadecimal digest/hash of the certificate where DIGEST must be replaced with the name of a digest/hash function supported by OpenSSL, e.g. 'sha512'.
pt: Este modelo irá adicionar a digestão/cinza hexadecimal do certificado onde DIGEST tem de ser substituído pelo nome da função digest/hash suportada pelo OpenSSL, ex. 'sha512'.

source: The hexadecimal output can be printed with upper-case letters ('!sha512_u'), with a colon separating the hexadecimal bytes ('!sha512_c') or with the hexadecimal bytes in reverse order ('!sha512_r'). The postfix letters can be combined so that e.g. '!sha512_uc' will produce a colon-separated hexadecimal string with upper-case letters.
pt: O resultado em hexadecimal pode ser escrito com letras maiúsculas ('!sha512_u'), com dois-pontos a separar os bytes hexadecimais ('!sha512_c') ou com os bytes hexadecimais em ordem reversa ('!sha512_r'). As letras posteriores podem ser combinadas para que ex. '!sha512_uc' produza uma string hexadecimal com dois-pontos a separar e letras maiúsculas.

source: Example: LDAPU1:(dgst={cert!sha256})
pt: Exemplo: LDAPU1:(dgst={cert!sha256})

source: This template will add an attribute value of a component of the subject DN, by default the value of the most specific component.
pt: Este modelo irá adicionar um valor de atributo de um componente do objeto DN, por predefinição o valor do componente mais específico.

source: Example: LDAPU1:(uid={subject_dn_component.uid})
pt: Exemplo: LDAPU1:(uid={subject_dn_component.uid})

source: This template will add an attribute value of a component of the issuer DN, by default the value of the most specific component.
pt: Este modelo irá adicionar um valor de atributo de um componente do publicador DN, por predefinição o valor é o componente mais específico.

source: See 'subject_dn_component' for details about the attribute name and position specifiers.
pt: Veja 'subject_dn_component' para detalhes acerca de nome de atributo e especificadores de posição.

source: Example: LDAPU1:(domain={issuer_dn_component.[-2]}.{issuer_dn_component.dc[-1]})
pt: Exemplo: LDAPU1:(domain={issuer_dn_component.[-2]}.{issuer_dn_component.dc[-1]})

source: This template will add the SID if the corresponding extension introduced by Microsoft with the OID 1.3.6.1.4.1.311.25.2 is available. With the '.rid' selector only the last component, i.e. the RID, will be added.
pt: Este modelo irá adicionar o SID se a extensão correspondente introduzida pela Microsoft com o OID 1.3.6.1.4.1.311.25.2 estiver disponível. Com o seletor '.rid' apenas o último componente, isto é, o RID, será adicionado.

source: Example: LDAPU1:(objectsid={sid})
pt: Exemplo: LDAPU1:(objectsid={sid})

source: DOMAIN LIST
pt: LISTA DE DOMÍNIOS

source: If the domain list is not empty users mapped to a given certificate are not only searched in the local domain but in the listed domains as well as long as they are know by SSSD. Domains not know to SSSD will be ignored.
pt: Se a lista de domínios não estiver vazia, os utilizadores mapeados a um dado certificado não são apenas procurados no domínio local mas também nos domínios listados desde que sejam conhecidos pelo SSSD. Os domínios não conhecidos do SSSD serão ignorados.

source: SSSD IPA provider
pt: Provedor IPA do SSSD

source: This manual page describes the configuration of the IPA provider for <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. For a detailed syntax reference, refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
pt: Este manual descreve a configuração do provedor IPA <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Para uma referência detalhada da sintaxe, consulte a secção <quote>FORMATO DE FICHEIRO</quote> do manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: The IPA provider is a back end used to connect to an IPA server. (Refer to the freeipa.org web site for information about IPA servers.) This provider requires that the machine be joined to the IPA domain; configuration is almost entirely self-discovered and obtained directly from the server.
pt: O provedor IPA é um backend usado para ligar a um servidor IPA. (Consulte o sitio web freeipa.org para informação sobre servidores IPA.) Este provedor requer que a máquina se junte ao domínio IPA; a configuração é quase inteiramente auto-descoberta e obtida directamente a partir do servidor.

source: The IPA provider enables SSSD to use the <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> identity provider and the <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> authentication provider with optimizations for IPA environments. The IPA provider accepts the same options used by the sssd-ldap and sssd-krb5 providers with some exceptions. However, it is neither necessary nor recommended to set these options.
pt: O provedor IPA permite ao SSSD usar o provedor de identidade <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> e o provedor de autenticação <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> com optimizações para ambientes IPA. O provedor IPA aceita as mesmas opções usadas pelos provedores sssd-ldap e sssd-krb5 com algumas excepções. No entanto, não é necessário nem recomendado definir estas opções.

source: The IPA provider primarily copies the traditional ldap and krb5 provider default options with some exceptions, the differences are listed in the <quote>MODIFIED DEFAULT OPTIONS</quote> section.
pt: O provedor IPA primariamente copia as opções predefinidas dos provedores ldap e krb5 tradicionais com algumas excepções, as diferenças são listadas na secção <quote>OPÇÕES PREDEFINIDAS MODIFICADAS</quote>.

source: As an access provider, the IPA provider has a minimal configuration (see <quote>ipa_access_order</quote>) as it mainly uses HBAC (host-based access control) rules. Please refer to freeipa.org for more information about HBAC.
pt: Como um provedor de acesso, o provedor IPA tem uma configuração mínima (veja <quote>ipa_access_order</quote>) pois principalmente usa regras HBAC (controle de acesso baseado em máquina). Por favor consulte freeipa.org para mais informação acerca de HBAC.

source: If <quote>auth_provider=ipa</quote> or <quote>access_provider=ipa</quote> is configured in sssd.conf then the id_provider must also be set to <quote>ipa</quote>.
pt: Se <quote>auth_provider=ipa</quote> ou <quote>access_provider=ipa</quote> estiverem configurados no sssd.conf então o id_provider tem também de ser definido para <quote>ipa</quote>.

source: The IPA provider will use the PAC responder if the Kerberos tickets of users from trusted realms contain a PAC. To make configuration easier the PAC responder is started automatically if the IPA ID provider is configured.
pt: O provedor IPA irá usar o respondedor PAC se os bilhetes Kerberos de utilizadores de reinos de confiança conterem um PAC. Para facilitar a configuração o respondedor PAC é arrancado automaticamente se o provedor ID do IPA estiver configurado.

source: Specifies the name of the IPA domain. This is optional. If not provided, the configuration domain name is used.
pt: Especifica o nome do domínio IPA. Isto é opcional. Se não for fornecido, é usado o nome de domínio da configuração.

source: The comma-separated list of IP addresses or hostnames of the IPA servers to which SSSD should connect in the order of preference. For more information on failover and server redundancy, see the <quote>FAILOVER</quote> section. This is optional if autodiscovery is enabled. For more information on service discovery, refer to the <quote>SERVICE DISCOVERY</quote> section.
pt: A lista separada por vírgulas de endereços IP e nomes de máquinas dos servidores IPA aos quais o SSSD deve ligar por ordem de preferência. Para mais informação sobre failover e redundância de servidores. veja a secção <quote>FAILOVER</quote>. Isto é opcional se a auto-descoberta estiver activa. Para mais informação sobre descoberta de serviços, consulte a secção <quote>DESCOBERTA DE SERVIÇOS</quote>.

source: Optional. May be set on machines where the hostname(5) does not reflect the fully qualified name used in the IPA domain to identify this host. The hostname must be fully qualified.
pt: Opcional. Pode ser definido em máquinas onde os nomes-de-máquinas(5) não refletem o nome totalmente qualificado usado no domínio IPA para identificar esta máquina. O nome de máquina tem de ser totalmente qualificado.

source: dyndns_update (boolean)
pt: dyndns_update (booleano)

source: Optional. This option tells SSSD to automatically update the DNS server built into FreeIPA with the IP address of this client. The update is secured using GSS-TSIG. The IP address of the IPA LDAP connection is used for the updates, if it is not otherwise specified by using the <quote>dyndns_iface</quote> option.
pt: Opcional. Esta opção diz ao SSSD para actualizar automaticamente o servidor DNS embutido FreeIPA com o endereço IP deste cliente. A actualização é segura usando GSS-TSIG. O endereço IP da ligação LDAP IPA é usado para as actualizações, se não for caso contrário especificado ao se usar a opção <quote>dyndns_iface</quote>.

source: NOTE: On older systems (such as RHEL 5), for this behavior to work reliably, the default Kerberos realm must be set properly in /etc/krb5.conf
pt: NOTA: Em sistemas antigos (como o RHEL 5), para este comportamento poder ter fiabilidade de funcionamento, o reino Kerberos predefinido tem de ser definido apropriadamente em /etc/krb5.conf

source: dyndns_ttl (integer)
pt: dyndns_ttl (inteiro)

source: The TTL to apply to the client DNS record when updating it. If dyndns_update is false this has no effect. This will override the TTL serverside if set by an administrator.
pt: O TTL a aplicar ao registo de cliente DNS quando o actualiza. Se dyndns_update for false isto não tem efeito. Isto irá sobrepor o TTL do lado servidor se definido por um administrador.

source: Default: 1200 (seconds)
pt: Predefinição: 1200 (segundos)

source: Default: Use the IP addresses of the interface which is used for IPA LDAP connection
pt: Predefinição: Usa o endereço IP da interface que é usada para ligação IPA LDAP

source: Whether the nsupdate utility should use GSS-TSIG authentication for secure updates with the DNS server, insecure updates can be sent by setting this option to 'none'.
pt: Se o utilitário nsupdate deve usar autenticação GSS-TSIG para actualizações de segurança com o servidor DNS, actualizações não seguras podem ser enviadas ao definir esta opção para 'none'.

source: Default: GSS-TSIG
pt: Predefinição: GSS-TSIG

source: Whether the nsupdate utility should use GSS-TSIG authentication for secure PTR updates with the DNS server, insecure updates can be sent by setting this option to 'none'.
pt: Se o utilitário nsupdate deve usar autenticação GSS-TSIG para actualizações PTR de segurança com o servidor DNS, actualizações não seguras podem ser enviadas ao definir esta opção para 'none'.

source: Default: Same as dyndns_auth
pt: Predefinição: O mesmo que dyndns_auth

source: dyndns_refresh_interval (integer)
pt: dyndns_refresh_interval (inteiro)

source: How often should the back end perform periodic DNS update in addition to the automatic update performed when the back end goes online. This option is optional and applicable only when dyndns_update is true.
pt: Quão frequente deve o backend executar a actualização DNS periódica em adição à actualização automática executada quando o backend fica online. Esta opção é opcional e aplicável apenas quando dyndns_update é true.

source: dyndns_update_ptr (bool)
pt: dyndns_update_ptr (booleano)

source: Whether the PTR record should also be explicitly updated when updating the client's DNS records. Applicable only when dyndns_update is true.
pt: Se o registo PTR também deve ser explicitamente actualizado quando se actualiza os registos de DNS dos clientes. Aplicável apenas quando dyndns_update é true.

source: This option should be False in most IPA deployments as the IPA server generates the PTR records automatically when forward records are changed.
pt: Esta opção deve ser False na maioria de desenvolvimentos IPA pois o servidor IPA gera os registos PTR automaticamente quando os registos da frente são modificados.

source: Note that <emphasis>dyndns_update_per_family</emphasis> parameter does not apply for PTR record updates. Those updates are always sent separately.
pt: Note que o parâmetro <emphasis>dyndns_update_per_family</emphasis> não se aplica para atualizações de registo PTR Essas atualizações são sempre enviadas em separado.

source: Default: False (disabled)
pt: Predefinição: False (desactivado)

source: dyndns_force_tcp (bool)
pt: dyndns_force_tcp (booleano)

source: Whether the nsupdate utility should default to using TCP for communicating with the DNS server.
pt: Se o utilitário nsupdate deve por predefinição usar TCP para comunicar com o servidor DNS.

source: Default: False (let nsupdate choose the protocol)
pt: Predefinição: False (deixa o nsupdate escolher o protocolo)

source: The DNS server to use when performing a DNS update. In most setups, it's recommended to leave this option unset.
pt: O servidor DNS a usar quando executa uma actualização de DNS. Na maioria das configurações, é recomendado deixar esta opção por definir.

source: Setting this option makes sense for environments where the DNS server is different from the identity server or when we use encrypted DNS.
pt: Definir esta opção faz sentido em ambientes onde o servidor DNS é diferente do servidor de identidade ou quando usamos DNS encriptado.

source: The parameter can be a simple string containing DNS name or IP address. It can also be an URI. The URI can look like <emphasis>dns://servername/</emphasis> or <emphasis>dns+tls://1.2.3.4:853#servername/</emphasis>.
pt: O parâmetro ode ser uma string simples que contém um nome DNS ou um endereço IP. Também pode ser um URI. O URI pode parecer-se com <emphasis>dns://servername/</emphasis> ou <emphasis>dns+tls://1.2.3.4:853#servername/</emphasis>.

source: The second example enables DNS-over-TLS protocol for DNS updates. The nsupdate utility must support DoT - check the <emphasis>man nsupdate</emphasis> before enabling it in SSSD.
pt: O segundo exemplo ativa protocolo DNS-sobrer-TLS para atualizações de DNS. O utilitário nsupdate tem de suportar DoT - verifique o <emphasis>manual do nsupdate</emphasis> antes de o ativar no SSSD.
