Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: When a user or group entry for a particular domain is encountered for the first time, the SSSD allocates one of the available slices for that domain. In order to make this slice-assignment repeatable on different client machines, we select the slice based on the following algorithm:
pt: Quando uma entrada de utilizador ou grupo para um domínio particular é encontrada pela primeira vez, o SSSD aloca uma das fatias disponíveis para esse domínio. De modo a tornar esta atribuição de fatia repetível em diferentes máquinas cliente, nós selecionamos a fatia com base no seguinte algoritmo:

source: The SID string is passed through the murmurhash3 algorithm to convert it to a 32-bit hashed value. We then take the modulus of this value with the total number of available slices to pick the slice.
pt: A string SID é passada através do algoritmo murmurhash3 para a converter num valor cinza de 32-bit. Depois nós pegamos no modulus deste valor com o número total de fatias disponíveis para escolher a fatia.

source: NOTE: It is possible to encounter collisions in the hash and subsequent modulus. In these situations, we will select the next available slice, but it may not be possible to reproduce the same exact set of slices on other machines (since the order that they are encountered will determine their slice). In this situation, it is recommended to either switch to using explicit POSIX attributes in Active Directory (disabling ID-mapping) or configure a default domain to guarantee that at least one is always consistent. See <quote>Configuration</quote> for details.
pt: NOTA: É possível de se encontrar colisões na cinza e modulus subsequentes. Nestas situações, iremos selecionar a próxima fatia disponível, mas pode não ser possível de reproduzir o mesmo conjunto exacto de fatias em outras máquinas (pois a ordem com que são encontradas irá determinar a sua fatia). Nesta situação, é recomendado ou mudar para usar atributos POSIX explícitos em Active Directory (desactivando o mapeamento de ID) ou configurar um domínio predefinido para garantir que pelo menos um é sempre consistente. Veja <quote>Configuração</quote> para detalhes.

source: Minimum configuration (in the <quote>[domain/DOMAINNAME]</quote> section):
pt: Configuração mínima (na secção <quote>[domain/DOMAINNAME]</quote>):

source: The default configuration results in configuring 10,000 slices, each capable of holding up to 200,000 IDs, starting from 200,000 and going up to 2,000,200,000. This should be sufficient for most deployments.
pt: A configuração predefinida consiste em configurar 10,000 fatias, cada uma capaz de conter até 200,000 IDs, a começar de 200,000 e ir até a 2,000,200,000. Isto deve ser suficiente para a maioria dos desenvolvimentos.

source: Advanced Configuration
pt: Configuração Avançada

source: ldap_idmap_range_min (integer)
pt: ldap_idmap_range_min (inteiro)

source: Specifies the lower (inclusive) bound of the range of POSIX IDs to use for mapping Active Directory user and group SIDs. It is the first POSIX ID which can be used for the mapping.
pt: Especifica o limite mais baixo (inclusive) do alcance de IDs POSIX a usar para mapear SIDs de utilizador e grupo Active Directory. É o primeiro ID POSIX que pode ser usado para o mapeamento.

source: NOTE: This option is different from <quote>min_id</quote> in that <quote>min_id</quote> acts to filter the output of requests to this domain, whereas this option controls the range of ID assignment. This is a subtle distinction, but the good general advice would be to have <quote>min_id</quote> be less-than or equal to <quote>ldap_idmap_range_min</quote>
pt: NOTA: Esta opção é diferente de <quote>min_id</quote> em que <quote>min_id</quote> actua para filtrar o resultado de pedidos a este domínio, ao passo que esta opção controla a gama de atribuição de ID. Esta é uma distinção subtil, mas o bom conselho geral será que <quote>min_id</quote> seja menor ou igual a <quote>ldap_idmap_range_min</quote>

source: ldap_idmap_range_max (integer)
pt: ldap_idmap_range_max (inteiro)

source: Specifies the upper (exclusive) bound of the range of POSIX IDs to use for mapping Active Directory user and group SIDs. It is the first POSIX ID which cannot be used for the mapping anymore, i.e. one larger than the last one which can be used for the mapping.
pt: Especifica o limite mais alto (exclusivo) do alcance de IDs POSIX a usar para mapear SIDs de utilizador e grupo Active Directory. É o primeiro ID POSIX que não pode mais ser usado para o mapeamento, isto é, um maior que o último que pode ser usado para o mapeamento.

source: NOTE: This option is different from <quote>max_id</quote> in that <quote>max_id</quote> acts to filter the output of requests to this domain, whereas this option controls the range of ID assignment. This is a subtle distinction, but the good general advice would be to have <quote>max_id</quote> be greater-than or equal to <quote>ldap_idmap_range_max</quote>
pt: NOTA: Esta opção é diferente de <quote>max_id</quote> em que <quote>max_id</quote> actua para filtrar o resultado de pedidos a este domínio, ao passo que esta opção controla a gama de atribuição de ID. Esta é uma distinção subtil, mas o bom conselho geral será que <quote>max_id</quote> seja maior ou igual a <quote>ldap_idmap_range_max</quote>

source: ldap_idmap_range_size (integer)
pt: ldap_idmap_range_size (inteiro)

source: Specifies the number of IDs available for each slice. If the range size does not divide evenly into the min and max values, it will create as many complete slices as it can.
pt: Especifica o número de IDs disponível para cada fatia. Se o tamanho do alcance não se dividir uniforme nos valores mínimo e máximo, irá criar o máximo de fatias completas que conseguir.

source: NOTE: The value of this option must be at least as large as the highest user RID planned for use on the Active Directory server. User lookups and login will fail for any user whose RID is greater than this value.
pt: NOTA: O valor desta opção tem de ser pelo menos tão grande quando o RID planeado do mais alto utilizador para usar no servidor Active Directory. As procuras e login de utilizador irão falhar para qualquer utilizador cujo RID seja maior que este valor.

source: For example, if your most recently-added Active Directory user has objectSid=S-1-5-21-2153326666-2176343378-3404031434-1107, <quote>ldap_idmap_range_size</quote> must be at least 1108 as range size is equal to maximal RID minus minimal RID plus one (e.g. 1108 = 1107 - 0 + 1).
pt: Por exemplo, o seu utilizador Active Directory adicionado mais recente tem um objectSid=S-1-5-21-2153326666-2176343378-3404031434-1107, <quote>ldap_idmap_range_size</quote> tem de ser pelo menos 1108 pois o tamanho de alcance é igual ao RID máximo menos o RID mínimo mais um (ex. 1108 = 1107 - 0 + 1).

source: It is important to plan ahead for future expansion, as changing this value will result in changing all of the ID mappings on the system, leading to users with different local IDs than they previously had.
pt: É importante planear com antecedência para futura expansão, pois modificar este valor ira resultar e modificar todos os mapeamentos de ID no sistema, deixando os utilizadores com IDs locais diferentes dos que antes tinham.

source: Specify the domain SID of the default domain. This will guarantee that this domain will always be assigned to slice zero in the ID map, bypassing the murmurhash algorithm described above.
pt: Especifica o SID de domínio do domínio predefinido. Isto irá garantir que este domínio irá sempre ser atribuído à fatia zero no mapa de ID, contornando o algoritmo murmurhash descrito em cima.

source: Specify the name of the default domain.
pt: Especifica o nome do domínio predefinido.

source: ldap_idmap_autorid_compat (boolean)
pt: ldap_idmap_autorid_compat (booleano)

source: Changes the behavior of the ID-mapping algorithm to behave more similarly to winbind's <quote>idmap_autorid</quote> algorithm.
pt: Muda o comportamento do algoritmo de mapeamento de ID para se comportar de modo mais semelhante ao algoritmo <quote>idmap_autorid</quote> do winbind.

source: When this option is configured, domains will be allocated starting with slice zero and increasing monotonically with each additional domain.
pt: Quando esta opção está configurada, os domínios serão alocados começando da fatia zero e aumentando monotonicamente com cada domínio adicional.

source: NOTE: This algorithm is non-deterministic (it depends on the order that users and groups are requested). If this mode is required for compatibility with machines running winbind, it is recommended to also use the <quote>ldap_idmap_default_domain_sid</quote> option to guarantee that at least one domain is consistently allocated to slice zero.
pt: NOTA: Este algoritmo é não-determinístico (depende da ordem em que os utilizadores e grupos são requisitados). Se este modo for requerido para compatibilidade com máquinas que correm winbind, é recomendado que se também use a opção <quote>ldap_idmap_default_domain_sid</quote> para garantir que pelo menos um domínio é consistentemente alocado para a fatia zero.

source: ldap_idmap_helper_table_size (integer)
pt: ldap_idmap_helper_table_size (inteiro)

source: Maximal number of secondary slices that is tried when performing mapping from UNIX id to SID.
pt: Número máximo de fatias secundárias que é tentado quando se executa mapeamento de id UNIX para SID.

source: Note: Additional secondary slices might be generated when SID is being mapped to UNIX id and RID part of SID is out of range for secondary slices generated so far. If value of ldap_idmap_helper_table_size is equal to 0 then no additional secondary slices are generated.
pt: Nota: Podem ser geradas fatias secundárias adicionais quando o SID está a ser mapeado para id de UNIX e RID parte do SID está fora de alcance para as fatias secundárias geradas até ao momento. Se o valor de ldap_idmap_helper_table_size for igual a 0 então nenhuma fatia secundária adicional será gerada.

source: Well-Known SIDs
pt: SIDs Well-Known

source: SSSD supports to look up the names of Well-Known SIDs, i.e. SIDs with a special hardcoded meaning. Since the generic users and groups related to those Well-Known SIDs have no equivalent in a Linux/UNIX environment no POSIX IDs are available for those objects.
pt: SSSD suporta procurar nomes de SIDs Well-Known, isto é, SIDs com um significado especial codificado. Como os utilizadores e grupos genéricos relacionados a esses SIDs Well-Known não têm equivalente num ambiente Linux/UNIX, nenhuns IDs de POSIX estão disponíveis para esses objectos.

source: The SID name space is organized in authorities which can be seen as different domains. The authorities for the Well-Known SIDs are
pt: O espaço de nome SID está organizado em autoridades que podem ser vistas como diferentes domínios. As autoridades para os SIDs Well-Known são

source: The capitalized version of these names are used as domain names when returning the fully qualified name of a Well-Known SID.
pt: As versões capitalizada desses nomes são usadas como nomes de domínio quando se retorna o nome totalmente qualificado de um SID Well-Known.

source: Since some utilities allow to modify SID based access control information with the help of a name instead of using the SID directly SSSD supports to look up the SID by the name as well. To avoid collisions only the fully qualified names can be used to look up Well-Known SIDs. As a result the domain names <quote>NULL AUTHORITY</quote>, <quote>WORLD AUTHORITY</quote>, <quote>LOCAL AUTHORITY</quote>, <quote>CREATOR AUTHORITY</quote>, <quote>MANDATORY LABEL AUTHORITY</quote>, <quote>AUTHENTICATION AUTHORITY</quote>, <quote>NT AUTHORITY</quote> and <quote>BUILTIN</quote> should not be used as domain names in <filename>sssd.conf</filename>.
pt: Como alguns utilitários permitem modificar informação de controle de acesso baseado em SID com a ajuda de um nome em vez de se usar o SID diretamente, o SSSD suporta procurar o SID pelo nome também. Para evitar colisões apenas os nomes totalmente qualificados podem ser usados para procurar SIDs Well-Known. Como resultado os nomes de domínio <quote>NULL AUTHORITY</quote>, <quote>WORLD AUTHORITY</quote>, <quote> LOCAL AUTHORITY</quote>, <quote>CREATOR AUTHORITY</quote>, <quote>MANDATORY LABEL AUTHORITY</quote>, <quote>AUTHENTICATION AUTHORITY</quote>, <quote>NT AUTHORITY</quote> e <quote>BUILTIN</quote> não devem ser usados como nomes de domínio no <filename>sssd.conf</filename>.

source: Display help message and exit.
pt: Exibe a mensagem de ajuda e sai.

source: SSSD supports two representations for specifying the debug level. The simplest is to specify a decimal value from 0-9, which represents enabling that level and all lower-level debug messages. The more comprehensive option is to specify a hexadecimal bitmask to enable or disable specific levels (such as if you wish to suppress a level).
pt: O SSSD suporta duas representações para especificar o nível de depuração. A mais simples é para especificar um valor decimal de 0-9, o que representa activar esse nível e todas as mensagens de depuração de baixo-nível. A opção mais compreensiva é especificar uma máscara de bits hexadecimal para activar ou desactivar níveis específicos (tais como você desejar suprimir um nível).

source: Please note that each SSSD service logs into its own log file. Also please note that enabling <quote>debug_level</quote> in the <quote>[sssd]</quote> section only enables debugging just for the sssd process itself, not for the responder or provider processes. The <quote>debug_level</quote> parameter should be added to all sections that you wish to produce debug logs from.
pt: Por favor note que cada serviço SSSD regista para o seu próprio ficheiro de registo. E também por favor note que activar <quote>debug_level</quote> na secção <quote>[sssd]</quote> apenas activa a depuração só para o próprio processo sssd, não para os processos do respondedor ou provedor. O parâmetro <quote>debug_level</quote> deve ser adicionado a todas as secções que você deseje que produzam registos de depuração.

source: In addition to changing the log level in the config file using the <quote>debug_level</quote> parameter, which is persistent, but requires SSSD restart, it is also possible to change the debug level on the fly using the <citerefentry> <refentrytitle>sss_debuglevel</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> tool.
pt: Adicionalmente a alterar o nível de registo no ficheiro de configuração usando o parâmetro <quote>debug_level</quote>, o qual é persistente, mas requer que o SSSD reinicie, é também possível alterar o nível de depuração durante a execução usando a ferramenta <citerefentry> <refentrytitle>sss_debuglevel</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>.

source: Currently supported debug levels:
pt: Níveis de depuração actualmente suportados:

source: <emphasis>0</emphasis>, <emphasis>0x0010</emphasis>: Fatal failures. Anything that would prevent SSSD from starting up or causes it to cease running.
pt: <emphasis>0</emphasis>, <emphasis>0x0010</emphasis>: Falhas fatais. Qualquer coisa que previna o SSSD de arrancar ou causa que este cesse o funcionamento.

source: <emphasis>1</emphasis>, <emphasis>0x0020</emphasis>: Critical failures. An error that doesn't kill SSSD, but one that indicates that at least one major feature is not going to work properly.
pt: <emphasis>1</emphasis>, <emphasis>0x0020</emphasis>: Falhas críticas. Um erro que não mata o SSSD, mas um que indica que pelo menos uma grande funcionalidade não vai funcionar apropriadamente.

source: <emphasis>2</emphasis>, <emphasis>0x0040</emphasis>: Serious failures. An error announcing that a particular request or operation has failed.
pt: <emphasis>2</emphasis>, <emphasis>0x0040</emphasis>: Falhas sérias. Um erro que anuncia que um pedido ou operação particular falhou.

source: <emphasis>3</emphasis>, <emphasis>0x0080</emphasis>: Minor failures. These are the errors that would percolate down to cause the operation failure of 2.
pt: <emphasis>3</emphasis>, <emphasis>0x0080</emphasis>: Falhas menores. Estes são os erros que se filtrariam para causar a falha de operação de 2.

source: <emphasis>4</emphasis>, <emphasis>0x0100</emphasis>: Configuration settings.
pt: <emphasis>4</emphasis>, <emphasis>0x0100</emphasis>: Definições de configuração.

source: <emphasis>5</emphasis>, <emphasis>0x0200</emphasis>: Function data.
pt: <emphasis>5</emphasis>, <emphasis>0x0200</emphasis>: Dados de função.

source: <emphasis>6</emphasis>, <emphasis>0x0400</emphasis>: Trace messages for operation functions.
pt: <emphasis>6</emphasis>, <emphasis>0x0400</emphasis>: Mensagens de seguimento para funções de operação.

source: <emphasis>7</emphasis>, <emphasis>0x1000</emphasis>: Trace messages for internal control functions.
pt: <emphasis>7</emphasis>, <emphasis>0x1000</emphasis>: Mensagens de seguimento para funções de controle internas.

source: <emphasis>8</emphasis>, <emphasis>0x2000</emphasis>: Contents of function-internal variables that may be interesting.
pt: <emphasis>8</emphasis>, <emphasis>0x2000</emphasis>: Conteúdos de variáveis internas de função que podem ser interessantes.

source: <emphasis>9</emphasis>, <emphasis>0x4000</emphasis>: Extremely low-level tracing information.
pt: <emphasis>9</emphasis>, <emphasis>0x4000</emphasis>: Informação de seguimento de baixo-nível extremo.

source: <emphasis>9</emphasis>, <emphasis>0x20000</emphasis>: Performance and statistical data, please note that due to the way requests are processed internally the logged execution time of a request might be longer than it actually was.
pt: <emphasis>9</emphasis>, <emphasis>0x20000</emphasis>: Dados de performance e estatísticos, por favor note que devido ao modo que os pedidos são processados internamente o tempo de execução do registo de um pedido pode ser mais longo do que realmente é.

source: <emphasis>10</emphasis>, <emphasis>0x10000</emphasis>: Even more low-level libldb tracing information. Almost never really required.
pt: <emphasis>10</emphasis>, <emphasis>0x10000</emphasis>: Ainda mais informação de seguimento da libldb de baixo-nível. Quase nunca realmente necessário.

source: To log required bitmask debug levels, simply add their numbers together as shown in following examples:
pt: Para registar os níveis de depuração de máscara de bits requeridos, simplesmente adicione os seus números juntamente como mostrado nos seguintes exemplos:

source: <emphasis>Example</emphasis>: To log fatal failures, critical failures, serious failures and function data use 0x0270.
pt: <emphasis>Exemplo</emphasis>: Para registar falhas fatais, falhas críticas, falhas sérias e dados de funcionamento use 0x0270.

source: <emphasis>Example</emphasis>: To log fatal failures, configuration settings, function data, trace messages for internal control functions use 0x1310.
pt: <emphasis>Exemplo</emphasis>: Para registar falhas fatais, definições de configuração, dados de função, mensagens de seguimento para funções de controle internas, use 0x1310.

source: <emphasis>Note</emphasis>: The bitmask format of debug levels was introduced in 1.7.0.
pt: <emphasis>Nota</emphasis>: O formato bitmask dos níveis de depuração foi introduzido em 1.7.0.

source: <emphasis>Default</emphasis>: 0x0070 (i.e. fatal, critical and serious failures; corresponds to setting 2 in decimal notation)
pt: <emphasis>Predefinição</emphasis>: 0x0070 (isto é, falhas fatais, críticas e sérias; corresponde à definição 2 na notação decimal)

source: THE LOCAL DOMAIN
pt: O DOMÍNIO LOCAL

source: In order to function correctly, a domain with <quote>id_provider=local</quote> must be created and the SSSD must be running.
pt: De modo a funcionar correctamente, tem de ser criado um domínio com <quote>id_provider=local</quote> e o SSSD tem de estar a correr.

source: The administrator might want to use the SSSD local users instead of traditional UNIX users in cases where the group nesting (see <citerefentry> <refentrytitle>sss_groupadd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>) is needed. The local users are also useful for testing and development of the SSSD without having to deploy a full remote server. The <command>sss_user*</command> and <command>sss_group*</command> tools use a local LDB storage to store users and groups.
pt: O administrador pode querer usar os utilizadores locais do SSSD em vez dos utilizadores tradicionais UNIX em casos onde o aninhamento de grupos (veja <citerefentry> <refentrytitle>sss_groupadd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>) é necessário. Os utilizadores locais são também úteis para testes e desenvolvimento do SSSD sem se ter que implementar um servidor remoto completo. As ferramentas <command>sss_user*</command> e <command>sss_group*</command> usam um armazenamento LDB local para guardar utilizadores e grupos.

source: An optional base DN, search scope and LDAP filter to restrict LDAP searches for this attribute type.
pt: Um DN base opcional, escopo de busca e filtro LDAP para restringir as buscas LDAP para este tipo de atributo.

source: syntax: <placeholder type="programlisting" id="0"/>
pt: sintaxe: <placeholder type="programlisting" id="0"/>

source: The scope can be one of "base", "onelevel" or "subtree". The scope functions as specified in section 4.5.1.2 of http://tools.ietf.org/html/rfc4511
pt: O escopo pode ser um de "base", "onelevel" ou "subtree". O escopo funciona como especificado na secção 4.5.1.2 de http://tools.ietf.org/html/rfc4511

source: For examples of this syntax, please refer to the <quote>ldap_search_base</quote> examples section.
pt: Para exemplos desta sintaxe, por favor consulte a secção exemplos de <quote>ldap_search_base</quote>.

source: Please note that specifying scope or filter is not supported for searches against an Active Directory Server that might yield a large number of results and trigger the Range Retrieval extension in the response.
pt: Por favor note que especificar um escopo ou filtro não é suportado para buscas contra um Servidor Active Directory que pode produzir um grande número de resultado e despoletar a extensão Range Retrieval na resposta.

source: Please note that the automounter only reads the master map on startup, so if any autofs-related changes are made to the sssd.conf, you typically also need to restart the automounter daemon after restarting the SSSD.
pt: Por favor note que o automounter apenas lê o mapa mestre no arranque, assim se quaisquer alterações relacionadas com autofs forem feitas no sssd.conf, tipicamente você também precisa de reiniciar o daemon automounter após reiniciar o SSSD.

source: UID number
pt: Número UID

source: domain name
pt: nome de domínio

source: fully qualified user name (user@domain)
pt: nome do utilizador totalmente qualificado (utilizador@domínio)

source: The first letter of the login name.
pt: A primeira letra do nome de login.

source: UPN - User Principal Name (name@REALM)
pt: UPN - Nome Principal de Utilizador (nome@REINO)

source: The homedir value that is defined in the directory of the identity provider.
pt: O valor homedir que é definido no directório do provedor de identidade.
