Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: Please note that this option will be only used in fallback attempt when previous attempt using autodetected settings failed or when DNS-over-TLS is enabled.
pt: Por favor note que esta opção só será usada em tentativas de recurso quando a tentativa anterior que usa definições se auto-detecção falhe ou quando DNS-sobre-TLS estiver ativo.

source: Default: None (let nsupdate choose the server)
pt: Predefinição: None (deixa o nsupdate escolher o servidor)

source: dyndns_update_per_family (boolean)
pt: dyndns_update_per_family (booleano)

source: DNS update is by default performed in two steps - IPv4 update and then IPv6 update. In some cases it might be desirable to perform IPv4 and IPv6 update in single step.
pt: A actualização DNS é por predefinição feita em dois passos - actualização IPv4 e depois actualização IPv6. Nalguns casos pode ser desejável executar a actualização IPv4 e IPv6 num único passo.

source: This option specifies the file of the certificate authorities certificates (in PEM format) in order to verify the remote server TLS certificate when using DoT.
pt: Esta opção especifica o ficheiro do certificado da autoridade de certificados (em formato PEM) de modo a verificar o certificado TLS do servidor remoto quando se usa DoT.

source: Default: None (use global certificate store)
pt: Predefinição: Nenhum (usa o armazém de certificados global)

source: This option sets the certificate(s) file for authentication for the DoT transport to the remote server. The certificate chain file is expected to be in PEM format.
pt: Esta opção define o ficheiro de certificado(s) para autenticação para o transporte DoT para o servidor remoto. É esperado que o ficheiro de cadeia de certificados esteja em formato PEM.

source: The <emphasis>dyndns_dot_cert</emphasis> and <emphasis>dyndns_dot_key</emphasis> options must be both set to achieve mutual TLS authentication.
pt: As opções <emphasis>dyndns_dot_cert</emphasis> e <emphasis>dyndns_dot_key</emphasis> têm de ser ambas definidas para se conseguir autenticação TLS mútua.

source: Default: None (Do not use TLS authentication)
pt: Predefinição: Nenhuma (Não usa autenticação TLS)

source: This option sets the key file for authenticated encryption for the DoT transport to the remote server. The private key file is expected to be in PEM format.
pt: Esta opção define o ficheiro chave para encriptação autenticada para o transporte DoT ao servidor remoto. É esperado que o ficheiro da chave privada esteja em formato PEM.

source: <emphasis>expire</emphasis>: use IPA's account expiration policy.
pt: <emphasis>expire</emphasis>: usa política de expiração de conta do IPA.

source: Please note that 'access_provider = ipa' must be set for this feature to work.
pt: Por favor note que 'access_provider = ipa' tem de estar definido para esta funcionalidade funcionar.

source: Optional. Use the given string as search base for Desktop Profile related objects.
pt: Opcional. Usa a string dada como base de busca para objectos relacionados com Desktop Profile.

source: Default: Use base DN
pt: Predefinição: Usa base DN

source: Optional. Use the given string as search base for HBAC related objects.
pt: Opcional. Usa a string dada como base de busca para objectos relacionados com HBAC.

source: Deprecated. Use ldap_host_search_base instead.
pt: Descontinuado. Use ldap_host_search_base em vez disto.

source: Optional. Use the given string as search base for SELinux user maps.
pt: Opcional. Usa a string fornecida como base de busca para mapas de utilizador SELinux.

source: Optional. Use the given string as search base for trusted domains.
pt: Opcional. Usa a string fornecida como base de busca para domínios de confiança.

source: Default: the value of <emphasis>cn=trusts,%basedn</emphasis>
pt: Predefinição: o valor de <emphasis>cn=trusts,%basedn</emphasis>

source: Optional. Use the given string as search base for master domain object.
pt: Opcional. Usa a string fornecida como base de busca para objecto de domínio mestre.

source: Default: the value of <emphasis>cn=ad,cn=etc,%basedn</emphasis>
pt: Predefinição: o valor de <emphasis>cn=ad,cn=etc,%basedn</emphasis>

source: Optional. Use the given string as search base for views containers.
pt: Opcional. Usa a string fornecida como base de busca para recipientes de visualizações.

source: Default: the value of <emphasis>cn=views,cn=accounts,%basedn</emphasis>
pt: Predefinição: o valor de <emphasis>cn=views,cn=accounts,%basedn</emphasis>

source: The name of the Kerberos realm. This is optional and defaults to the value of <quote>ipa_domain</quote>.
pt: O nome do reino Kerberos. Isto é opcional e predefinido para o valor de <quote>ipa_domain</quote>.

source: The name of the Kerberos realm has a special meaning in IPA - it is converted into the base DN to use for performing LDAP operations.
pt: O nome do reino Kerberos tem um significado especial em IPA - é convertido num DN base a usar para executar operações de LDAP.

source: Absolute path of a directory where SSSD should place Kerberos configuration snippets.
pt: Caminho absoluto de um directório onde o SSSD deve colocar trechos de configuração do Kerberos.

source: To disable the creation of the configuration snippets set the parameter to 'none'.
pt: Para desactivar a criação de trechos de configuração defina o parâmetro para 'none'.

source: Default: not set (krb5.include.d subdirectory of SSSD's pubconf directory)
pt: Predefinição: não definida (sub-directório krb5.include.d do directório pubconf do SSSD)

source: ipa_deskprofile_refresh (integer)
pt: ipa_deskprofile_refresh (inteiro)

source: The amount of time between lookups of the Desktop Profile rules against the IPA server. This will reduce the latency and load on the IPA server if there are many desktop profiles requests made in a short period.
pt: A quantidade de tempo entre procuras das regras Desktop Profile contra o servidor IPA. Isto irá reduzir a latência e carga no servidor IPA se existirem muitos pedidos de perfil de desktop feitos num curto período.

source: Default: 5 (seconds)
pt: Predefinição: 5 (segundos)

source: ipa_deskprofile_request_interval (integer)
pt: ipa_deskprofile_request_interval (inteiro)

source: The amount of time between lookups of the Desktop Profile rules against the IPA server in case the last request did not return any rule.
pt: A quantidade de tempo entre procuras das regras Desktop Profile contra o servidor IPA no caso do último pedido não ter retornado nenhuma regra.

source: Default: 60 (minutes)
pt: Predefinição: 60 (minutos)

source: ipa_hbac_refresh (integer)
pt: ipa_hbac_refresh (inteiro)

source: The amount of time between lookups of the HBAC rules against the IPA server. This will reduce the latency and load on the IPA server if there are many access-control requests made in a short period.
pt: A quantidade de tempo entre procuras das regras HBAC contra o servidor IPA. Isto irá reduzir a latência e carga no servidor IPA se existirem muitos pedidos de controle de acesso feitos num curto período.

source: ipa_hbac_selinux (integer)
pt: ipa_hbac_selinux (inteiro)

source: The amount of time between lookups of the SELinux maps against the IPA server. This will reduce the latency and load on the IPA server if there are many user login requests made in a short period.
pt: A quantidade de tempo entre procuras de mapas SELinux contra o servidor IPA. Isto irá reduzir a latência e carga no servidor IPA se existirem muitos pedidos de login de utilizador feitos num curto período.

source: ipa_server_mode (boolean)
pt: ipa_server_mode (booleano)

source: This option will be set by the IPA installer (ipa-server-install) automatically and denotes if SSSD is running on an IPA server or not.
pt: Esta opção será definida automaticamente pelo instalador do IPA (ipa-server-install) e denota se o SSSD está a correr num servidor IPA ou não.

source: On an IPA server SSSD will lookup users and groups from trusted domains directly while on a client it will ask an IPA server.
pt: Num servidor IPA o SSSD irá procurar utilizadores e grupos de domínios de confiança directamente enquanto que num cliente irá perguntar ao servidor IPA.

source: NOTE: There are currently some assumptions that must be met when SSSD is running on an IPA server.
pt: NOTA: Existem actualmente algumas suposições que têm de ser respeitadas quando o SSSD corre num servidor IPA.

source: The <quote>ipa_server</quote> option must be configured to point to the IPA server itself. This is already the default set by the IPA installer, so no manual change is required.
pt: A opção <quote>ipa_server</quote> tem de ser configurada para apontar para o próprio servidor IPA. Esta é sempre a predefinição definida pelo instalador do IPA, portanto não é requerida nenhuma alteração manual.

source: The <quote>full_name_format</quote> option must not be tweaked to only print short names for users from trusted domains.
pt: A opção <quote>full_name_format</quote> não pode ser ajustada a apenas escrever nomes curtos para utilizadores de domínios de confiança.

source: The automounter location this IPA client will be using
pt: A localização de automounter que este cliente IPA irá usar

source: Default: The location named "default"
pt: Predefinição: A localização chamada "default"

source: VIEWS AND OVERRIDES
pt: VISUALIZAÇÕES E SOBREPOSIÇÕES

source: Objectclass of the view container.
pt: Objectclass do recipiente de vista.

source: Default: nsContainer
pt: Predefinição: nsContainer

source: Name of the attribute holding the name of the view.
pt: Nome do atributo que contém o nome da vista.

source: Default: cn
pt: Predefinição: NC

source: Objectclass of the override objects.
pt: Objectclass dos objectos de sobreposição.

source: Default: ipaOverrideAnchor
pt: Predefinição: ipaOverrideAnchor

source: Name of the attribute containing the reference to the original object in a remote domain.
pt: Nome do atributo que contém a referência ao objecto original num domínio remoto.

source: Default: ipaAnchorUUID
pt: Predefinição: ipaAnchorUUID

source: Name of the objectclass for user overrides. It is used to determine if the found override object is related to a user or a group.
pt: Nome do objectclass para sobreposições do utilizador. É usado para determinar se o objecto de sobreposição encontrado está relacionado com um utilizador ou um grupo.

source: User overrides can contain attributes given by
pt: As sobreposições de utilizador podem conter atributos dados por

source: Default: ipaUserOverride
pt: Predefinição: ipaUserOverride

source: Name of the objectclass for group overrides. It is used to determine if the found override object is related to a user or a group.
pt: Nome do objectclass para sobreposições do grupo. É usado para determinar se o objecto de sobreposição encontrado está relacionado com um utilizador ou um grupo.

source: Group overrides can contain attributes given by
pt: As sobreposições de grupo podem conter atributos dados por

source: Default: ipaGroupOverride
pt: Predefinição: ipaGroupOverride

source: SSSD can handle views and overrides which are offered by FreeIPA 4.1 and later version. Since all paths and objectclasses are fixed on the server side there is basically no need to configure anything. For completeness the related options are listed here with their default values. <placeholder type="variablelist" id="0"/>
pt: O SSSD consegue lidar com vistas e sobreposições que são oferecidas pelo FreeIPA 4.1 e versões posteriores. Como todos os caminhos e objectclasses são fixados no lado do servidor, não há basicamente nenhuma necessidade de configurar nada. Para complemento as opções relacionadas estão listadas aqui com os seus valores predefinidos. <placeholder type="variablelist" id="0"/>

source: SUBDOMAINS PROVIDER
pt: FORNECEDOR DE SUBDOMÍNIOS

source: The IPA subdomains provider behaves slightly differently if it is configured explicitly or implicitly.
pt: O provedor de sub-domínios do IPA comporta-se de modo levemente diferente se for configurado explicitamente ou implicitamente.

source: If the option 'subdomains_provider = ipa' is found in the domain section of sssd.conf, the IPA subdomains provider is configured explicitly, and all subdomain requests are sent to the IPA server if necessary.
pt: Se a opção 'subdomains_provider = ipa' existir na secção domain do sssd.conf, o provedor de sub-domínios do IPA está configurado explicitamente, e todos os pedidos de sub-domínio são enviados para o servidor IPA se tal for necessário.

source: If the option 'subdomains_provider' is not set in the domain section of sssd.conf but there is the option 'id_provider = ipa', the IPA subdomains provider is configured implicitly. In this case, if a subdomain request fails and indicates that the server does not support subdomains, i.e. is not configured for trusts, the IPA subdomains provider is disabled. After an hour or after the IPA provider goes online, the subdomains provider is enabled again.
pt: Se a opção 'subdomains_provider' não estiver definida na secção domain do sssd.conf mas existir a opção 'id_provider = ipa', o provedor de sub-domínios do IPA está configurado implicitamente. Neste caso, se um pedido de sub-domínio falhar e indicar que o servidor não suporta sub-domínios, isto é, não está configurado para confianças, o provedor de sub-domínios do IPA é desactivado. Após uma hora ou após o provedor IPA ir online, o provedor de sub-domínios é activado de novo.

source: TRUSTED DOMAINS CONFIGURATION
pt: CONFIGURAÇÃO DE DOMÍNIOS DE CONFIANÇA

source: Some configuration options can also be set for a trusted domain. A trusted domain configuration can be set using the trusted domain subsection as shown in the example below. Alternatively, the <quote>subdomain_inherit</quote> option can be used in the parent domain. <placeholder type="programlisting" id="0"/>
pt: Algumas opções de configuração também podem ser definidas para um domínio de confiança. Uma configuração de domínio de confiança pode ser definida usando a secção trusted domain como mostrado no exemplo em baixo. Em alternativa, a opção <quote>subdomain_inherit</quote> pode ser usada no domínio pai. <placeholder type="programlisting" id="0"/>

source: For more details, see the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
pt: Para mais detalhes, veja o manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: Different configuration options are tunable for a trusted domain depending on whether you are configuring SSSD on an IPA server or an IPA client.
pt: Opções de configuração diferentes são afinadas para um domínio de confiança dependendo de se você está a configurar o SSSD num servidor IPA ou num cliente IPA.

source: OPTIONS TUNABLE ON IPA MASTERS
pt: OPÇÕES AFINÁVEIS EM MESTRES IPA

source: The following options can be set in a subdomain section on an IPA master:
pt: As seguinte opções podem ser definidas na secção subdomain dum mestre IPA:

source: Options prefixed with 'ad_' or 'ipa_' only apply to their respective subdomain type.
pt: Opções prefixadas com 'ad_' ou 'ipa_' apenas se aplicam nos seus tipos de sub-domínio respectivos.

source: OPTIONS TUNABLE ON IPA CLIENTS
pt: OPÇÕES AFINÁVEIS EM CLIENTES IPA

source: The following options can be set in an AD subdomain section on an IPA client:
pt: As seguinte opções podem ser definidas numa secção subdomain AD dum cliente IPA:

source: Note that if both options are set, only <quote>ad_server</quote> is evaluated.
pt: Note que se ambas opções estiverem definidas, apenas <quote>ad_server</quote> é avaliada.

source: Since any request for a user or a group identity from a trusted domain triggered from an IPA client is resolved by the IPA server, the <quote>ad_server</quote> and <quote>ad_site</quote> options only affect which AD DC will the authentication be performed against. In particular, the addresses resolved from these lists will be written to <quote>kdcinfo</quote> files read by the Kerberos locator plugin. Please refer to the <citerefentry> <refentrytitle>sssd_krb5_locator_plugin</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> manual page for more details on the Kerberos locator plugin.
pt: Como qualquer pedido por identidade de utilizador ou grupo a partir de um domínio de confiança provocado por um cliente IPA é resolvido pelo servidor IPA, as opções <quote>ad_server</quote> e <quote>ad_site</quote> apenas afectam contra qual AD DC será a autenticação executada. Em particular, os endereços resolvidos a partir destas listas serão escritos em ficheiros <quote>kdcinfo</quote> lidos pelo plugin locador do Kerberos. Por favor consulte o manual <citerefentry> <refentrytitle>sssd_krb5_locator_plugin</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> para mais detalhes sobre o plugin locador do Kerberos.

source: The following example assumes that SSSD is correctly configured and example.com is one of the domains in the <replaceable>[sssd]</replaceable> section. This examples shows only the ipa provider-specific options.
pt: O seguinte exemplo assume que o SSSD está actualmente configurado e example.com é um dos domínios na secção <replaceable>[sssd]</replaceable>. Este exemplo mostra apenas as opções específicas do provedor ipa.

source: SSSD Active Directory provider
pt: Provedor Active Directory do SSSD

source: This manual page describes the configuration of the AD provider for <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. For a detailed syntax reference, refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
pt: Este manual descreve a configuração do provedor AD <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Para uma referência detalhada da sintaxe, consulte a secção <quote>FORMATO DE FICHEIRO</quote> do manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: The AD provider is a back end used to connect to an Active Directory server. This provider requires that the machine be joined to the AD domain and a keytab is available. Back end communication occurs over a GSSAPI-encrypted channel, SSL/TLS options should not be used with the AD provider and will be superseded by Kerberos usage.
pt: O provedor AD é um backend usado para ligar a um servidor Active Directory. este provedor requer que a máquina seja junta ao domínio AD e que esteja disponível uma keytab. A comunicação com o backend ocorre por um canal encriptado em GSSAPI, as opções de SSL/TLS não devem ser usadas com o provedor AD e serão sobrepostas por utilização do Kerberos.

source: The AD provider supports connecting to Active Directory 2008 R2 or later. Earlier versions may work, but are unsupported.
pt: O provedor AD suporta ligar a Active Directory 2008 R2 ou posterior. As versões anteriores podem funcionar, mas não são suportadas.

source: The AD provider can be used to get user information and authenticate users from trusted domains. Currently only trusted domains in the same forest are recognized. In addition servers from trusted domains are always auto-discovered.
pt: O provedor AD pode ser usado para obter informação e autenticar utilizadores de domínios de confiança. Presentemente apenas domínios de confiança na mesma floresta são reconhecidos. Adicionalmente, servidores de domínios de confiança são sempre auto-descobertos.

source: The AD provider enables SSSD to use the <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> identity provider and the <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> authentication provider with optimizations for Active Directory environments. The AD provider accepts the same options used by the sssd-ldap and sssd-krb5 providers with some exceptions. However, it is neither necessary nor recommended to set these options.
pt: O provedor AD permite ao SSSD usar o provedor de identidade <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> e o provedor de autenticação <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> com optimizações para ambientes Active Directory. O provedor AD aceita as mesmas opções usadas pelos provedores sssd-ldap e sssd-krb5 com algumas excepções. No entanto, não é necessário nem recomendado definir estas opções.

source: The AD provider primarily copies the traditional ldap and krb5 provider default options with some exceptions, the differences are listed in the <quote>MODIFIED DEFAULT OPTIONS</quote> section.
pt: O provedor AD primariamente copia as opções predefinidas dos provedores ldap e krb5 tradicionais com algumas excepções, as diferenças são listadas na secção <quote>OPÇÕES PREDEFINIDAS MODIFICADAS</quote>.

source: The AD provider can also be used as an access, chpass, sudo and autofs provider. No configuration of the access provider is required on the client side.
pt: O provedor AD pode também ser usado como provedor de acesso, chpass, sudo e autofs. Nenhuma configuração do provedor de acesso é requerida no lado cliente.

source: If <quote>auth_provider=ad</quote> or <quote>access_provider=ad</quote> is configured in sssd.conf then the id_provider must also be set to <quote>ad</quote>.
pt: Se <quote>auth_provider=ad</quote> ou <quote>access_provider=ad</quote> estiverem configurados no sssd.conf então o id_provider tem também de ser definido para <quote>ad</quote>.

source: By default, the AD provider will map UID and GID values from the objectSID parameter in Active Directory. For details on this, see the <quote>ID MAPPING</quote> section below. If you want to disable ID mapping and instead rely on POSIX attributes defined in Active Directory, you should set <placeholder type="programlisting" id="0"/> If POSIX attributes should be used, it is recommended for performance reasons that the attributes are also replicated to the Global Catalog. If POSIX attributes are replicated, SSSD will attempt to locate the domain of a requested numerical ID with the help of the Global Catalog and only search that domain. In contrast, if POSIX attributes are not replicated to the Global Catalog, SSSD must search all the domains in the forest sequentially. Please note that the <quote>cache_first</quote> option might be also helpful in speeding up domainless searches. Note that if only a subset of POSIX attributes is present in the Global Catalog, the non-replicated attributes are currently not read from the LDAP port.
pt: Por predefinição, o provedor AD irá mapear valores UID e GID a partir do parâmetro objectSID em Active Directory. Para detalhes sobre isto, veja a secção <quote>MAPEAMENTO de ID</quote> em baixo. Se você deseja desligar o mapeamento de ID e em vez disso confiar nos atributos POSIX definidos em Active Directory, você deve definir <placeholder type="programlisting" id="0"/> Se devem ser usados atributos POSIX, é recomendado por razões de performance que os atributos sejam também replicados para o Global Catalog. Se os atributos POSIX forem replicados, o SSSD irá tentar localizar o domínio de um ID numérico pedido com a ajuda do Global Catalog e apenas procura nesse domínio. Em contraste, se os atributos POSIX não forem replicados no Global Catalog, o SSSD tem de procurar em todos os domínios na floresta sequencialmente. Por favor note que a opção <quote>cache_first</quote> pode também ajudar a acelerar as buscas dos domínios. Note que se apenas um sub-conjunto de atributos POSIX estiver presente no Global Catalog, os atributos não-replicados atualmente não são lidos a partir do porto LDAP.
