Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: <emphasis>0</emphasis>: Disable microseconds in timestamp
pt: <emphasis>0</emphasis>: Desactiva os micro-segundos na marca horária

source: <option>--logger=</option><replaceable>value</replaceable>
pt: <option>--logger=</option><replaceable>valor</replaceable>

source: Location where SSSD will send log messages.
pt: Localização para onde o SSSD irá enviar mensagens de registo.

source: <emphasis>stderr</emphasis>: Redirect debug messages to standard error output.
pt: <emphasis>stderr</emphasis>: Redireciona as mensagens de depuração para a saída standard de erro.

source: <emphasis>files</emphasis>: Redirect debug messages to the log files. By default, the log files are stored in <filename>/var/log/sssd</filename> and there are separate log files for every SSSD service and domain.
pt: <emphasis>files</emphasis>: Redireciona as mensagens de depuração para os ficheiros de registo (log). Por predefinição, os ficheiros log são armazenados em <filename>/var/log/sssd</filename> e existem ficheiros log separados para dada serviço e domínio do SSSD.

source: <emphasis>journald</emphasis>: Redirect debug messages to systemd-journald
pt: <emphasis>journald</emphasis>: Redireciona as mensagens de depuração para o journald do systemd

source: Default: not set (fall back to journald if available, otherwise to stderr)
pt: Predefinição: não definida (regressa a journald se disponível, caso contrário para o stderr)

source: Become a daemon after starting up.
pt: Torna-se um daemon após o arranque.

source: Run in the foreground, don't become a daemon.
pt: Corre em primeiro plano, não se torna um daemon.

source: Specify a non-default config file. The default is <filename>/etc/sssd/sssd.conf</filename>. For reference on the config file syntax and options, consult the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
pt: Especifica um ficheiro de configuração não-predefinido. A predefinição é <filename>/etc/sssd/sssd.conf</filename>. Para consulta na sintaxe do ficheiro de configuração e das opções, consulte o manual do <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: Print version number and exit.
pt: Escreve o número da versão e termina.

source: Signals
pt: Sinais

source: Informs the SSSD to gracefully terminate all of its child processes and then shut down the monitor.
pt: Informa o SSSD para graciosamente terminar todos os seus processos filhos e depois desligar o monitor.

source: Tells the SSSD to stop writing to its current debug file descriptors and to close and reopen them. This is meant to facilitate log rolling with programs like logrotate.
pt: Diz ao SSSD para parar de escrever as descrições no seu ficheiro de depuração actual e para fechar e reabrir-lo. Isto destina-se a facilitar a rotação de registos com programas como o logrotate.

source: Tells the SSSD to simulate offline operation for the duration of the <quote>offline_timeout</quote> parameter. This is useful for testing. The signal can be sent to either the sssd process or any sssd_be process directly.
pt: Diz ao SSSD para simular a operação offline na duração do parâmetro <quote>offline_timeout</quote>. Isto é útil para testes. O sinal pode ser enviado seja para o processo sssd ou para qualquer processo sou_sssd directamente.

source: Tells the SSSD to go online immediately. This is useful for testing. The signal can be sent to either the sssd process or any sssd_be process directly.
pt: Diz ao SSSD para ir online imediatamente. Isto é útil para testes. O sinal pode ser enviado seja para o processo sssd ou para qualquer processo sssd_be directamente.

source: Tells the SSSD to reschedule the periodic tasks. The internal watchdog sends this signal to the providers when a clock shift is detected although it can be sent to any sssd_be process directly.
pt: Diz ao SSSD para reagendar as tarefas periódicas. O watchdog interno envia este sinal aos provedores quando é detetada uma mudança de relógio apesar de poder ser enviado a qualquer processo sssd_be diretamente.

source: EXIT STATUS
pt: ESTADO DE SAÍDA

source: SSSD was shutdown gracefully.
pt: O SSSD fechou graciosamente.

source: Bad configuration or command line option.
pt: Configuração ou opção de linha de comandos má.

source: Memory allocation error.
pt: Erro de alocação de memória.

source: SSSD is already running.
pt: O SSSD já está em execução.

source: Other codes
pt: Outros códigos

source: Other codes denote different errors, most probably about missing required access rights. See SSSD and system logs for details.
pt: Outros códigos denotam erros diferentes, mais provavelmente sobre direitos de acesso requeridos em falta. Veja SSSD e logs do sistema para detalhes.

source: If the environment variable SSS_NSS_USE_MEMCACHE is set to "NO", client applications will not use the fast in-memory cache.
pt: Se a variável de ambiente SSS_NSS_USE_MEMCACHE for definida para "NO", as aplicações do cliente não irão usar a rápida cache em-memória.

source: If the environment variable SSS_LOCKFREE is set to "NO", requests from multiple threads of a single application will be serialized.
pt: Se a variável de ambiente SSS_LOCKFREE estiver definida para "NO", os pedidos de vários segmentos de uma única aplicação irão ser dispostos em série.

source: obfuscate a clear text password
pt: ofusca uma palavra passe em texto simples

source: <command>sss_obfuscate</command> <arg choice='opt'> <replaceable>options</replaceable> </arg> <arg choice='plain'><replaceable>[PASSWORD]</replaceable></arg>
pt: <command>sss_obfuscate</command> <arg choice='opt'> <replaceable>opções</replaceable> </arg> <arg choice='plain'><replaceable>[PALAVRA PASSE]</replaceable></arg>

source: <command>sss_obfuscate</command> converts a given password into human-unreadable format and places it into appropriate domain section of the SSSD config file.
pt: <command>sss_obfuscate</command> converte uma palavra passe dada num formato legível por humanos e coloca-a na secção de domínio apropriada do ficheiro de configuração do SSSD.

source: The cleartext password is read from standard input or entered interactively. The obfuscated password is put into <quote>ldap_default_authtok</quote> parameter of a given SSSD domain and the <quote>ldap_default_authtok_type</quote> parameter is set to <quote>obfuscated_password</quote>. Refer to <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more details on these parameters.
pt: A palavra passe em texto simples é lida a partir da entrada standard ou inserida interactivamente. A palavra passe ofuscada é colocada no parâmetro <quote>ldap_default_authtok</quote> de um dado domínio SSSD e o parâmetro <quote>ldap_default_authtok_type</quote> é definido para <quote>obfuscated_password</quote>. Consulte <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais detalhes sobre estes parâmetros.

source: Please note that obfuscating the password provides <emphasis>no real security benefit</emphasis> as it is still possible for an attacker to reverse-engineer the password back. Using better authentication mechanisms such as client side certificates or GSSAPI is <emphasis>strongly</emphasis> advised.
pt: Por favor note que ofuscar a palavra passe não fornece <emphasis>nenhum benefício de segurança real</emphasis> pois é ainda possível a um atacante fazer engenharia-reversa na palavra passe. Usar melhores mecanismos de segurança tais como certificados no lado cliente ou GSSAPI é <emphasis>fortemente</emphasis> recomendado.

source: The password to obfuscate will be read from standard input.
pt: A palavra passe a ofuscar será lida a partir da entrada standard.

source: <option>-d</option>,<option>--domain</option> <replaceable>DOMAIN</replaceable>
pt: <option>-d</option>,<option>--domain</option> <replaceable>DOMÍNIO</replaceable>

source: The SSSD domain to use the password in. The default name is <quote>default</quote>.
pt: O domínio SSSD a onde usar a palavra passe. O nome predefinido é <quote>default</quote>.

source: <option>-f</option>,<option>--file</option> <replaceable>FILE</replaceable>
pt: <option>-f</option>,<option>--file</option> <replaceable>FICHEIRO</replaceable>

source: Read the config file specified by the positional parameter.
pt: Lê o ficheiro de configuração especificado pelo parâmetro posicional.

source: Default: <filename>/etc/sssd/sssd.conf</filename>
pt: Predefinição: <filename>/etc/sssd/sssd.conf</filename>

source: create local overrides of user and group attributes
pt: cria sobreposições locais de atributos de utilizador e grupo

source: <command>sss_override</command> <arg choice='plain'><replaceable>COMMAND</replaceable></arg> <arg choice='opt'> <replaceable>options</replaceable> </arg>
pt: <command>sss_override</command> <arg choice='plain'><replaceable>COMANDO</replaceable></arg> <arg choice='opt'> <replaceable>opções</replaceable> </arg>

source: <command>sss_override</command> enables to create a client-side view and allows to change selected values of specific user and groups. This change takes effect only on local machine.
pt: <command>sss_override</command> permite criar uma vista do lado cliente e permite modificar os valores selecionados de utilizadores e grupos específicos. Esta alteração só tem efeito em maquinas locais.

source: Overrides data are stored in the SSSD cache. If the cache is deleted, all local overrides are lost. Please note that after the first override is created using any of the following <emphasis>user-add</emphasis>, <emphasis>group-add</emphasis>, <emphasis>user-import</emphasis> or <emphasis>group-import</emphasis> command. SSSD needs to be restarted to take effect. <emphasis>sss_override</emphasis> prints message when a restart is required.
pt: Os dados de sobreposição são guardados na cache do SSSD. Se a cache for apagada, todas as sobreposições locais são perdidas. Por favor note que após a primeira sobreposição ser criada usando qualquer dos seguintes comandos <emphasis>user-add</emphasis>, <emphasis>group-add</emphasis>, <emphasis>user-import</emphasis> ou <emphasis>group-import</emphasis>, o SSSD precisa de ser reiniciado para tomar efeito. O <emphasis>sss_override</emphasis> escreve mensagens quando é necessário ser reiniciado.

source: <emphasis>NOTE:</emphasis> The options provided in this man page only work with <quote>ldap</quote> and <quote>AD</quote> <quote> id_provider</quote>. IPA overrides can be managed centrally on the IPA server.
pt: <emphasis>NOTA:</emphasis> As opções disponibilizadas neste manual apenas funcionam com <quote>ldap</quote> e <quote>AD</quote> <quote> id_provider</quote>. As sobreposições IPA podem ser geridas centralmente no servidor IPA.

source: AVAILABLE COMMANDS
pt: COMANDOS DISPONÍVEIS

source: Argument <emphasis>NAME</emphasis> is the name of original object in all commands. It is not possible to override <emphasis>uid</emphasis> or <emphasis>gid</emphasis> to 0.
pt: O argumento <emphasis>NOME</emphasis> é o nome do objecto original em todos os comandos. Não é possível sobrepor <emphasis>uid</emphasis> ou <emphasis>gid</emphasis> para 0.

source: <option>user-add</option> <emphasis>NAME</emphasis> <optional><option>-n,--name</option> NAME</optional> <optional><option>-u,--uid</option> UID</optional> <optional><option>-g,--gid</option> GID</optional> <optional><option>-h,--home</option> HOME</optional> <optional><option>-s,--shell</option> SHELL</optional> <optional><option>-c,--gecos</option> GECOS</optional> <optional><option>-x,--certificate</option> BASE64 ENCODED CERTIFICATE</optional>
pt: <option>user-add</option> <emphasis>NOME</emphasis> <optional><option>-n,--name</option> NOME</optional> <optional><option>-u,--uid</option> UID</optional> <optional><option>-g,--gid</option> GID</optional> <optional><option>-h,--home</option> HOME</optional> <optional><option>-s,--shell</option> SHELL</optional> <optional><option>-c,--gecos</option> GECOS</optional> <optional><option>-x,--certificate</option> CERTIFICADO CODIFICADO EM BASE64</optional>

source: Override attributes of an user. Please be aware that calling this command will replace any previous override for the (NAMEd) user.
pt: Sobrepõe atributos de um utilizador. Por favor tenha atenção que chamar este comando irá substituir quaisquer sobreposição anterior para o utilizador (NOMEado).

source: <option>user-del</option> <emphasis>NAME</emphasis>
pt: <option>user-del</option> <emphasis>NOME</emphasis>

source: Remove user overrides. However be aware that overridden attributes might be returned from memory cache. Please see SSSD option <emphasis>memcache_timeout</emphasis> for more details.
pt: Remove sobreposições do utilizador. No entanto tenha atenção que atributos sobrepostos podem ser retornados da cache de memória. Por favor veja a opção do SSSD <emphasis>memcache_timeout</emphasis> para mais detalhes.

source: <option>user-find</option> <optional><option>-d,--domain</option> DOMAIN</optional>
pt: <option>user-find</option> <optional><option>-d,--domain</option> DOMÍNIO</optional>

source: List all users with set overrides. If <emphasis>DOMAIN</emphasis> parameter is set, only users from the domain are listed.
pt: Lista todos os utilizadores com sobreposições de definição. Se o parâmetro <emphasis>DOMAIN</emphasis> estiver definido, são listados apenas utilizadores desse domínio.

source: <option>user-show</option> <emphasis>NAME</emphasis>
pt: <option>user-show</option> <emphasis>NOME</emphasis>

source: Show user overrides.
pt: Mostra sobreposições do utilizador.

source: <option>user-import</option> <emphasis>FILE</emphasis>
pt: <option>user-import</option> <emphasis>FICHEIRO</emphasis>

source: Import user overrides from <emphasis>FILE</emphasis>. Data format is similar to standard passwd file. The format is:
pt: Importa sobreposições de utilizador de <emphasis>FICHEIRO</emphasis>. O formato de dados é semelhante ao ficheiro passwd standard. O formato é:

source: where original_name is original name of the user whose attributes should be overridden. The rest of fields correspond to new values. You can omit a value simply by leaving corresponding field empty.
pt: onde original_name é o nome original do utilizador cujos atributos devem ser sobrepostos. O resto dos campos correspondem a novos valores. Você pode omitir um valor simplesmente ao deixar o campo correspondente vazio.

source: <option>user-export</option> <emphasis>FILE</emphasis>
pt: <option>user-export</option> <emphasis>FICHEIRO</emphasis>

source: Export all overridden attributes and store them in <emphasis>FILE</emphasis>. See <emphasis>user-import</emphasis> for data format.
pt: Exporta todos os atributos de sobreposição e guarda-os em <emphasis>FICHEIRO</emphasis>. Veja <emphasis>user-import</emphasis> para o formato de dados.

source: <option>group-add</option> <emphasis>NAME</emphasis> <optional><option>-n,--name</option> NAME</optional> <optional><option>-g,--gid</option> GID</optional>
pt: <option>group-add</option> <emphasis>NOME</emphasis> <optional><option>-n,--name</option> NOME</optional> <optional><option>-g,--gid</option> GID</optional>

source: Override attributes of a group. Please be aware that calling this command will replace any previous override for the (NAMEd) group.
pt: Sobrepõe atributos de um grupo Por favor tenha atenção que chamar este comando irá substituir quaisquer sobreposição anterior para o grupo (NOMEado).

source: <option>group-del</option> <emphasis>NAME</emphasis>
pt: <option>group-del</option> <emphasis>NOME</emphasis>

source: Remove group overrides. However be aware that overridden attributes might be returned from memory cache. Please see SSSD option <emphasis>memcache_timeout</emphasis> for more details.
pt: Remove sobreposições do grupo. No entanto tenha atenção que atributos sobrepostos podem ser retornados da cache de memória. Por favor veja a opção do SSSD <emphasis>memcache_timeout</emphasis> para mais detalhes.

source: <option>group-find</option> <optional><option>-d,--domain</option> DOMAIN</optional>
pt: <option>group-find</option> <optional><option>-d,--domain</option> DOMÍNIO</optional>

source: List all groups with set overrides. If <emphasis>DOMAIN</emphasis> parameter is set, only groups from the domain are listed.
pt: Lista todos os grupos com sobreposições de definição. Se o parâmetro <emphasis>DOMAIN</emphasis> estiver definido, são listados apenas grupos desse domínio.

source: <option>group-show</option> <emphasis>NAME</emphasis>
pt: <option>group-show</option> <emphasis>NOME</emphasis>

source: Show group overrides.
pt: Mostra sobreposições do grupo.

source: <option>group-import</option> <emphasis>FILE</emphasis>
pt: <option>group-import</option> <emphasis>FICHEIRO</emphasis>

source: Import group overrides from <emphasis>FILE</emphasis>. Data format is similar to standard group file. The format is:
pt: Importa sobreposições de grupo de <emphasis>FICHEIRO</emphasis>. O formato de dados é semelhante ao ficheiro group standard. O formato é:

source: where original_name is original name of the group whose attributes should be overridden. The rest of fields correspond to new values. You can omit a value simply by leaving corresponding field empty.
pt: onde original_name é o nome original do grupo cujos atributos devem ser sobrepostos. O resto dos campos correspondem a novos valores. Você pode omitir um valor simplesmente ao deixar o campo correspondente vazio.

source: <option>group-export</option> <emphasis>FILE</emphasis>
pt: <option>group-export</option> <emphasis>FICHEIRO</emphasis>

source: Export all overridden attributes and store them in <emphasis>FILE</emphasis>. See <emphasis>group-import</emphasis> for data format.
pt: Exporta todos os atributos de sobreposição e guarda-os em <emphasis>FICHEIRO</emphasis>. Veja <emphasis>group-import</emphasis> para o formato de dados.

source: COMMON OPTIONS
pt: OPÇÕES COMUNS

source: Those options are available with all commands.
pt: Estas opções estão disponíveis com todos os comandos.

source: <option>--debug</option> <replaceable>LEVEL</replaceable>
pt: <option>--debug</option> <replaceable>NÍVEL</replaceable>

source: SSSD Kerberos provider
pt: Provedor Kerberos do SSSD

source: This manual page describes the configuration of the Kerberos 5 authentication backend for <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. For a detailed syntax reference, please refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
pt: Este manual descreve a configuração do backend de autenticação Kerberos 5 para <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Para uma referência detalhada da sintaxe, consulte a secção <quote>FORMATO DE FICHEIRO</quote> do manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: The Kerberos 5 authentication backend contains auth and chpass providers. It must be paired with an identity provider in order to function properly (for example, id_provider = ldap). Some information required by the Kerberos 5 authentication backend must be provided by the identity provider, such as the user's Kerberos Principal Name (UPN). The configuration of the identity provider should have an entry to specify the UPN. Please refer to the man page for the applicable identity provider for details on how to configure this.
pt: O backend de autenticação Kerberos 5 contém provedores auth e chpass. Tem de ser pareado com um provedor de identidade de modo a funcionar correctamente (por exemplo, id_provider = ldap). Alguma informação requerida pelo backend de autenticação Kerberos 5 tem de ser fornecida pelo provedor de identidade, tal como o Kerberos Principal Name (UPN) do utilizador. A configuração do provedor de identidade deve ter uma entrada para especificar o UPN. Por favor consulte o manual do provedor de identidade aplicado para detalhes sobre como configurar isto.

source: This backend also provides access control based on the .k5login file in the home directory of the user. See <citerefentry> <refentrytitle>k5login</refentrytitle><manvolnum>5</manvolnum> </citerefentry> for more details. Please note that an empty .k5login file will deny all access to this user. To activate this feature, use 'access_provider = krb5' in your SSSD configuration.
pt: Este backend também fornece controle de acesso baseado no ficheiro .k5login no directório home do utilizador. Veja <citerefentry> <refentrytitle>k5login</refentrytitle><manvolnum>5</manvolnum> </citerefentry> para mais detalhes. Por favor note que um ficheiro .k5login vazio irá negar todo o acesso a este utilizador. Para activar esta funcionalidade, use 'access_provider = krb5' na sua configuração do SSSD.

source: In the case where the UPN is not available in the identity backend, <command>sssd</command> will construct a UPN using the format <replaceable>username</replaceable>@<replaceable>krb5_realm</replaceable>.
pt: Em casos onde o UPN não está disponível no backend de identidade, o <command>sssd</command> irá construir um UPN usando o formato <replaceable>nome-utilizador</replaceable>@<replaceable>krb5_realm</replaceable>.

source: Specifies the comma-separated list of IP addresses or hostnames of the Kerberos servers to which SSSD should connect, in the order of preference. For more information on failover and server redundancy, see the <quote>FAILOVER</quote> section. An optional port number (preceded by a colon) may be appended to the addresses or hostnames. If empty, service discovery is enabled; for more information, refer to the <quote>SERVICE DISCOVERY</quote> section.
pt: Especifica a lista separada por vírgulas de endereços IP ou nomes de máquinas dos servidores Kerberos aos quais o SSSD deve ligar, pela ordem de preferência. Para mais informação sobre failover e redundância de servidores, veja a secção <quote>FAILOVER</quote>. Um número de porto adicional (com dois pontos a preceder) pode ser acrescentado aos endereços ou nomes de máquinas. Se vazia, é activada a descoberta de serviços; para mais informação, consulte a secção <quote>DESCOBERTA DE SERVIÇOS</quote>.

source: The name of the Kerberos realm. This option is required and must be specified.
pt: O nome do reino Kerberos. Esta opção é requerida e tem de ser especificada.

source: If the change password service is not running on the KDC, alternative servers can be defined here. An optional port number (preceded by a colon) may be appended to the addresses or hostnames.
pt: Se o serviço de mudança de palavra passe não estiver a correr no KDC, podem ser definidos aqui servidores alternativos. Pode ser acrescentado um número de porto opcional (precedido pelo caractere dois pontos) aos endereços ou nomes de máquinas.

source: For more information on failover and server redundancy, see the <quote>FAILOVER</quote> section. NOTE: Even if there are no more kpasswd servers to try, the backend is not switched to operate offline if authentication against the KDC is still possible.
pt: Para mais informação sobre failover e redundância de servidores, veja a secção <quote>FAILOVER</quote>. NOTA: Mesmo que não existam mais servidores kpasswd para tentar, o backend não é comutado para operar offline se a autenticação contra o KDC ainda for possível.

source: Default: Use the KDC
pt: Predefinição: Usar o KDC
