Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: <option>-n</option>,<option>--username</option> <replaceable>USER</replaceable>
pt: <option>-n</option>,<option>--username</option> <replaceable>UTILIZADOR</replaceable>

source: The username of the entry to be created or modified in the cache. The <replaceable>USER</replaceable> option must be provided.
pt: O nome de utilizador da entrada a ser criada ou modificada na cache. A opção <replaceable>UTILIZADOR</replaceable> tem de ser fornecida.

source: Set the UID of the user to <replaceable>UID</replaceable>.
pt: Define o UID do utilizador para <replaceable>UID</replaceable>.

source: Set the GID of the user to <replaceable>GID</replaceable>.
pt: Define o GID do utilizador para <replaceable>GID</replaceable>.

source: <option>-c</option>,<option>--gecos</option> <replaceable>COMMENT</replaceable>
pt: <option>-c</option>,<option>--gecos</option> <replaceable>COMENTÁRIO</replaceable>

source: Any text string describing the user. Often used as the field for the user's full name.
pt: Qualquer string de texto que descreva o utilizador. Muitas vezes usado como o campo para o nome completo do utilizador.

source: <option>-h</option>,<option>--home</option> <replaceable>HOME_DIR</replaceable>
pt: <option>-h</option>,<option>--home</option> <replaceable>DIRECTÓRIO_HOME</replaceable>

source: Set the home directory of the user to <replaceable>HOME_DIR</replaceable>.
pt: Define o directório home do utilizador para <replaceable>DIRECTÓRIO_HOME</replaceable>.

source: Set the login shell of the user to <replaceable>SHELL</replaceable>.
pt: Define a shell de login do utilizador para <replaceable>SHELL</replaceable>.

source: Interactive mode for entering user information. This option will only prompt for information not provided in the options or retrieved from the domain.
pt: Modo interactivo para inserir informação do utilizador. Esta opção apenas irá pedir informação não fornecida nas opções ou obtida a partir do domínio.

source: <option>-p</option>,<option>--password-file</option> <replaceable>PASS_FILE</replaceable>
pt: <option>-p</option>,<option>--password-file</option> <replaceable>FICHEIRO-PASSE</replaceable>

source: Specify file to read user's password from. (if not specified password is prompted for)
pt: Especifica o ficheiro de onde ler a palavra passe do utilizador. (se não for especificado é incitada uma palavra passe)

source: The length of the password (or the size of file specified with -p or --password-file option) must be less than or equal to PASS_MAX bytes (64 bytes on systems with no globally-defined PASS_MAX value).
pt: O comprimento da palavra passe (ou o tamanho do ficheiro especificado com opção -p ou --password-file) tem de ser menor ou igual a PASS_MAX bytes (64 bytes em sistemas sem um valor PASS_MAX globalmente definido).

source: SSSD InfoPipe responder
pt: Respondedor InfoPipe do SSSD

source: This manual page describes the configuration of the InfoPipe responder for <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. For a detailed syntax reference, refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
pt: Este manual descreve a configuração do respondedor InfoPipe para <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. para uma referência detalhada de sintaxe, consulte a secção <quote>FORMATO DE FICHEIRO</quote> do manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: The InfoPipe responder provides a public D-Bus interface accessible over the system bus. The interface allows the user to query information about remote users and groups over the system bus.
pt: O respondedor InfoPipe fornece uma interface D-Bus pública acessível pelo barramento do sistema. A interface permite ao utilizador questionar informação acerca de utilizadores e grupos remotos pelo barramento do sistema.

source: FIND BY VALID CERTIFICATE
pt: PROCURA POR CERTIFICADO VÁLIDO

source: The following options can be used to control how the certificates are validated when using the FindByValidCertificate() API:
pt: As seguintes opções podem ser usadas para controlar como os certificados são validados quando se usa a API FindByValidCertificate():

source: For more details about the options see <citerefentry><refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry>.
pt: Para mais detalhes sobre as opções veja <citerefentry><refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry>.

source: These options can be used to configure the InfoPipe responder.
pt: Estas opções podem ser usadas para configurar o respondedor InfoPipe.

source: Specifies the comma-separated list of UID values or user names that are allowed to access the InfoPipe responder. User names are resolved to UIDs at startup.
pt: Especifica a lista de valores UID ou nomes de utilizador separados por vírgulas que têm permissão de acesso ao respondedor InfoPipe. Os nomes de utilizadores são resolvidos em UIDs no arranque.

source: Default: 0 (only the root user is allowed to access the InfoPipe responder)
pt: Predefinição: 0 (apenas o utilizador root ter permissão de acesso ao respondedor do InfoPipe)

source: Please note that although the UID 0 is used as the default it will be overwritten with this option. If you still want to allow the root user to access the InfoPipe responder, which would be the typical case, you have to add 0 to the list of allowed UIDs as well.
pt: Por favor note que apesar do UID 0 ser usado como predefinição irá ser sobreposto por esta opção. Se você ainda quiser permitir ao utilizador root ter acesso ao respondedor InfoPipe, o que será um caso típico, você também tem de adicionar 0 à lista de UIDs permitidos.

source: user's login name
pt: nome de login do utilizador

source: user ID
pt: ID do utilizador

source: primary group ID
pt: ID do grupo principal

source: user information, typically full name
pt: informação do utilizador, tipicamente o nome completo

source: user shell
pt: shell do utilizador

source: Default: not set. Only the default set of POSIX attributes is allowed.
pt: Predefinição: não definida. Apenas o conjunto predefinido de atributos POSIX é permitido.

source: Specifies an upper limit on the number of entries that are downloaded during a wildcard lookup that overrides caller-supplied limit.
pt: Especifica o limite máximo do número de entradas que são descarregadas durante uma procura de wildcard que sobrepõe o limite fornecido-ao-chamador.

source: Default: 0 (let the caller set an upper limit)
pt: Predefinição: 0 (deixa o chamador definir um limite superior)

source: sss plugin configuration directives for rpc.idmapd
pt: Diretivas de configuração do plugin sss para rpc.idmapd

source: CONFIGURATION FILE
pt: FICHEIRO DE CONFIGURAÇÃO

source: rpc.idmapd configuration file is usually found at <emphasis>/etc/idmapd.conf</emphasis>. See <citerefentry> <refentrytitle>idmapd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information.
pt: O ficheiro de configuração rpc.idmapd é geralmente encontrado em <emphasis>/etc/idmapd.conf</emphasis>. Veja <citerefentry> <refentrytitle>idmapd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação.

source: SSS CONFIGURATION EXTENSION
pt: EXTENSÃO DE CONFIGURAÇÃO DO SSS

source: Enable SSS plugin
pt: Activar o plugin SSS

source: In section <quote>[Translation]</quote>, modify/set <quote>Method</quote> attribute to contain <emphasis>sss</emphasis>.
pt: Na secção <quote>[Translation]</quote>, modifique/defina o atributo <quote>Method</quote> para conter <emphasis>sss</emphasis>.

source: [sss] config section
pt: secção de configuração [sss]

source: In order to change the default of one of the configuration attributes of the <emphasis>sss</emphasis> plugin listed below you will need to create a config section for it, named <quote>[sss]</quote>.
pt: De modo a alterar a predefinição de um dos atributos de configuração do plugin <emphasis>sss</emphasis> listado em baixo você precisa de criar uma secção de configuração para isso, chamada <quote>[sss]</quote>.

source: Configuration attributes
pt: Atributos de configuração

source: memcache (bool)
pt: memcache (booleano)

source: Indicates whether or not to use memcache optimisation technique.
pt: Indica se deve-se ou não usar a técnica de optimização memcache.

source: SSSD INTEGRATION
pt: INTEGRAÇÃO DO SSSD

source: The sss plugin requires the <emphasis>NSS Responder</emphasis> to be enabled in sssd.
pt: O plugin sss requer o <emphasis>NSS Responder</emphasis> para ser activo em sssd.

source: The attribute <quote>use_fully_qualified_names</quote> must be enabled on all domains (NFSv4 clients expect a fully qualified name to be sent on the wire).
pt: O atributo <quote>use_fully_qualified_names</quote> tem de ser activado em todos os domínios (os clientes NFSv4 esperam que um nome totalmente qualificado seja enviado pelos fios).

source: The following example shows a minimal idmapd.conf which makes use of the sss plugin. <placeholder type="programlisting" id="0"/>
pt: O seguinte exemplo mostra um idmapd.conf mínimo que faz uso do plugin sss. <placeholder type="programlisting" id="0"/>

source: SEE ALSO
pt: VEJA TAMBÉM

source: get OpenSSH authorized keys
pt: obter chaves autorizadas do OpenSSH

source: <command>sss_ssh_authorizedkeys</command> <arg choice='opt'> <replaceable>options</replaceable> </arg> <arg choice='plain'><replaceable>USER</replaceable></arg>
pt: <command>sss_ssh_authorizedkeys</command> <arg choice='opt'> <replaceable>options</replaceable> </arg> <arg choice='plain'><replaceable>UTILIZADOR</replaceable></arg>

source: <command>sss_ssh_authorizedkeys</command> acquires SSH public keys for user <replaceable>USER</replaceable> and outputs them in OpenSSH authorized_keys format (see the <quote>AUTHORIZED_KEYS FILE FORMAT</quote> section of <citerefentry><refentrytitle>sshd</refentrytitle> <manvolnum>8</manvolnum></citerefentry> for more information).
pt: O <command>sss_ssh_authorizedkeys</command> adquire chaves públicas SSH para o utilizador <replaceable>UTILIZADOR</replaceable> e coloca-as em formato authorized_keys de OpenSSH (veja a secção <quote>FORMATO DE FICHEIRO AUTHORIZED_KEYS</quote> do <citerefentry><refentrytitle>sshd</refentrytitle> <manvolnum>8</manvolnum></citerefentry> para mais informação).

source: <citerefentry><refentrytitle>sshd</refentrytitle> <manvolnum>8</manvolnum></citerefentry> can be configured to use <command>sss_ssh_authorizedkeys</command> for public key user authentication if it is compiled with support for <quote>AuthorizedKeysCommand</quote> option. Please refer to the <citerefentry> <refentrytitle>sshd_config</refentrytitle> <manvolnum>5</manvolnum></citerefentry> man page for more details about this option.
pt: O <citerefentry><refentrytitle>sshd</refentrytitle> <manvolnum>8</manvolnum></citerefentry> pode ser configurado para usar <command>sss_ssh_authorizedkeys</command> para autenticação de utilizador por chave pública se for compilado com suporte para a opção <quote>AuthorizedKeysCommand</quote>. Por favor consulte o manual <citerefentry> <refentrytitle>sshd_config</refentrytitle> <manvolnum>5</manvolnum></citerefentry> para mais detalhes acerca desta opção.

source: If <quote>AuthorizedKeysCommand</quote> is supported, <citerefentry><refentrytitle>sshd</refentrytitle> <manvolnum>8</manvolnum></citerefentry> can be configured to use it by putting the following directives in <citerefentry> <refentrytitle>sshd_config</refentrytitle> <manvolnum>5</manvolnum></citerefentry>: <placeholder type="programlisting" id="0"/>
pt: Se <quote>AuthorizedKeysCommand</quote> for suportado, o <citerefentry><refentrytitle>sshd</refentrytitle> <manvolnum>8</manvolnum></citerefentry> pode ser configurado para o usar ao colocar as seguintes diretivas em <citerefentry> <refentrytitle>sshd_config</refentrytitle> <manvolnum>5</manvolnum></citerefentry>: <placeholder type="programlisting" id="0"/>

source: KEYS FROM CERTIFICATES
pt: CHAVES A PARTIR DE CERTIFICADOS

source: In addition to the public SSH keys for user <replaceable>USER</replaceable> <command>sss_ssh_authorizedkeys</command> can return public SSH keys derived from the public key of a X.509 certificate as well.
pt: Adicionalmente às chaves SSH públicas para o utilizador <replaceable>UTILIZADOR</replaceable> o <command>sss_ssh_authorizedkeys</command> também pode retornar chaves SSH públicas derivadas da chave pública de um certificado X.509.

source: To enable this the <quote>ssh_use_certificate_keys</quote> option must be set to true (default) in the [ssh] section of <filename>sssd.conf</filename>. If the user entry contains certificates (see <quote>ldap_user_certificate</quote> in <citerefentry><refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum></citerefentry> for details) or there is a certificate in an override entry for the user (see <citerefentry><refentrytitle>sss_override</refentrytitle> <manvolnum>8</manvolnum></citerefentry> or <citerefentry><refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum></citerefentry> for details) and the certificate is valid SSSD will extract the public key from the certificate and convert it into the format expected by sshd.
pt: Para activar isto a opção <quote>ssh_use_certificate_keys</quote> tem de ser definida para true (predefinição) na secção [ssh] do <filename>sssd.conf</filename>. Se a entrada do utilizador conter certificados (veja <quote>ldap_user_certificate</quote> em <citerefentry><refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum></citerefentry> para detalhes) ou existir um certificado numa entrada de sobreposição para o utilizador (veja <citerefentry><refentrytitle>sss_override</refentrytitle> <manvolnum>8</manvolnum></citerefentry> ou <citerefentry><refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum></citerefentry> para detalhes) e o certificado for válido, o SSSD irá extrair a chave pública a partir do certificado e converte-lo num formato esperado pelo sshd.

source: Besides <quote>ssh_use_certificate_keys</quote> the options
pt: Além de <quote>ssh_use_certificate_keys</quote> as opções

source: can be used to control how the certificates are validated (see <citerefentry><refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> for details).
pt: pode ser usadas para controlar como o certificados são validados (veja <citerefentry><refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> para detalhes).

source: The validation is the benefit of using X.509 certificates instead of SSH keys directly because e.g. it gives a better control of the lifetime of the keys. When the ssh client is configured to use the private keys from a Smartcard with the help of a PKCS#11 shared library (see <citerefentry><refentrytitle>ssh</refentrytitle> <manvolnum>1</manvolnum></citerefentry> for details) it might be irritating that authentication is still working even if the related X.509 certificate on the Smartcard is already expired because neither <command>ssh</command> nor <command>sshd</command> will look at the certificate at all.
pt: A validação é o benefício de se usar certificados X.509 em vez de chaves SSH directamente porque, ex., oferece um melhor controle do tempo de vida das chaves. Quando o cliente ssh é configurado para usar as chaves privadas de uma Smartcard com a ajuda de uma biblioteca partilhada PKCS#11 (veja <citerefentry><refentrytitle>ssh</refentrytitle> <manvolnum>1</manvolnum></citerefentry> para detalhes) pode ser irritante ver a autenticação ainda a funcionar mesmo que o certificado X.509 relacionado na Smartcard esteja já expirado porque nem o <command>ssh</command> nem o <command>sshd</command> irá olhar sequer olhar para o certificado.

source: It has to be noted that the derived public SSH key can still be added to the <filename>authorized_keys</filename> file of the user to bypass the certificate validation if the <command>sshd</command> configuration permits this.
pt: Tem de ser notado que a chave SSH pública derivada pode ainda ser adicionada ao ficheiro <filename>authorized_keys</filename> do utilizador ao contornar a validação do certificado se a configuração do <command>sshd</command> permitir isto.

source: Search for user public keys in SSSD domain <replaceable>DOMAIN</replaceable>.
pt: Procura por chaves públicas de utilizador em domínio SSSD <replaceable>DOMÍNIO</replaceable>.

source: In case of success, an exit value of 0 is returned. Otherwise, 1 is returned.
pt: Em caso de sucesso, é retornado um valor de saída de 0. Caso contrário, é retornado 1.

source: get OpenSSH known hosts public keys
pt: obtém chaves públicas OpenSSH de máquinas conhecidas

source: <command>sss_ssh_knownhosts</command> <arg choice='opt'> <replaceable>options</replaceable> </arg> <arg choice='plain'><replaceable>HOST</replaceable></arg>
pt: <command>sss_ssh_knownhosts</command> <arg choice='opt'> <replaceable>opções</replaceable> </arg> <arg choice='plain'><replaceable>MÁQUINA</replaceable></arg>

source: <command>sss_ssh_knownhosts</command> acquires SSH public keys for host <replaceable>HOST</replaceable> and outputs them in OpenSSH known_hosts key format (see the <quote>SSH_KNOWN_HOSTS FILE FORMAT</quote> section of <citerefentry><refentrytitle>sshd</refentrytitle> <manvolnum>8</manvolnum></citerefentry> for more information).
pt: <command>sss_ssh_knownhosts</command> adquire chaves públicas SSH para máquina <replaceable>MÁQUINA</replaceable> e gera-as em formato de chave known_hosts do OpenSSH (veja a secção <quote>FORMATO DE FICHEIRO SSH_KNOWN_HOSTS</quote> do <citerefentry><refentrytitle>sshd</refentrytitle> <manvolnum>8</manvolnum></citerefentry> para mais informação).

source: <citerefentry><refentrytitle>ssh</refentrytitle> <manvolnum>1</manvolnum></citerefentry> can be configured to use <command>sss_ssh_knownhosts</command> for public key host authentication using the <quote>KnownHostsCommand</quote> option: <placeholder type="programlisting" id="0"/> Please refer to the <citerefentry> <refentrytitle>ssh_config</refentrytitle><manvolnum>5</manvolnum> </citerefentry> man page for more details about this option.
pt: <citerefentry><refentrytitle>ssh</refentrytitle> <manvolnum>1</manvolnum></citerefentry> pode ser configurado para usar <command>sss_ssh_knownhosts</command> para autenticação de máquina de chave pública usando a opção <quote>KnownHostsCommand</quote>: <placeholder type="programlisting" id="0"/> Por favor consulte o manual <citerefentry> <refentrytitle>ssh_config</refentrytitle><manvolnum>5</manvolnum> </citerefentry> para mais detalhes acerca desta opção.

source: This tool requires that SSSD's ssh service is enabled to work properly.
pt: Esta ferramenta requer que o serviço ssh do SSSD esteja ativo para funcionar de modo apropriado.

source: Search for host public keys in SSSD domain <replaceable>DOMAIN</replaceable>.
pt: Procura por chaves públicas da máquina no domínio do SSSD <replaceable>DOMÍNIO</replaceable>.

source: When the keys retrieved from the backend do not include the hostname, this tool will add the unmodified hostname as provided by the caller. If this flag is set, only the hostname (no port number) will be added to the keys.
pt: Quando as chaves obtidas do backend não incluem o nome de máquina, esta ferramenta irá adicionar o nome de máquina não modificado como fornecido pelo chamador. Se esta bandeira estiver definida, apenas o nome de máquina (nenhum número de porto) será adicionado às chaves.

source: KEY RETRIEVAL
pt: OBTENÇÃO DE CHAVE

source: The key lines retrieved from the backend are expected to respect the key format as decribed in the <quote>SSH_KNOWN_HOSTS FILE FORMAT</quote> section of <citerefentry><refentrytitle>sshd</refentrytitle> <manvolnum>8</manvolnum></citerefentry>. However, returning only the keytype and the key itself is tolerated, in which case, the hostname received as parameter will be added before the keytype to output a correctly formatted line. The hostname will be added unmodified or just the hostname (no port number), depending on whether the <option>-o</option>,<option>--only-host-name</option> option was provided.
pt: As linhas de chave obtidas a partir do backend são esperadas que respeitem o formato de chave descrito na secção <quote>FORMATO DE FICHEIRO SSH_KNOWN_HOSTS </quote> do <citerefentry><refentrytitle>sshd</refentrytitle> <manvolnum>8</manvolnum></citerefentry>. No entanto, retornar apenas o tipo de chave e a própria chave é tolerado, que no caso, o nome de máquina recebido como parâmetro será adicionado antes do tipo de chave para resultar numa linha formatada corretamente. O nome de máquina será adicionado não modificado apenas o nome de máquina (nenhum número de porto), dependendo de se a opção <option>-o</option>,<option>--only-host-name</option> foi fornecida.

source: When the SSH server is listening on a non-default port, the backend MUST provide the hostname including the port number in the correct format and position as part of the key line. For example, the minimal key line would be: <placeholder type="programlisting" id="0"/>
pt: Quando o servidor SSH está a escutar num porto não-predefinido, o backend TEM DE fornecer o nome de máquina incluindo o número de porto no formato e posição corretos como parte da linha de chave. Por exemplo, a linha de chave mínima seria: <placeholder type="programlisting" id="0"/>

source: In case of successful execution, even if no key was found for that host or if the ssh responder could not be contacted, 0 is returned. 1 is returned in case of any other error.
pt: No caso de execução com sucesso, mesmo que nenhuma chave seja encontrada para essa máquina ou se o respondedor ssh não possa ser contactado, é retornado 0. É retornado 1 em caso qualquer outro erro.

source: SSSD's idmap_sss Backend for Winbind
pt: Backend idmap_sss do SSSD para Winbind

source: The idmap_sss module provides a way to call SSSD to map UIDs/GIDs and SIDs. No database is required in this case as the mapping is done by SSSD.
pt: O módulo idmap_sss fornece uma maneira de chamar o SSSD para mapear UIDs/GIDs e SIDs. Nenhuma base de dados é requerida neste caso pois o mapeamento é feito pelo SSSD.

source: IDMAP OPTIONS
pt: OPÇÕES DE IDMAP

source: Defines the available matching UID and GID range for which the backend is authoritative.
pt: Define a gama de UID e GID correspondente disponível para a qual o backend é autoridade.

source: This example shows how to configure idmap_sss as the default mapping module.
pt: Este exemplo mostra como configurar o idmap_sss como o módulo de mapeamento predefinido.

source: Please replace &lt;AD-DOMAIN-SHORTNAME&gt; with the NetBIOS domain name of the AD domain. If multiple AD domains should be used each domain needs an <literal>idmap config</literal> line with <literal>backend = sss</literal> and a line with a suitable <literal>range</literal>.
pt: Por favor substitua &lt;AD-DOMAIN-SHORTNAME&gt; pelo nome de domínio NetBIOS do domínio AD. Se devem ser usados múltiplos domínios AD cada domínio precisa de uma linha <literal>idmap config</literal> com <literal>backend = sss</literal> e uma linha com um <literal>range</literal> apropriado.

source: Since Winbind requires a writeable default backend and idmap_sss is read-only the example includes <literal>backend = tdb</literal> as default.
pt: Como o Winbind requer um backend predefinido com acesso de escrita e o idmap_sss é de só-leitura o exemplo inclui <literal>backend = tdb</literal> como predefinição.

source: SSSD control and status utility
pt: Utilitário de controle e estado do SSSD
