Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: <command>sssctl</command> <arg choice='plain'><replaceable>COMMAND</replaceable></arg> <arg choice='opt'> <replaceable>options</replaceable> </arg>
pt: <command>sssctl</command> <arg choice='plain'><replaceable>COMANDO</replaceable></arg> <arg choice='opt'> <replaceable>opções</replaceable> </arg>

source: <command>sssctl</command> provides a simple and unified way to obtain information about SSSD status, such as active server, auto-discovered servers, domains and cached objects. In addition, it can manage SSSD data files for troubleshooting in such a way that is safe to manipulate while SSSD is running.
pt: O <command>sssctl</command> fornece uma maneira simples e unificada de obter informação acerca do estado do SSSD, tal como o servidor activo, servidores auto-descobertos, domínios e objectos em cache. Adicionalmente, pode gerir ficheiros de dados do SSSD para resolução de problemas de tal maneira que é seguro manipula-los enquanto o SSSD está a correr.

source: To list all available commands run <command>sssctl</command> without any parameters. To print help for selected command run <command>sssctl COMMAND --help</command>.
pt: Para listar todos os comandos disponíveis corra <command>sssctl</command> sem nenhuns parâmetros. Para escrever ajuda para o comando selecionado corra <command>sssctl COMANDO --help</command>.

source: Configuring session recording with SSSD
pt: Configurando registo de sessão com o SSSD

source: This manual page describes how to configure <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> to work with <citerefentry> <refentrytitle>tlog-rec-session</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, a part of tlog package, to implement user session recording on text terminals. For a detailed configuration syntax reference, refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
pt: Este manual descreve como configurar o <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> para funcionar com <citerefentry> <refentrytitle>tlog-rec-session</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>, uma parte do pacote tlog, para implementar o registo de sessão de utilizador em terminais de texto. Para uma referência de sintaxe de configuração detalhada, consulte a secção <quote>FORMATO DE FICHEIRO</quote> do manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: SSSD can be set up to enable recording of everything specific users see or type during their sessions on text terminals. E.g. when users log in on the console, or via SSH. SSSD itself doesn't record anything, but makes sure tlog-rec-session is started upon user login, so it can record according to its configuration.
pt: O SSSD pode ser configurado para activar o registo de tudo o que utilizadores específicos veem ou escrevem durante as suas sessões em terminais de texto. Ex, quando os utilizadores fazer login na consola, ou via SSH. O próprio SSSD não regista nada, mas garante que o tlog-rec-session é arrancado após o login do utilizador, para que possa registar de acordo com a sua configuração.

source: For users with session recording enabled, SSSD replaces the user shell with tlog-rec-session in NSS responses, and adds a variable specifying the original shell to the user environment, upon PAM session setup. This way tlog-rec-session can be started in place of the user shell, and know which actual shell to start, once it set up the recording.
pt: Para os utilizadores com registo de sessão activo, o SSSD substitui a shell do utilizador por tlog-rec-session em respostas NSS, e adiciona uma variável a especifica a shell original ao ambiente do utilizador, após a configuração da sessão PAM. Deste modo o tlog-rec-session pode ser arrancado no lugar da shell do utilizador, e sabe qual a shell real arrancar, após configurar a gravação do registo.

source: These options can be used to configure the session recording.
pt: Estas opções podem ser usadas para configurar o registo de sessão.

source: The following snippet of sssd.conf enables session recording for users "contractor1" and "contractor2", and group "students".
pt: O seguinte trecho de sssd.conf activa o registo de sessão para os utilizadores "contractor1" e "contractor2", e grupo "students".

source: SSSD Kerberos Cache Manager
pt: Gestor de Cache Kerberos do SSSD

source: This manual page describes the configuration of the SSSD Kerberos Cache Manager (KCM). KCM is a process that stores, tracks and manages Kerberos credential caches. It originates in the Heimdal Kerberos project, although the MIT Kerberos library also provides client side (more details on that below) support for the KCM credential cache.
pt: Este manual descreve a configuração do Gestor de Cache Kerberos do SSSD (KCM). KCM é um processo que guarda, acompanha e gere caches de credenciais do Kerberos. É originário do projecto Heimdal Kerberos, apenas da biblioteca MIT Kerberos também fornecer suporte no lado cliente para cache de credenciais KCM (mais detalhes sobre isso em baixo).

source: In a setup where Kerberos caches are managed by KCM, the Kerberos library (typically used through an application, like e.g., <citerefentry> <refentrytitle>kinit</refentrytitle><manvolnum>1</manvolnum> </citerefentry>, is a <quote>"KCM client"</quote> and the KCM daemon is being referred to as a <quote>"KCM server"</quote>. The client and server communicate over a UNIX socket.
pt: Numa configuração onde as caches do Kerberos são geridas por KCM, a biblioteca Kerberos (tipicamente usada através duma aplicação, como ex., <citerefentry> <refentrytitle>kinit</refentrytitle><manvolnum>1</manvolnum> </citerefentry>, é uma <quote>"cliente KCM"</quote> e o daemon KCM é referido como sendo um <quote>"servidor KCM"</quote>. O cliente e servidor comunicam por um socket UNIX.

source: The KCM credential cache has several interesting properties:
pt: A cache de credenciais do KCM tem várias propriedades interessantes:

source: since the process runs in userspace, it is subject to UID namespacing, unlike the kernel keyring
pt: como o processo corre no espaço-de-utilizador, está sujeito ao espaço-de-nomes do UID ao contrário do chaveiro do kernel

source: unlike the kernel keyring-based cache, which is shared between all containers, the KCM server is a separate process whose entry point is a UNIX socket
pt: ao contrário da cache baseada-em-chaveiro do kernel, a qual é partilhada entre todos os contentores, o servidor KCM é um processo separado cujo ponto de entrada é um socket UNIX

source: the SSSD implementation stores the ccaches in a database, typically located at <replaceable>/var/lib/sss/secrets</replaceable> allowing the ccaches to survive KCM server restarts or machine reboots.
pt: a implementação SSSD guarda as ccaches numa base de dados, tipicamente localizada em <replaceable>/var/lib/sss/secrets</replaceable> permitindo às ccaches sobreviverem a reinícios to servidor KCM ou re-arranques da máquina.

source: This allows the system to use a collection-aware credential cache, yet share the credential cache between some or no containers by bind-mounting the socket.
pt: Isto permite ao sistema usar uma cache de credenciais ciente-de-coleção, e no entanto partilhar a cache de credenciais entre alguns ou nenhum contentor ao vincular-montar o socket.

source: The KCM default client idle timeout is 5 minutes, this allows more time for user interaction with command line tools such as kinit.
pt: O tempo limite de inatividade predefinido do cliente KCM é 5 minutos, isto permite mais tempo para interação do utilizador com ferramentas de linha de comandos como o kinit.

source: USING THE KCM CREDENTIAL CACHE
pt: USANDO A CACHE DE CREDENCIAIS DO KCM

source: In order to use KCM credential cache, it must be selected as the default credential type in <citerefentry> <refentrytitle>krb5.conf</refentrytitle><manvolnum>5</manvolnum> </citerefentry>, The credentials cache name must be only <quote>KCM:</quote> without any template expansions. For example: <placeholder type="programlisting" id="0"/>
pt: De modo a usar a cache de credenciais KCM, tem de ser selecionada como o tipo de credencial predefinido em <citerefentry> <refentrytitle>krb5.conf</refentrytitle><manvolnum>5</manvolnum> </citerefentry>, O nome da cache de credenciais tem de ser apenas <quote>KCM:</quote> sem nenhumas expansões de modelo. Por exemplo: <placeholder type="programlisting" id="0"/>

source: Next, make sure the Kerberos client libraries and the KCM server must agree on the UNIX socket path. By default, both use the same path <replaceable>/var/run/.heim_org.h5l.kcm-socket</replaceable>. To configure the Kerberos library, change its <quote>kcm_socket</quote> option which is described in the <citerefentry> <refentrytitle>krb5.conf</refentrytitle><manvolnum>5</manvolnum> </citerefentry> manual page.
pt: A seguir, certifique que as bibliotecas cliente Kerberos e o servidor KCM têm de concordar no caminho do socket UNIX. Por predefinição, ambos usam o mesmo caminho <replaceable>/var/run/.heim_org.h5l.kcm-socket</replaceable>. Para configurar a biblioteca Kerberos, modifique a sua opção <quote>kcm_socket</quote> que está descrita no manual <citerefentry> <refentrytitle>krb5.conf</refentrytitle><manvolnum>5</manvolnum> </citerefentry>.

source: Finally, make sure the SSSD KCM server can be contacted. The KCM service is typically socket-activated by <citerefentry> <refentrytitle>systemd</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Unlike other SSSD services, it cannot be started by adding the <quote>kcm</quote> string to the <quote>service</quote> directive. <placeholder type="programlisting" id="0"/> Please note your distribution may already configure the units for you.
pt: Finalmente, certifique que o servidor KCM do SSSD pode ser contactado. O serviço KCM é tipicamente activado por socket pelo <citerefentry> <refentrytitle>systemd</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Ao contrário de outros serviços SSSD, este não pode ser arrancado ao adicionar a string <quote>kcm</quote> à directiva <quote>service</quote>. <placeholder type="programlisting" id="0"/> Por favor note que a sua distribuição pode já ter configurado as unidades para si.

source: THE CREDENTIAL CACHE STORAGE
pt: O ARMAZENAMENTO DE CACHE DE CREDENCIAIS

source: The credential caches are stored in a database, much like SSSD caches user or group entries. The database is typically located at <quote>/var/lib/sss/secrets</quote>.
pt: As caches de credenciais são guardadas numa base de dados, muito como o SSSD põe em cache entradas de utilizadores e grupos. A base de dados é tipicamente colocada em <quote>/var/lib/sss/secrets</quote>.

source: OBTAINING DEBUG LOGS
pt: OBTENDO RELATÓRIOS DE DEPURAÇÃO

source: The sssd-kcm service is typically socket-activated <citerefentry> <refentrytitle>systemd</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. To generate debug logs, add the following either to the <filename>/etc/sssd/sssd.conf</filename> file directly or as a configuration snippet to <filename>/etc/sssd/conf.d/</filename> directory: <placeholder type="programlisting" id="0"/> Then, restart the sssd-kcm service: <placeholder type="programlisting" id="1"/> Finally, run whatever use-case doesn't work for you. The KCM logs will be generated at <filename>/var/log/sssd/sssd_kcm.log</filename>. It is recommended to disable the debug logs when you no longer need the debugging to be enabled as the sssd-kcm service can generate quite a large amount of debugging information.
pt: O serviço sssd-kcm tipicamente é activado por socket pelo <citerefentry> <refentrytitle>systemd</refentrytitle> <manvolnum>1</manvolnum> </citerefentry>. Para gerar registos de depuração, adicione o seguinte seja no ficheiro <filename>/etc/sssd/sssd.conf</filename> diretamente ou como trecho de configuração no directório <filename>/etc/sssd/conf.d/</filename>: <placeholder type="programlisting" id="0"/> Depois, reinicie o serviço sssd-kcm: <placeholder type="programlisting" id="1"/> Finalmente, corra algo que não esteja a funcionar para si. Os registos do KCM serão gerados em <filename>/var/log/sssd/sssd_kcm.log</filename>. É recomendado desactivar os registos de depuração quando você já não precisar da depuração pois o serviço sssd-kcm pode gerar grandes quantidades de informação de depuração.

source: Please note that configuration snippets are, at the moment, only processed if the main configuration file at <filename>/etc/sssd/sssd.conf</filename> exists at all.
pt: Por favor note que os trechos de configuração são, até ao momento, apenas processados se o ficheiro de configuração principal em <filename>/etc/sssd/sssd.conf</filename> existir realmente.

source: RENEWALS
pt: RENOVAÇÕES

source: The sssd-kcm service can be configured to attempt TGT renewal for renewable TGTs stored in the KCM ccache. Renewals are only attempted when half of the ticket lifetime has been reached. KCM Renewals are configured when the following options are set in the [kcm] section: <placeholder type="programlisting" id="0"/>
pt: O serviço sssd-kcm pode ser configurado para tentar renovações TGT para TGTs renováveis guardados na ccache do KCM. As renovações são tentadas quando metade do tempo de vida do bilhete foi alcançado. As renovações do KCM são configuradas quando as seguintes opções estão definidas na secção [kcm]: <placeholder type="programlisting" id="0"/>

source: SSSD can also inherit krb5 options for renewals from an existing domain.
pt: O SSSD também pode herdar opções krb5 para renovações a partir de um domínio existente.

source: The following krb5 options can be configured in the [kcm] section to control renewal behavior, these options are described in detail below <placeholder type="programlisting" id="0"/>
pt: As seguintes opções krb5 pode ser configuradas na secção [kcm] para controlar o comportamento de renovação, estas opções estão descritas em detalhe mais abaixo <placeholder type="programlisting" id="0"/>

source: The KCM service is configured in the <quote>kcm</quote> section of the sssd.conf file. Please note that because the KCM service is typically socket-activated, it is enough to just restart the <quote>sssd-kcm</quote> service after changing options in the <quote>kcm</quote> section of sssd.conf: <placeholder type="programlisting" id="0"/>
pt: O serviço KCM é configurado na secção <quote>kcm</quote> do ficheiro sssd.conf. Por favor note que devido ao serviço KCM ser tipicamente activado por socket, basta apenas reiniciar o serviço <quote>sssd-kcm</quote> após modificar as opções na secção <quote>kcm</quote> do sssd.conf: <placeholder type="programlisting" id="0"/>

source: The KCM service is configured in the <quote>kcm</quote> For a detailed syntax reference, refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
pt: O serviço KCM é configurado em <quote>kcm</quote> Para uma referência detalhada de sintaxe, consulte a secção <quote>FORMATO DE FICHEIRO</quote> do manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: The generic SSSD service options such as <quote>debug_level</quote> or <quote>fd_limit</quote> are accepted by the kcm service. Please refer to the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page for a complete list. In addition, there are some KCM-specific options as well.
pt: As opções de serviço SSSD genéricas como <quote>debug_level</quote> ou <quote>fd_limit</quote> são aceites pelo serviço kcm. Por favor consulte o manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para uma lista completa, Adicionalmente, existem também algumas opções específicas do KCM.

source: The socket the KCM service will listen on.
pt: O socket que o serviço KCM irá escutar.

source: Default: <replaceable>/var/run/.heim_org.h5l.kcm-socket</replaceable>
pt: Predefinição: <replaceable>/var/run/.heim_org.h5l.kcm-socket</replaceable>

source: <phrase condition="have_systemd"> Note: on platforms where systemd is supported, the socket path is overwritten by the one defined in the sssd-kcm.socket unit file. </phrase>
pt: <phrase condition="have_systemd"> Nota: em plataformas onde o systemd é suportado, o caminho de socket é sobreposto por um definido no ficheiro de unidade sssd-kcm.socket. </phrase>

source: max_ccaches (integer)
pt: max_ccaches (inteiro)

source: How many credential caches does the KCM database allow for all users.
pt: Quantas caches de credenciais a base de dados KCM permite para todos os utilizadores.

source: Default: 0 (unlimited, only the per-UID quota is enforced)
pt: Predefinição: 0 (ilimitado, apenas a quota por-UID é forçada)

source: max_uid_ccaches (integer)
pt: max_uid_ccaches (inteiro)

source: How many credential caches does the KCM database allow per UID. This is equivalent to <quote>with how many principals you can kinit</quote>.
pt: Quantas caches de credenciais a base de dados do KCM permite por UID. Isto é equivalente a <quote>com quantos principais você pode kinit</quote>.

source: Default: 64
pt: Predefinição: 64

source: max_ccache_size (integer)
pt: max_ccache_size (inteiro)

source: How big can a credential cache be per ccache. Each service ticket accounts into this quota.
pt: Quão grande pode ser uma cache de credenciais por ccache. Cada bilhete de serviço conta para esta cota.

source: Default: 65536
pt: Predefinição: 65536

source: tgt_renewal (bool)
pt: tgt_renewal (booleano)

source: Enables TGT renewals functionality.
pt: Activa a funcionalidade de renovações TGT.

source: Default: False (Automatic renewals disabled)
pt: Predefinição: False (Renovações automáticas desactivadas)

source: Domain to inherit krb5_* options from, for use with TGT renewals.
pt: Domínio de onde herdar opções krb5_*, para usar com renovações TGT.

source: Default: NULL
pt: Predefinição: NULL

source: SSSD systemtap information
pt: Informação de systemtap do SSSD

source: This manual page provides information about the systemtap functionality in <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>.
pt: Este manual fornece informação sobre a funcionalidade systemtap no <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>.

source: SystemTap Probe points have been added into various locations in SSSD code to assist in troubleshooting and analyzing performance related issues.
pt: Pontos SystemTap Probe foram adicionados em várias localizações no código do SSSD para assistir na despistagem de problemas e análise de problemas relacionados com eficiência de desempenho.

source: Sample SystemTap scripts are provided in /usr/share/sssd/systemtap/
pt: Exemplos de scripts do SystemTap estão disponíveis em /usr/share/sssd/systemtap/

source: Probes and miscellaneous functions are defined in /usr/share/systemtap/tapset/sssd.stp and /usr/share/systemtap/tapset/sssd_functions.stp respectively.
pt: Provas e funções variadas estão definidas em /usr/share/systemtap/tapset/sssd.stp e /usr/share/systemtap/tapset/sssd_functions.stp respetivamente.

source: PROBE POINTS
pt: PONTOS DE PROVA

source: The information below lists the probe points and arguments available in the following format:
pt: A informação abaixo lista os pontos de prova e argumentos disponíveis no seguinte formato:

source: Description of probe point
pt: Descrição de ponto de prova

source: Database Transaction Probes
pt: Provas de Transação de Base de Dados

source: Start of a sysdb transaction, probes the sysdb_transaction_start() function.
pt: Arranca de uma transação sysdb, prova a função sysdb_transaction_start().

source: Cancellation of a sysdb transaction, probes the sysdb_transaction_cancel() function.
pt: Cancelamento de uma transação sysdb, prova a função sysdb_transaction_cancel().

source: Probes the sysdb_transaction_commit_before() function.
pt: Prova a função sysdb_transaction_commit_before().

source: Probes the sysdb_transaction_commit_after() function.
pt: Prova a função sysdb_transaction_commit_after().

source: LDAP Search Probes
pt: Provas de Busca do LDAP

source: Probes the sdap_get_generic_ext_send() function.
pt: Prova a função sdap_get_generic_ext_send().

source: Probes the sdap_get_generic_ext_recv() function.
pt: Prova a função sdap_get_generic_ext_recv().

source: Probes the sdap_parse_entry() function. It is called repeatedly with every received attribute.
pt: Prova a função sdap_parse_entry(). É chamada repetidamente com cada atributo recebido.

source: Probes the sdap_parse_entry() function. It is called when parsing of received object is finished.
pt: Prova a função sdap_parse_entry(). É chamada quando a análise de objecto recebido é concluída.

source: Probes the sdap_deref_search_send() function.
pt: Prova a função sdap_deref_search_send().

source: Probes the sdap_deref_search_recv() function.
pt: Prova a função sdap_deref_search_recv().

source: LDAP Account Request Probes
pt: Provas de Pedido de Conta LDAP

source: Probes the sdap_acct_req_send() function.
pt: Prova a função sdap_acct_req_send().

source: Probes the sdap_acct_req_recv() function.
pt: Prova a função sdap_acct_req_recv().

source: LDAP User Search Probes
pt: Provas de Busca de Utilizador LDAP

source: Probes the sdap_search_user_send() function.
pt: Prova a função sdap_search_user_send().

source: Probes the sdap_search_user_recv() function.
pt: Prova a função sdap_search_user_recv().

source: Probes the sdap_search_user_save_begin() function.
pt: Prova a função sdap_search_user_save_begin().

source: Probes the sdap_search_user_save_end() function.
pt: Prova a função sdap_search_user_save_end().

source: Data Provider Request Probes
pt: Provas de Pedido de Provedor de Dados

source: A Data Provider request is submitted.
pt: Um pedido de Provedor de Dados é submetido.

source: A Data Provider request is completed.
pt: Um pedido de Provedor de Dados é completado.

source: MISCELLANEOUS FUNCTIONS
pt: FUNÇÕES VARIADAS

source: Convert entry_type to string and return string
pt: Converte entry_type em string e retorna a string

source: Create probe string based on filter type
pt: Cria string de prova baseada no tipo de filtro

source: Convert target to string and return string
pt: Convert alvo em string e retorna a string

source: Convert method to string and return string
pt: Converte método em string e retorna a string

source: SAMPLE SYSTEMTAP SCRIPTS
pt: EXEMPLOS DE SCRIPTS DO SYSTEMTAP

source: Start the SystemTap script (<command>stap /usr/share/sssd/systemtap/&lt;script_name&gt;.stp</command>), then perform an identity operation and the script will collect information from probes.
pt: Arranca o script SystemTap (<command>stap /usr/share/sssd/systemtap/&lt;script_name&gt;.stp</command>), depois executa uma operação de identidade e o script irá recolher informação a partir das provas.

source: Provided SystemTap scripts are:
pt: Os scripts fornecidos do SystemTap são:

source: Monitoring of data provider request performance.
pt: Monitorização da performance de pedido de provedor de dados.

source: Monitoring of <command>id</command> command performance.
pt: Monitorização da performance do comando <command>id</command>.

source: Monitoring of LDAP queries.
pt: Monitorização das consultas LDAP.

source: Performance of nested groups resolving.
pt: Performance da resolução de grupos aninhados.

source: SSSD LDAP Provider: Mapping Attributes
pt: Provedor LDAP do SSSD: Atributos de Mapeamento
