Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: However, unless the <quote>ad</quote> access control provider is explicitly configured, the default access provider is <quote>permit</quote>. Please note that if you configure an access provider other than <quote>ad</quote>, you need to set all the connection parameters (such as LDAP URIs and encryption details) manually.
pt: No entanto, a menos que o provedor de controle de acesso <quote>ad</quote> seja explicitamente configurado, o provedor de acesso predefinido é <quote>permit</quote>. Por favor note que se você configurar um provedor de acesso diferente do <quote>ad</quote>, você tem de definir todos os parâmetros da ligação (tal como URIs do LDAP e detalhes de encriptação) manualmente.

source: When the autofs provider is set to <quote>ad</quote>, the RFC2307 schema attribute mapping (nisMap, nisObject, ...) is used, because these attributes are included in the default Active Directory schema.
pt: Quando o provedor autofs é definido para <quote>ad</quote>, é usado o mapeamento de atributos esquema RFC2307 (nisMap, nisObject, ...), porque estes atributos estão incluídos no esquema Active Directory predefinido.

source: Configuring sudo with the SSSD back end
pt: Configurar sudo com o backend do SSSD

source: This manual page describes how to configure <citerefentry> <refentrytitle>sudo</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> to work with <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> and how SSSD caches sudo rules.
pt: Este manual descreve como configurar <citerefentry> <refentrytitle>sudo</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> para funcionar com o <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> e como o SSSD põe em cache regras sudo.

source: Configuring sudo to cooperate with SSSD
pt: Configurar sudo para cooperar com o SSSD

source: To enable SSSD as a source for sudo rules, add <emphasis>sss</emphasis> to the <emphasis>sudoers</emphasis> entry in <citerefentry> <refentrytitle>nsswitch.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
pt: Para activar SSSD como fonte para regras sudo, adicione <emphasis>sss</emphasis> à entrada <emphasis>sudoers</emphasis> em <citerefentry> <refentrytitle>nsswitch.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: For example, to configure sudo to first lookup rules in the standard <citerefentry> <refentrytitle>sudoers</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> file (which should contain rules that apply to local users) and then in SSSD, the nsswitch.conf file should contain the following line:
pt: Por exemplo, para configurar o sudo para primeiro procurar no ficheiro <citerefentry> <refentrytitle>sudoers</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> standard (o qual deve conter regras que se aplicam a utilizadores locais) e depois no SSSD, o ficheiro nsswitch.conf deve conter a seguinte linha:

source: More information about configuring the sudoers search order from the nsswitch.conf file as well as information about the LDAP schema that is used to store sudo rules in the directory can be found in <citerefentry> <refentrytitle>sudoers.ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
pt: Mais informação sobre a configuração da ordem de procura de sudoers a partir do ficheiro nsswitch.conf assim como informação acerca do esquema LDAP que é usado para guardar regras sudo no directório pode ser encontrada em <citerefentry> <refentrytitle>sudoers.ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: <emphasis>Note</emphasis>: in order to use netgroups or IPA hostgroups in sudo rules, you also need to correctly set <citerefentry> <refentrytitle>nisdomainname</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> to your NIS domain name (which equals to IPA domain name when using hostgroups).
pt: <emphasis>Nota</emphasis>: de modo a usar netgroups ou hostgroups do IPA em regras sudo, você também precisa de definir corretamente <citerefentry> <refentrytitle>nisdomainname</refentrytitle> <manvolnum>1</manvolnum> </citerefentry> ao seu nome de domínio NIS (o qual é igual ao nome de domínio IPA quando se usam hostgroups).

source: Configuring SSSD to fetch sudo rules
pt: Configurar SSSD para obter regras sudo

source: All configuration that is needed on SSSD side is to extend the list of <emphasis>services</emphasis> with "sudo" in [sssd] section of <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>. To speed up the LDAP lookups, you can also set search base for sudo rules using <emphasis>ldap_sudo_search_base</emphasis> option.
pt: Toda a configuração que é necessária no lado SSSD é estender a lista de <emphasis>services</emphasis> com "sudo" na secção [sssd] de <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>. Para acelerar as procuras LDAP, você pode também definir uma base de busca para regras sudo usando a opção <emphasis>ldap_sudo_search_base</emphasis>.

source: The following example shows how to configure SSSD to download sudo rules from an LDAP server.
pt: O seguinte exemplo mostra como configurar o SSSD para descarregar regras sudo de um servidor LDAP.

source: <placeholder type="programlisting" id="0"/> <phrase condition="have_systemd"> It's important to note that on platforms where systemd is supported there's no need to add the "sudo" provider to the list of services, as it became optional. However, sssd-sudo.socket must be enabled instead. </phrase>
pt: <placeholder type="programlisting" id="0"/> <phrase condition="have_systemd"> É importante notar que em plataformas onde o systemd é suportado não é preciso adicionar o provedor "sudo" À lista de serviços, pois isso torna-se opcional. No entanto, em vez disso o sssd-sudo.socket tem de ser activado. </phrase>

source: When SSSD is configured to use IPA as the ID provider, the sudo provider is automatically enabled. The sudo search base is configured to use the IPA native LDAP tree (cn=sudo,$SUFFIX). If any other search base is defined in sssd.conf, this value will be used instead. The compat tree (ou=sudoers,$SUFFIX) is no longer required for IPA sudo functionality.
pt: Quando o SSSD é configurado para usar IPA como provedor de ID, o provedor sudo é activado automaticamente. A base de busca do sudo é configurada para usar a árvore LDAP nativa do IPA (cn=sudo,$SUFFIX). Se qualquer outra base de busca for definida no sssd.conf, é este valor que será usado. A árvore compat (ou=sudoers,$SUFFIX) não é mais requerida para a funcionalidade sudo do IPA.

source: The SUDO rule caching mechanism
pt: O mecanismo de recolha de regra SUDO

source: The biggest challenge, when developing sudo support in SSSD, was to ensure that running sudo with SSSD as the data source provides the same user experience and is as fast as sudo but keeps providing the most current set of rules as possible. To satisfy these requirements, SSSD uses three kinds of updates. They are referred to as full refresh, smart refresh and rules refresh.
pt: O maior desafio, ao se desenvolver suporte de sudo no SSSD, foi assegurar que correr o sudo com o SSSD como a fonte de dados providenciasse a mesma experiência ao utilizador e fosse tão rápido como o sudo mas continuasse a fornecer o mais corrente conjunto de regras possível. Para satisfazer estes requisitos, o SSSD usa três tipos de actualizações. Elas são referidas como full refresh, smart refresh e rules refresh.

source: The <emphasis>smart refresh</emphasis> periodically downloads rules that are new or were modified after the last update. Its primary goal is to keep the database growing by fetching only small increments that do not generate large amounts of network traffic.
pt: O <emphasis>smart refresh</emphasis> descarrega periodicamente regras que são novas ou foram modificadas após a última actualização. O seu objectivo primário é manter a base de dados a crescer ao obter apenas pequenos incrementos que não geram grandes quantidades de tráfego de rede.

source: The <emphasis>full refresh</emphasis> simply deletes all sudo rules stored in the cache and replaces them with all rules that are stored on the server. This is used to keep the cache consistent by removing every rule which was deleted from the server. However, full refresh may produce a lot of traffic and thus it should be run only occasionally depending on the size and stability of the sudo rules.
pt: O <emphasis>full refresh</emphasis> simplesmente apaga todas as regras sudo guardadas na cache e substitui-as com todas as regras que estão guardadas no servidor. Isto é usado para manter a cache consistente ao remover qualquer regra que foi apagada no servidor. No entanto, o full refresh pode produzir muito tráfego e assim só deve ser usado ocasionalmente dependendo do tamanho e estabilidade das regras sudo.

source: The <emphasis>rules refresh</emphasis> ensures that we do not grant the user more permission than defined. It is triggered each time the user runs sudo. Rules refresh will find all rules that apply to this user, check their expiration time and redownload them if expired. In the case that any of these rules are missing on the server, the SSSD will do an out of band full refresh because more rules (that apply to other users) may have been deleted.
pt: O <emphasis>rules refresh</emphasis> assegura que nós não concedemos ao utilizador mais permissões que as definidas. É despoletado a cada vez que o utilizador corre o sudo. O refrescamento de regras irá encontrar todas as regras que se aplicam a este utilizador, verifica as suas datas de expiração e re-descarrega-as se estiverem expiradas. No caso de qualquer uma dessas regras estiver em falta no servidor, o SSSD irá fazer refrescamento total de banda porque mais regras (que se apliquem a outros utilizadores) podem ter sido apagadas.

source: If enabled, SSSD will store only rules that can be applied to this machine. This means rules that contain one of the following values in <emphasis>sudoHost</emphasis> attribute:
pt: Se activo, o SSSD irá guardar apenas regras que podem ser aplicadas a esta máquina. Isto significa regras que contêm um dos seguintes valores no atributo <emphasis>sudoHost</emphasis>:

source: keyword ALL
pt: palavra chave ALL

source: netgroup (in the form "+netgroup")
pt: netgroup (no formato "+netgroup")

source: hostname or fully qualified domain name of this machine
pt: nome de máquina ou nome de domínio totalmente qualificado desta máquina

source: one of the IP addresses of this machine
pt: um dos endereços IP desta máquina

source: one of the IP addresses of the network (in the form "address/mask")
pt: um dos endereços IP da rede (no formato "endereço/mascara")

source: There are many configuration options that can be used to adjust the behavior. Please refer to "ldap_sudo_*" in <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> and "sudo_*" in <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
pt: Existem muitas opções de configuração que podem ser usadas para ajustar o comportamento. Por favor consulte "ldap_sudo_*" em <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> e "sudo_*" em <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: Tuning the performance
pt: Afinando a performance

source: SSSD uses different kinds of mechanisms with more or less complex LDAP filters to keep the cached sudo rules up to date. The default configuration is set to values that should satisfy most of our users, but the following paragraphs contain few tips on how to fine- tune the configuration to your requirements.
pt: O SSSD usa diferentes tipos de mecanismos com filtros LDAP mais ou menos complexos para manter as regras sudo em cache actualizadas. A configuração predefinida é definida para valores que devem satisfazer a maioria dos utilizadores, mas os seguintes parágrafos contêm algumas dicas sobre como afinar a configuração aos seus requerimentos.

source: 1. <emphasis>Index LDAP attributes</emphasis>. Make sure that following LDAP attributes are indexed: objectClass, cn, entryUSN or modifyTimestamp.
pt: 1. <emphasis>Indexar atributos LDAP</emphasis>. Certifique que os seguintes atributos LDAP são indexados: objectClass, cn, entryUSN ou modifyTimestamp.

source: 2. <emphasis>Set ldap_sudo_search_base</emphasis>. Set the search base to the container that holds the sudo rules to limit the scope of the lookup.
pt: 2. <emphasis>Definir ldap_sudo_search_base</emphasis>. Definir a base de busca para o contentor que guarda as regras sudo para limitar o escopo da procura.

source: 3. <emphasis>Set full and smart refresh interval</emphasis>. If your sudo rules do not change often and you do not require quick update of cached rules on your clients, you may consider increasing the <emphasis>ldap_sudo_full_refresh_interval</emphasis> and <emphasis>ldap_sudo_smart_refresh_interval</emphasis>. You may also consider disabling the smart refresh by setting <emphasis>ldap_sudo_smart_refresh_interval = 0</emphasis>.
pt: 3. <emphasis>Definir intervalo de refrescamento full e smart</emphasis>. Se as suas regras sudo não mudam com frequência e você não requer actualizações rápidas ou regras em cache nos seus clientes, você pode considerar aumentar <emphasis>ldap_sudo_full_refresh_interval</emphasis> e <emphasis>ldap_sudo_smart_refresh_interval</emphasis>. Você pode também considerar desactivar o refrescamento smart ao definir <emphasis>ldap_sudo_smart_refresh_interval = 0</emphasis>.

source: 4. If you have large number of clients, you may consider increasing the value of <emphasis>ldap_sudo_random_offset</emphasis> to distribute the load on the server better.
pt: 4. Se você tem um grande número de clientes, você pode considerar aumentar o valor de <emphasis>ldap_sudo_random_offset</emphasis> para distribuir melhor a carga no servidor.

source: SSSD IdP provider
pt: Provedor IdP do SSSD

source: This manual page describes the configuration of the IdP provider for <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. For a detailed syntax reference, refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
pt: Este manual descreve a configuração do provedor IdP para <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Para uma referência de sintaxe detalhada, consulte a secção <quote>FORMATO DE FICHEIRO</quote> do manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: The IdP provider is a back end used to connect to an OAuth 2.0 and REST based identity provider (IdP). Since products might have individual implementation of the REST API for looking up user and group attributes dedicated code might be required, see the <quote>idp_type</quote> option for details.
pt: O provedor IdP é um backend usado para ligar a um provedor de identidade baseado em OAuth 2.0 e REST (IdP). Como os produtos podem ter implementação individual da REST API para procurar atributos de utilizador e grupo, pode ser preciso código dedicado, veja a opção <quote>idp_type</quote> para detalhes.

source: IdPs typically do not provide POSIX attributes like e.g. user Id (UID) or home directory. SSSD's IdP provider will autogenerate the needed attributes. The default algorithm to generate user IDs (UIDs) and group IDs (GIDs) aims to create reproducible IDs on different systems. As a drawback it might happen that the algorithm assigns the same ID to different objects and only the first one requested via SSSD will be available.
pt: IdPs tipicamente não fornecem atributos POSIX como ex. Id de utilizador (UID) ou directório home. O provedor IdP do SSSD irá autogerar os atributos necessários. O algoritmo predefinido para gerar IDs de utilizador (UIDs) e IDs de grupo (GIDs) tem o objectivo de criar IDs reproduzíveis em diferentes sistemas. Um inconveniente que pode acontecer é que o algoritmo atribua o mesmo ID a diferentes objetos e apenas o primeiro requisitado via SSSD esteja disponível.

source: Required option that specifies the IdP product. Currently Entra ID (entra_id) and Keycloak (keycloak) are supported.
pt: Opção requerida que especifica o produto IdP. Atualmente são suportados Entra ID (entra_id) e Keycloak (keycloak).

source: Depending on the IdP product additional platform specific options might follow the name separated by a colon (:). E.g. for Keycloak the base URI for the user and group REST API must be given. For Entra ID this is not needed because there is a generic endpoint for all tenants.
pt: Dependendo d produto IdP opções adicionais especificas da plataforma podem ter o nome separado por dois-pontos (:). Ex. para Keycloak o URI base para o utilizador e grupo REST API tem de ser fornecido. Para Entra ID isto não é necessário porque é um endpoint genérico para todos os tenants.

source: Default: Not set (Required)
pt: Predefinição: Não definida (Requerido)

source: ID of the IdP client used by SSSD to authenticate users and as a client to lookup user and group attributes. This client must offer device authorization according to RFC-8628 and must have permissions to search and read user and group attributes.
pt: ID do cliente IdP usado pelo SSSD para autenticar utilizadores e como um cliente para procurar atributos de utilizador e grupo. Este cliente tem e oferecer autorização de dispositivo de acordo com RFC-8628 e tem de ter permissão para procurar e ler atributos de utilizador e grupo.

source: Password of the IdP client. The password is required for the id_provider. If only used as auth_provider it depends on the server side configuration if it is required or not.
pt: Palavra passe do cliente IdP. A palavra passe é requerida para o id_provider. Se apenas usado como auth_provider depende da configuração do lado do servidor se é requerida ou não.

source: IdP endpoint for requesting access tokens.
pt: Endpoint IdP para requisitar testemunhos de acesso.

source: IdP endpoint for device authorization according to RFC-8628. This is required for user authentication.
pt: Endpoint IdP para autorização de dispositivo de acordo com RFC-8628. Isto é requerido para autenticação de utilizador.

source: IdP userinfo endpoint to request user attributes after a successful authentication of the user. Required for authentication.
pt: Endpoint de informação de utilizador do IdP para requisitar atributos de utilizador após autenticação com sucesso do utilizador. Requerido para autenticação.

source: Scope required for looking up user and group attributes with the REST API. The scopes are used by the server to determine which attributes/claims are returned to the caller.
pt: Escopo requerido para procurar atributos de utilizador e grupo com a REST API. Os escopos são usados pelo servidor para determinar que atributos/reivindicações são retornados ao chamador.

source: Scope required during authentication. The scopes are used by the server to determine which attributes/claims are returned to the caller.
pt: Escopo requerido durante a autenticação. Os escopos são usados pelo servidor para determinar que atributos/reivindicações são retornados ao chamador.

source: Currently the tokens returned during user authentication are not used for other purposes hence the only important claim is the subject identifier 'sub' which is used to check if the authenticated user is the one trying to log in. This might change in future.
pt: Presentemente os testemunhos retornados durante a autenticação do utilizador não são usados para outros objetivos por isso a única reivindicação importante é o identificador de assunto 'sub' o que é usado para verificar se o utilizador autenticado é aquele que tenta fazer login. Isto poderá vir a mudar no futuro.

source: idp_request_timeout (integer)
pt: idp_request_timeout (inteiro)

source: Timeout in seconds for an individual request to the IdP.
pt: Tempo limite em segundos para um pedido individual ao IdP.

source: idmap_range_min (integer)
pt: idmap_range_min (inteiro)

source: Specifies the lower (inclusive) bound of the range of POSIX IDs to use for mapping IdP users and group to POSIX IDs. It is the first POSIX ID which can be used for the mapping.
pt: Especifica o vínculo inferior (inclusive) da gama de IDs POSIX para usar para mapear utilizadores e grupos IdP para IDs POSIX. É o primeiro ID POSIX ID que pode ser usado para o mapeamento.

source: Default: 200000
pt: Predefinição: 200000

source: idmap_range_max (integer)
pt: idmap_range_max (inteiro)

source: Specifies the upper (exclusive) bound of the range of POSIX IDs to use for mapping IdP users and groups to POSIX IDs. It is the first POSIX ID which will not be used for POSIX ID-mapping anymore.
pt: Especifica o vínculo superior (inclusive) da gama de IDs POSIX para usar para mapear utilizadores e grupos IdP para IDs POSIX. É o primeiro ID POSIX ID que não vai ser mais usado para o mapeamento de ID POSIX.

source: Default: 2000200000
pt: Predefinição: 2000200000

source: idmap_range_size (integer)
pt: idmap_range_size (inteiro)

source: Specifies the number of POSIX IDs available for a single IdP domain.
pt: Especifica o número de IDs POSIX disponíveis para um único domínio IdP.

source: System Security Services Daemon
pt: Daemon de Serviços de Segurança do Sistema

source: <command>sssd</command> <arg choice='opt'> <replaceable>options</replaceable> </arg>
pt: <command>sssd</command> <arg choice='opt'> <replaceable>opções</replaceable> </arg>

source: <command>SSSD</command> provides a set of daemons to manage access to remote directories and authentication mechanisms. It provides an NSS and PAM interface toward the system and a pluggable backend system to connect to multiple different account sources as well as D-Bus interface. It is also the basis to provide client auditing and policy services for projects like FreeIPA. It provides a more robust database to store local users as well as extended user data.
pt: O <command>SSSD</command> fornece um conjunto de daemons para gerir o acesso a directórios remotos e mecanismos de autenticação. Fornece uma interface de NSS e PAM virada para o sistema e um sistema backend adaptável para ligar a múltiplas fontes de conta diferentes assim como uma interface D-Bus. É também a base para fornecer auditoria de cliente e serviços de política para projetos como o FreeIPA. Fornece uma base de dados mais robusta para guardar utilizadores locais assim como dados estendidos de utilizador.

source: <option>-d</option>,<option>--debug-level</option> <replaceable>LEVEL</replaceable>
pt: <option>-d</option>,<option>--debug-level</option> <replaceable>NÍVEL</replaceable>

source: <option>--debug-timestamps=</option><replaceable>mode</replaceable>
pt: <option>--debug-timestamps=</option><replaceable>modo</replaceable>

source: <emphasis>1</emphasis>: Add a timestamp to the debug messages
pt: <emphasis>1</emphasis>: Adiciona uma marca horária às mensagens de depuração

source: <emphasis>0</emphasis>: Disable timestamp in the debug messages
pt: <emphasis>0</emphasis>: Desactiva a marca horária nas mensagens de depuração

source: <option>--debug-microseconds=</option><replaceable>mode</replaceable>
pt: <option>--debug-microseconds=</option><replaceable>modo</replaceable>

source: <emphasis>1</emphasis>: Add microseconds to the timestamp in debug messages
pt: <emphasis>1</emphasis>: Adiciona micro-segundos à marca horária nas mensagens de depuração
