Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: The LDAP attribute that contains the port managed by this service.
pt: O atributo do LDAP que contém o porto gerido por este serviço.

source: Default: ipServicePort
pt: Predefinição: ipServicePort

source: The LDAP attribute that contains the protocols understood by this service.
pt: O atributo do LDAP que contém os protocolos compreendidos por este serviço.

source: Default: ipServiceProtocol
pt: Predefinição: ipServiceProtocol

source: SUDO ATTRIBUTES
pt: ATRIBUTOS DO SUDO

source: The object class of a sudo rule entry in LDAP.
pt: A classe de objecto de uma entrada de regra sudo em LDAP.

source: Default: sudoRole
pt: Predefinição: sudoRole

source: The LDAP attribute that corresponds to the sudo rule name.
pt: O atributo LDAP que corresponde ao nome da regra sudo.

source: The LDAP attribute that corresponds to the command name.
pt: O atributo LDAP que corresponde ao nome do comando.

source: Default: sudoCommand
pt: Predefinição: sudoCommand

source: The LDAP attribute that corresponds to the host name (or host IP address, host IP network, or host netgroup)
pt: O atributo LDAP que corresponde ao nome da máquina (ou endereço IP da maquina, rede IP da máquina, ou netgroup da máquina)

source: Default: sudoHost
pt: Predefinição: sudoHost

source: The LDAP attribute that corresponds to the user name (or UID, group name or user's netgroup)
pt: O atributo LDAP que corresponde ao nome de utilizador (ou UID, nome de grupo, ou netgroup do utilizador)

source: Default: sudoUser
pt: Predefinição: sudoUser

source: The LDAP attribute that corresponds to the sudo options.
pt: O atributo LDAP que corresponde às opções do sudo.

source: Default: sudoOption
pt: Predefinição: sudoOption

source: The LDAP attribute that corresponds to the user name that commands may be run as.
pt: O atributo LDAP que corresponde ao nome de utilizador com que os comandos podem ser corridos como.

source: Default: sudoRunAsUser
pt: Predefinição: sudoRunAsUser

source: The LDAP attribute that corresponds to the group name or group GID that commands may be run as.
pt: O atributo LDAP que corresponde ao nome de grupo ou ID de grupo com que os comandos podem ser corridos como.

source: Default: sudoRunAsGroup
pt: Predefinição: sudoRunAsGroup

source: The LDAP attribute that corresponds to the start date/time for when the sudo rule is valid.
pt: O atributo LDAP que corresponde à data/hora de arranque para quando a regra sudo é válida.

source: Default: sudoNotBefore
pt: Predefinição: sudoNotBefore

source: The LDAP attribute that corresponds to the expiration date/time, after which the sudo rule will no longer be valid.
pt: O atributo LDAP que corresponde à data/hora de expiração, após a qual a regra sudo não é mais válida.

source: Default: sudoNotAfter
pt: Predefinição: sudoNotAfter

source: The LDAP attribute that corresponds to the ordering index of the rule.
pt: O atributo LDAP que corresponde ao índice de ordenação da regra.

source: Default: sudoOrder
pt: Predefinição: sudoOrder

source: AUTOFS ATTRIBUTES
pt: ATRIBUTOS DO AUTOFS

source: IP HOST ATTRIBUTES
pt: ATRIBUTOS DE ANFITRIÃO IP

source: The object class of an iphost entry in LDAP.
pt: A classe de objecto de uma entrada iphost no LDAP.

source: Default: ipHost
pt: Predefinição: ipHost

source: The LDAP attribute that contains the name of the IP host attributes and their aliases.
pt: O atributo do LDAP que contém o nome dos atributos de IP de máquina e os seus nomes alternativos (aliases).

source: The LDAP attribute that contains the IP host address.
pt: O atributo do LDAP que contém o endereço IP da máquina.

source: Default: ipHostNumber
pt: Predefinição: ipHostNumber

source: IP NETWORK ATTRIBUTES
pt: ATRIBUTOS DE REDE IP

source: The object class of an ipnetwork entry in LDAP.
pt: A classe de objecto de uma entrada ipnetwork no LDAP.

source: Default: ipNetwork
pt: Predefinição: ipNetwork

source: The LDAP attribute that contains the name of the IP network attributes and their aliases.
pt: O atributo do LDAP que contém o nome dos atributos de rede IP e os seus nomes alternativos (alias).

source: The LDAP attribute that contains the IP network address.
pt: O atributo do LDAP que contém o endereço de rede IP.

source: Default: ipNetworkNumber
pt: Predefinição: ipNetworkNumber

source: Kerberos local authorization plugin
pt: Plugin de autorização local do Kerberos

source: The Kerberos local authorization plugin <command>sssd_krb5_localauth_plugin</command> is used by libkrb5 to either find the local name for a given Kerberos principal or to check if a given local name and a given Kerberos principal relate to each other.
pt: O plugin de autorização local do Kerberos <command>sssd_krb5_localauth_plugin</command> é usado pelo libkrb5 para ou encontrar o nome local para um dado principal de Kerberos ou para verificar se um dado nome local e um dado principal Kerberos estão ambos relacionados.

source: SSSD handles the local names for users from a remote source and can read the Kerberos user principal name from the remote source as well. With this information SSSD can easily handle the mappings mentioned above even if the local name and the Kerberos principal differ considerably.
pt: O SSSD lida com nomes locais para utilizadores a partir de uma fonte remota e pode ler o nome principal de utilizador Kerberos a partir da fonte remota também. Com esta informação o SSSD pode facilmente lidar com os mapeamentos mencionados em cima mesmo que o nome local e o principal Kerberos sejam consideravelmente diferentes.

source: Additionally with the information read from the remote source SSSD can help to prevent unexpected or unwanted mappings in case the user part of the Kerberos principal accidentally corresponds to a local name of a different user. By default libkrb5 might just strip the realm part of the Kerberos principal to get the local name which would lead to wrong mappings in this case.
pt: Adicionalmente com a informação lida a partir da fonte remota, o SSSD pode ajudar a prevenir mapeamentos inesperados ou indesejados no caso da parte utilizador do principal Kerberos corresponder acidentalmente a um nome local de um utilizador diferente. Por predefinição a libkrb5 pode apenas despir a parte de reino do principal Kerberos para obter o nome local o que poderia levar a mapeamentos errados neste caso.

source: CONFIGURATION
pt: CONFIGURAÇÃO

source: The Kerberos local authorization plugin must be enabled explicitly in the Kerberos configuration, see <citerefentry> <refentrytitle>krb5.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>. SSSD will create a config snippet with the content like e.g. <placeholder type="programlisting" id="0"/> automatically in the SSSD's public Kerberos configuration snippet directory. If this directory is included in the local Kerberos configuration the plugin will be enabled automatically.
pt: O plugin de autorização local do Kerberos tem de ser explicitamente activado na configuração do Kerberos, veja <citerefentry> <refentrytitle>krb5.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>. O SSSD irá criar um trecho de configuração com o conteúdo como ex. <placeholder type="programlisting" id="0"/> automaticamente no directório de trechos de configuração Kerberos público do SSSD. Se este directório estiver incluído na configuração Kerberos local o plugin será activado automaticamente.

source: The object class of an automount map entry in LDAP.
pt: A classe de objecto de uma entrada automount map no LDAP.

source: Default: nisMap (rfc2307, autofs_provider=ad), otherwise automountMap
pt: Predefinição: nisMap (rfc2307, autofs_provider=ad), caso contrário automountMap

source: The name of an automount map entry in LDAP.
pt: O nome de uma entrada automount map no LDAP.

source: Default: nisMapName (rfc2307, autofs_provider=ad), otherwise automountMapName
pt: Predefinição: nisMapName (rfc2307, autofs_provider=ad), caso contrário automountMapName

source: The object class of an automount entry in LDAP. The entry usually corresponds to a mount point.
pt: A classe objecto de uma entrada automount no LDAP.. A entrada geralmente corresponde a um ponto de montagem.

source: Default: nisObject (rfc2307, autofs_provider=ad), otherwise automount
pt: Predefinição: nisObject (rfc2307, autofs_provider=ad), caso contrário automount

source: The key of an automount entry in LDAP. The entry usually corresponds to a mount point.
pt: A chave de uma entrada automount no LDAP. A entrada geralmente corresponde a um ponto de montagem.

source: Default: cn (rfc2307, autofs_provider=ad), otherwise automountKey
pt: Predefinição: cn (rfc2307, autofs_provider=ad), caso contrário automountKey

source: Default: nisMapEntry (rfc2307, autofs_provider=ad), otherwise automountInformation
pt: Predefinição: nisMapEntry (rfc2307, autofs_provider=ad), caso contrário automountInformation

source: SERVICE DISCOVERY
pt: DESCOBERTA DE SERVIÇOS

source: The service discovery feature allows back ends to automatically find the appropriate servers to connect to using a special DNS query. This feature is not supported for backup servers.
pt: A funcionalidade de descoberta de serviços permite aos backends encontrarem automaticamente os servidores apropriados para ligarem para usarem uma consulta DNS especial. Esta funcionalidade não é suportada para servidores de salvaguarda (backup).

source: Configuration
pt: Configuração

source: If no servers are specified, the back end automatically uses service discovery to try to find a server. Optionally, the user may choose to use both fixed server addresses and service discovery by inserting a special keyword, <quote>_srv_</quote>, in the list of servers. The order of preference is maintained. This feature is useful if, for example, the user prefers to use service discovery whenever possible, and fall back to a specific server when no servers can be discovered using DNS.
pt: Se nenhum servidor for especificado, o backend automaticamente usa a descoberta de serviços para tentar encontrar um servidor. Opcionalmente, o utilizador pode escolher usar ambos endereços de servidor fixos e a descoberta de serviços ao inserir uma palavra chave especial <quote>_srv_</quote>, na lista de servidores. A ordem de preferência é mantida. Esta funcionalidade é útil se, por exemplo, o utilizador prefere usar descoberta de serviços sempre que possível, e regressar a um servidor específico quando não se descobrem servidores usando DNS.

source: The domain name
pt: O nome de domínio

source: Please refer to the <quote>dns_discovery_domain</quote> parameter in the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page for more details.
pt: Por favor consulte o parâmetro <quote>dns_discovery_domain</quote> no manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais detalhes.

source: The protocol
pt: O protocolo

source: The queries usually specify _tcp as the protocol. Exceptions are documented in respective option description.
pt: As consultas geralmente especificam _tcp como o protocolo. As excepções estão documentadas na descrição da opção respectiva.

source: See Also
pt: Veja também

source: For more information on the service discovery mechanism, refer to RFC 2782.
pt: Para mais informação sobre o mecanismo de descoberta de serviços, consulte RFC 2782.

source: <productname>SSSD</productname> <orgname>The SSSD upstream - https://github.com/SSSD/sssd/</orgname>
pt: <productname>SSSD</productname> <orgname>O autor do SSSD - https://github.com/SSSD/sssd/</orgname>

source: The failover feature allows back ends to automatically switch to a different server if the current server fails.
pt: A funcionalidade failover permite aos backends mudarem automaticamente para o servidor diferente se o servidor actual falhar.

source: Failover Syntax
pt: Sintaxe do Failover

source: The list of servers is given as a comma-separated list; any number of spaces is allowed around the comma. The servers are listed in order of preference. The list can contain any number of servers.
pt: A lista de servidores é dada como uma lista separada por vírgulas; é permitido qualquer número de espaços em volta das vírgulas. Os servidores são listados pela ordem de preferência. A lista pode conter qualquer número de servidores.

source: For each failover-enabled config option, two variants exist: <emphasis>primary</emphasis> and <emphasis>backup</emphasis>. The idea is that servers in the primary list are preferred and backup servers are only searched if no primary servers can be reached. If a backup server is selected, a timeout of 31 seconds is set. After this timeout SSSD will periodically try to reconnect to one of the primary servers. If it succeeds, it will replace the current active (backup) server.
pt: Para cada opção de configuração activa-failover, existem duas variantes: <emphasis>primary</emphasis> e <emphasis>backup</emphasis>. A ideia é que os servidores na lista primária são preferidos e os servidores backup são apenas procurados se os servidores primários não puderem ser alcançados. Se um servidor backup for selecionado, é definido um tempo limite de 31 segundos. Após este tempo limite o SSSD irá periodicamente tentar re-ligar a um dos servidores primários. Se tiver sucesso, irá substituir o servidor actualmente activo (backup).

source: The Failover Mechanism
pt: O Mecanismo Failover

source: The failover mechanism distinguishes between a machine and a service. The back end first tries to resolve the hostname of a given machine; if this resolution attempt fails, the machine is considered offline. No further attempts are made to connect to this machine for any other service. If the resolution attempt succeeds, the back end tries to connect to a service on this machine. If the service connection attempt fails, then only this particular service is considered offline and the back end automatically switches over to the next service. The machine is still considered online and might still be tried for another service.
pt: O mecanismo failover distingue entre uma máquina e um serviço. O backend primeiro tenta resolver o nome de máquina de uma dada máquina; se esta tentativa de resolução falhar, a máquina é considerada offline. Não são feitas mais tentativas de ligar a esta máquina para qualquer outro serviço. Se a tentativa de resolução tiver sucesso, o backend tenta ligar a um serviço nesta máquina. Se a tentativa de ligação a serviço falhar, então este serviço particular é considerado offline e o backend automaticamente muda para o próximo serviço. A máquina continua a ser considerada online e pode ainda ser tentada para outro serviço.

source: Further connection attempts are made to machines or services marked as offline after a specified period of time; this is currently hard coded to 30 seconds.
pt: São feitas mais tentativas de ligação a máquinas ou serviços marcados como offline após um período de tempo especificado; isto é actualmente duramente codificado a 30 segundos.

source: If there are no more machines to try, the back end as a whole switches to offline mode, and then attempts to reconnect every 30 seconds.
pt: Se não existirem mais máquinas para tentar, o backend muda todos para modo offline, e depois tenta re-ligar a cada 30 segundos.

source: Failover time outs and tuning
pt: Tempo limite e afinação do Failover

source: Resolving a server to connect to can be as simple as running a single DNS query or can involve several steps, such as finding the correct site or trying out multiple host names in case some of the configured servers are not reachable. The more complex scenarios can take some time and SSSD needs to balance between providing enough time to finish the resolution process but on the other hand, not trying for too long before falling back to offline mode. If the SSSD debug logs show that the server resolution is timing out before a live server is contacted, you can consider changing the time outs.
pt: Resolver um servidor a onde ligar pode ser tão simples como correr uma única consulta DNS ou pode invocar vários passos, tais como encontrar o sítio correto ou tentar múltiplos nomes de máquinas no caso de alguns dos servidores configurados não estarem alcançáveis. Os cenários mais complexos podem durar algum tempo e o SSSD precisa de equilibrar entre disponibilizar tempo suficiente para terminar o processo de resolução mas por outro lado, não demorar muito tempo antes de regressar ao modo offline. Se os registos de depuração do SSSD mostrarem que a resolução do servidor atingiu o tempo limite antes de ser contactado um servidor vivo, você pode considerar mudar os tempos limite.

source: Time in milliseconds that sets how long would SSSD talk to a single DNS server before trying next one.
pt: Tempo em milissegundos que define quanto tempo deve o SSSD falar com um único servidor DNS antes de tentar o próximo.

source: Time in seconds to tell how long would SSSD try to resolve single DNS query (e.g. resolution of a hostname or an SRV record) before trying the next hostname or discovery domain.
pt: Tempo em segundos que diz quanto tempo deve o SSSD tentar resolver uma única consulta DNS (ex. resolução de um nome de máquina ou dum registo SRV) antes de tentar o próximo nome de máquina ou domínio de descoberta.

source: How long would SSSD try to resolve a failover service. This service resolution internally might include several steps, such as resolving DNS SRV queries or locating the site.
pt: Quanto tempo deve o SSSD tentar resolver um serviço failover. Esta resolução de serviço internamente pode incluir vários passos, tal como resolver consultas SRV de DNS ou localizar o sítio.

source: This section lists the available tunables. Please refer to their description in the <citerefentry> <refentrytitle>sssd.conf</refentrytitle><manvolnum>5</manvolnum> </citerefentry>, manual page. <placeholder type="variablelist" id="0"/>
pt: Esta secção lista as afinações disponíveis. Por favor consulte as suas descrições no manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle><manvolnum>5</manvolnum> </citerefentry>. <placeholder type="variablelist" id="0"/>

source: For LDAP-based providers, the resolve operation is performed as part of an LDAP connection operation. Therefore, also the <quote>ldap_opt_timeout</quote> timeout should be set to a larger value than <quote>dns_resolver_timeout</quote> which in turn should be set to a larger value than <quote>dns_resolver_op_timeout</quote> which should be larger than <quote>dns_resolver_server_timeout</quote>.
pt: Para provedores baseados em LDAP, a operação de resolução é executada como parte de uma operação de ligação LDAP. Assim, também o tempo limite <quote>ldap_opt_timeout</quote> deve ser definido para um valor maior que <quote>dns_resolver_timeout</quote> que por sua vez deve ser definido para um valor maior que <quote>dns_resolver_op_timeout</quote> o qual deve ser maior que <quote>dns_resolver_server_timeout</quote>.

source: ID MAPPING
pt: MAPEAMENTO DE ID

source: The ID-mapping feature allows SSSD to act as a client of Active Directory without requiring administrators to extend user attributes to support POSIX attributes for user and group identifiers.
pt: A funcionalidade de mapeamento de ID permite ao SSSD actuar como um cliente de Active Directory sem requerer aos administradores estenderem os atributos de utilizador para suportar atributos POSIX para identificadores de utilizador e grupo.

source: NOTE: When ID-mapping is enabled, the uidNumber and gidNumber attributes are ignored. This is to avoid the possibility of conflicts between automatically-assigned and manually-assigned values. If you need to use manually-assigned values, ALL values must be manually-assigned.
pt: NOTA: Quando o mapeamento de ID está activo, os atributos uidNumber e gidNumber são ignorados. Isto é para evitar a possibilidade de conflitos entre valores designados automaticamente e designados manualmente. Se você precisa usar valores designados manualmente, TODOS os valores têm de ser atribuídos manualmente.

source: Please note that changing the ID mapping related configuration options will cause user and group IDs to change. At the moment, SSSD does not support changing IDs, so the SSSD database must be removed. Because cached passwords are also stored in the database, removing the database should only be performed while the authentication servers are reachable, otherwise users might get locked out. In order to cache the password, an authentication must be performed. It is not sufficient to use <citerefentry> <refentrytitle>sss_cache</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> to remove the database, rather the process consists of:
pt: Por favor note que alterar as opções de configuração relacionadas com mapeamento de ID irá fazer com que os IDs de utilizador e grupo mudem. De momento, o SSSD não suporta alterar os IDs, assim a base de dados do SSSD tem de ser removida. Porque as palavras passe em cache são também guardadas na base de dados, remover a base de dados só deve ser feito enquanto os servidores de autenticação estão alcançáveis, caso contrário os utilizadores podem ficar bloqueados de fora. De modo a palavra passe em cache, tem de ser executada uma autenticação. Não é suficiente usar <citerefentry> <refentrytitle>sss_cache</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> para remover a base de dados, em vez disso o processo consiste de:

source: Making sure the remote servers are reachable
pt: Certificar que os servidores remotos são alcançáveis

source: Stopping the SSSD service
pt: Parar serviço SSSD

source: Removing the database
pt: Remover a base de dados

source: Starting the SSSD service
pt: Arrancar o serviço SSSD

source: Moreover, as the change of IDs might necessitate the adjustment of other system properties such as file and directory ownership, it's advisable to plan ahead and test the ID mapping configuration thoroughly.
pt: Mais ainda, como a mudança de IDs pode necessitar de ajustes noutras propriedades do sistema tais como o dono de ficheiros e directórios, é recomendado planear com antecedência e testar a configuração do mapeamento de ID meticulosamente.

source: Mapping Algorithm
pt: Algoritmo de Mapeamento

source: Active Directory provides an objectSID for every user and group object in the directory. This objectSID can be broken up into components that represent the Active Directory domain identity and the relative identifier (RID) of the user or group object.
pt: Active Directory fornece um objectSID para cada objecto utilizador e grupo no directório. Este objectSID pode ser partido em componentes que representam a identidade de domínio Active Directory e o identificador relativo (RID) do objecto utilizador ou grupo.

source: The SSSD ID-mapping algorithm takes a range of available UIDs and divides it into equally-sized component sections - called "slices". Each slice represents the space available to an Active Directory domain.
pt: O algoritmo de mapeamento de ID do SSSD toma uma gama de UIDs disponíveis e divide-a em secções de componente de tamanho igual - chamadas fatias ou "slices"-. Cada fatia representa o espaço disponível para um domínio Active Directory.
