Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: <quote>idp</quote>: Provider for OAuth 2.0/OIDC based authentication. See <citerefentry> <refentrytitle>sssd-idp</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information.
pt: <quote>idp</quote>: Provedor para autenticação baseada em OAuth 2.0/OIDC. Veja <citerefentry> <refentrytitle>sssd-idp</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação.

source: <quote>proxy</quote> for relaying authentication to some other PAM target.
pt: <quote>proxy</quote> para retransmitir a autenticação para outro alvo PAM.

source: <quote>none</quote> disables authentication explicitly.
pt: <quote>none</quote> desactiva explicitamente a autenticação.

source: Default: <quote>id_provider</quote> is used if it is set and can handle authentication requests.
pt: Predefinição: é usado <quote>id_provider</quote> se estiver definido e puder lidar com pedidos de autenticação.

source: The access control provider used for the domain. There are two built-in access providers (in addition to any included in installed backends) Internal special providers are:
pt: O provedor de controlo de acesso usando para este domínio. Existem dois provedores de acesso embutidos (em adição a qualquer incluído em backends instalados). Os provedores especiais internos são:

source: <quote>permit</quote> always allow access.
pt: <quote>permit</quote> permite sempre o acesso.

source: <quote>deny</quote> always deny access.
pt: <quote>deny</quote> nega sempre o acesso.

source: <quote>simple</quote> access control based on access or deny lists. See <citerefentry> <refentrytitle>sssd-simple</refentrytitle> <manvolnum>5</manvolnum></citerefentry> for more information on configuring the simple access module.
pt: <quote>simple</quote> controle de acesso baseado em listas de acesso ou negação. Veja <citerefentry> <refentrytitle>sssd-simple</refentrytitle> <manvolnum>5</manvolnum></citerefentry> para mais informação sobre configuração do módulo de acesso simple.

source: <quote>krb5</quote>: .k5login based access control. See <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum></citerefentry> for more information on configuring Kerberos.
pt: <quote>krb5</quote>: controle de acesso baseado em .k5login. Veja <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum></citerefentry> para mais informação sobre configuração de Kerberos.

source: <quote>proxy</quote> for relaying access control to another PAM module.
pt: <quote>proxy</quote> para retransmitir o controle de acesso para outro módulo PAM.

source: Default: <quote>permit</quote>
pt: Predefinição: <quote>permit</quote>

source: The provider which should handle change password operations for the domain. Supported change password providers are:
pt: O provedor que deverá lidar com operações de mudança de palavra passe para o domínio. Os provedores de mudança de palavra passe suportados são:

source: <quote>ldap</quote> to change a password stored in a LDAP server. See <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring LDAP.
pt: <quote>ldap</quote> para mudar palavra passe guardada num servidor LDAP. Veja <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração do LDAP.

source: <quote>krb5</quote> to change the Kerberos password. See <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring Kerberos.
pt: <quote>krb5</quote> para mudar a palavra passe Kerberos Veja <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração do Kerberos.

source: <quote>proxy</quote> for relaying password changes to some other PAM target.
pt: <quote>proxy</quote> para retransmitir alterações de palavra passe para outro alvo PAM.

source: <quote>none</quote> disallows password changes explicitly.
pt: <quote>none</quote> desautoriza explicitamente mudanças de palavra passe.

source: Default: <quote>auth_provider</quote> is used if it is set and can handle change password requests.
pt: Predefinição: é usado <quote>auth_provider</quote> se estiver definido e puder lidar com pedidos de mudança de palavra passe.

source: The SUDO provider used for the domain. Supported SUDO providers are:
pt: O provedor SUDO usado para o domínio. Provedores SUDO suportados são:

source: <quote>ldap</quote> for rules stored in LDAP. See <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring LDAP.
pt: <quote>ldap</quote> para regras guardadas em LDAP. Veja <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração do LDAP.

source: <quote>ipa</quote> the same as <quote>ldap</quote> but with IPA default settings.
pt: <quote>ipa</quote> o mesmo que <quote>ldap</quote> mas com definições predefinidas de IPA.

source: <quote>ad</quote> the same as <quote>ldap</quote> but with AD default settings.
pt: <quote>ad</quote> o mesmo que <quote>ldap</quote> mas com definições predefinidas de AD.

source: <quote>none</quote> disables SUDO explicitly.
pt: <quote>none</quote> desactiva explicitamente SUDO.

source: Default: The value of <quote>id_provider</quote> is used if it is set and can handle sudo requests.
pt: Predefinição: É usado o valor de <quote>id_provider</quote> se estiver definido.

source: The detailed instructions for configuration of sudo_provider are in the manual page <citerefentry> <refentrytitle>sssd-sudo</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>. There are many configuration options that can be used to adjust the behavior. Please refer to "ldap_sudo_*" in <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
pt: As instruções detalhadas para configuração do sudo_provider estão no manual <citerefentry> <refentrytitle>sssd-sudo</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>. Existem muitas opções de configuração que podem ser usadas para ajustar o comportamento. Por favor consulte "ldap_sudo_*" em <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: <emphasis>NOTE:</emphasis> Sudo rules are periodically downloaded in the background unless the sudo provider is explicitly disabled. Set <emphasis>sudo_provider = None</emphasis> to disable all sudo-related activity in SSSD if you do not want to use sudo with SSSD at all.
pt: <emphasis>NOTA:</emphasis> Regras sudo são descarregadas periodicamente em segundo plano a menos que o provedor sudo esteja explicitamente desactivado. Defina <emphasis>sudo_provider = None</emphasis> para desactivar toda a atividade relacionada com sudo no SSSD se você não quiser de todo usar o sudo com SSSD.

source: The provider which should handle loading of selinux settings. Note that this provider will be called right after access provider ends. Supported selinux providers are:
pt: O provedor que deve lidar com o carregamento de definições selinux. Note que este provedor irá ser chamado logo após o provedor de acesso terminar. Os provedores selinux suportados são:

source: <quote>ipa</quote> to load selinux settings from an IPA server. See <citerefentry> <refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring IPA.
pt: <quote>ipa</quote> para carregar definições selinux de um servidor IPA. Veja <citerefentry> <refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração de IPA.

source: <quote>none</quote> disallows fetching selinux settings explicitly.
pt: <quote>none</quote> desactiva explicitamente o obtenção de definições selinux.

source: Default: <quote>id_provider</quote> is used if it is set and can handle selinux loading requests.
pt: Predefinição: é usado <quote>id_provider</quote> se estiver definido e puder lidar com pedidos de carregamento selinux.

source: The provider which should handle fetching of subdomains. This value should be always the same as id_provider. Supported subdomain providers are:
pt: O provedor que deve lidar com a obtenção de subdomínios. Este valor deve ser o mesmo que id_provider. Os provedores de subdomínio suportados são:

source: <quote>ipa</quote> to load a list of subdomains from an IPA server. See <citerefentry> <refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring IPA.
pt: <quote>ipa</quote> para carregar uma lista de subdomínios de um servidor IPA. Veja <citerefentry> <refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração de IPA.

source: <quote>ad</quote> to load a list of subdomains from an Active Directory server. See <citerefentry> <refentrytitle>sssd-ad</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring the AD provider.
pt: <quote>ad</quote> para carregar uma lista de subdomínios de um servidor Active Directory. Veja <citerefentry> <refentrytitle>sssd-ad</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração de provedor AD.

source: <quote>none</quote> disallows fetching subdomains explicitly.
pt: <quote>none</quote> desactiva explicitamente o obtenção de subdomínios.

source: Default: The value of <quote>id_provider</quote> is used if it is set and can handle subdomain requests.
pt: Predefinição: O valor de <quote>id_provider</quote> é usado se estiver definido e puder lidar com pedidos de sub-domínio.

source: The provider which configures and manages user session related tasks. The only user session task currently provided is the integration with Fleet Commander, which works only with IPA. Supported session providers are:
pt: O provedor que configura e gere tarefas relacionadas com sessões de utilizador. A única tarefa de sessão de utilizador atualmente fornecida é a integração com Fleet Commander, a qual apenas funciona com IPA. Os provedores de sessão suportados são:

source: <quote>ipa</quote> to allow performing user session related tasks.
pt: <quote>ipa</quote> para permitir a execução de tarefas relacionadas com a sessão de utilizador.

source: <quote>none</quote> does not perform any kind of user session related tasks.
pt: <quote>none</quote> não executa nenhum tipo de tarefa relacionada com a sessão de utilizador.

source: The autofs provider used for the domain. Supported autofs providers are:
pt: O provedor de autofs para o domínio. Os provedores autofs suportados são:

source: <quote>ldap</quote> to load maps stored in LDAP. See <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring LDAP.
pt: <quote>ldap</quote> para carregar mapas guardados em LDAP. Veja <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração do LDAP.

source: <quote>ipa</quote> to load maps stored in an IPA server. See <citerefentry> <refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring IPA.
pt: <quote>ipa</quote> para carregar mapas guardados num servidor IPA. Veja <citerefentry> <refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração de IPA.

source: <quote>ad</quote> to load maps stored in an AD server. See <citerefentry> <refentrytitle>sssd-ad</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring the AD provider.
pt: <quote>ad</quote> para carregar mapas guardados num servidor AD. Veja <citerefentry> <refentrytitle>sssd-ad</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração de provedor AD.

source: <quote>none</quote> disables autofs explicitly.
pt: <quote>none</quote> desactiva explicitamente o autofs.

source: Default: The value of <quote>id_provider</quote> is used if it is set and can handle autofs requests.
pt: Predefinição: O valor de <quote>id_provider</quote> é usado se estiver definido e puder lidar com pedidos de autofs.

source: The provider used for retrieving host identity information. Supported hostid providers are:
pt: O provedor usado para obter informação de identidade de máquina. Os provedores hostid suportados são:

source: <quote>ipa</quote> to load host identity stored in an IPA server. See <citerefentry> <refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring IPA.
pt: <quote>ipa</quote> para carregar identidades de máquinas guardadas num servidor IPA. Veja <citerefentry> <refentrytitle>sssd-ipa</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração de IPA.

source: <quote>none</quote> disables hostid explicitly.
pt: <quote>none</quote> desactiva explicitamente hostid.

source: Default: The value of <quote>id_provider</quote> is used if it is set and can handle hostid requests.
pt: Predefinição: O valor de <quote>id_provider</quote> é usado se estiver definido e puder lidar com pedidos de hostid.

source: The provider which should handle hosts and networks lookups. Supported resolver providers are:
pt: O provedor que deverá lidar com pesquisas de máquinas e redes. Os provedores resolver são:

source: <quote>proxy</quote> to forward lookups to another NSS library. See <quote>proxy_resolver_lib_name</quote>
pt: <quote>proxy</quote> para retransmitir pesquisas para outra biblioteca NSS. Veja <quote>proxy_resolver_lib_name</quote>

source: <quote>ldap</quote> to fetch hosts and networks stored in LDAP. See <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring LDAP.
pt: <quote>ldap</quote> para obter máquinas e redes guardadas em LDAP. Veja <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração do LDAP.

source: <quote>ad</quote> to fetch hosts and networks stored in AD. See <citerefentry> <refentrytitle>sssd-ad</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more information on configuring the AD provider.
pt: <quote>ad</quote> para obter máquinas e redes guardadas em AD Veja <citerefentry> <refentrytitle>sssd-ad</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre configuração do provedor AD.

source: <quote>none</quote> disallows fetching hosts and networks explicitly.
pt: <quote>none</quote> desactiva explicitamente a obtenção máquinas e redes.

source: Default: The value of <quote>id_provider</quote> is used if it is set and can handle resolver requests.
pt: Predefinição: O valor de <quote>id_provider</quote> é usado se estiver definido e puder lidar com pedidos de resolvedor.

source: Regular expression for this domain that describes how to parse the string containing user name and domain into these components. The "domain" can match either the SSSD configuration domain name, or, in the case of IPA trust subdomains and Active Directory domains, the flat (NetBIOS) name of the domain.
pt: Expressão regular para este domínio que descreve como converter a string que contém o nome de utilizador e domínio nestes componentes. O "domain" pode corresponder ou ao nome de domínio na configuração do SSSD, ou, no caso de subdomínios de confiança IPA e domínios Active Directory, o nome simples (NetBIOS) do domínio.

source: Default: <quote>^((?P&lt;name&gt;.+)@(?P&lt;domain&gt;[^@]*)|(?P&lt;name&gt;[^@]+))$</quote> which allows two different styles for user names:
pt: Predefinição: <quote>^((?P&lt;name&gt;.+)@(?P&lt;domain&gt;[^@]*)|(?P&lt;name&gt;[^@]+))$</quote> que permite dois estilos diferentes para nomes de utilizador:

source: username
pt: nome de utilizador

source: username@domain.name
pt: nome-utilizador@nome.domínio

source: Default for the AD and IPA provider: <quote>^(((?P&lt;domain&gt;[^\\]+)\\(?P&lt;name&gt;.+))|((?P&lt;name&gt;.+)@(?P&lt;domain&gt;[^@]+))|((?P&lt;name&gt;[^@\\]+)))$</quote> which allows three different styles for user names:
pt: Predefinido para provedores AD e IPA: <quote>^(((?P&lt;domain&gt;[^\\]+)\\(?P&lt;name&gt;.+))|((?P&lt;name&gt;.+)@(?P&lt;domain&gt;[^@]+))|((?P&lt;name&gt;[^@\\]+)))$</quote> os quais permitem três estilos diferentes para nomes de utilizador:

source: domain\username
pt: domínio\nome-utilizador

source: While the first two correspond to the general default the third one is introduced to allow easy integration of users from Windows domains.
pt: Enquanto os duas primeiras correspondem às predefinições gerais a terceira é introduzida para permitir integração fácil de utilizadores de domínios Windows.

source: The default re_expression uses the <quote>@</quote> character as a separator between the name and the domain. As a result of this setting the default does not accept the <quote>@</quote> character in short names (as it is allowed in Windows group names). If a user wishes to use short names with <quote>@</quote> they must create their own re_expression.
pt: A re-expressão predefinida usa o caractere <quote>@</quote> como separador entre o nome e o domínio. Como resultado desta definição a predefinição não aceita o caractere <quote>@</quote> em nomes curtos (coo é permitido nos nomes de grupo do Windows). Se um utilizador desejar usar nomes com <quote>@</quote> ele tem de criar a sua própria re-expressão.

source: Default: <quote>%1$s@%2$s</quote>.
pt: Predefinição: <quote>%1$s@%2$s</quote>.

source: Provides the ability to select preferred address family to use when performing DNS lookups.
pt: Fornece a habilidade de selecionar famílias de endereços preferidos a usar quando executa pesquisas DNS.

source: Supported values:
pt: Valores suportados:

source: ipv4_first: Try looking up IPv4 address, if that fails, try IPv6
pt: ipv4_first: Tenta pesquisar endereços IPv4, se isso falhar, tenta IPv6

source: ipv4_only: Only attempt to resolve hostnames to IPv4 addresses.
pt: ipv4_only: Apenas tenta resolver nomes-de-máquinas em endereços IPv4.

source: ipv6_first: Try looking up IPv6 address, if that fails, try IPv4
pt: ipv6_first: Tenta pesquisar endereços IPv6, se isso falhar, tenta IPv4

source: ipv6_only: Only attempt to resolve hostnames to IPv6 addresses.
pt: ipv6_only: Apenas tenta resolver nomes-de-máquinas em endereços IPv6.

source: Default: ipv4_first
pt: Predefinição: ipv4_first

source: dns_resolver_server_timeout (integer)
pt: dns_resolver_server_timeout (inteiro)

source: Defines the amount of time (in milliseconds) SSSD would try to talk to DNS server before trying next DNS server.
pt: Define a quantidade de tempo (em milissegundos) que o SSSD deve tentar falar com o servidor DNS antes de tentar o próximo servidor DNS.

source: The AD provider will use this option for the CLDAP ping timeouts as well.
pt: O provedor AD irá também usar esta opção para o tempo limite de ping CLDAP.

source: Please see the section <quote>FAILOVER</quote> for more information about the service resolution.
pt: Por favor veja a secção <quote>FAILOVER</quote> para mais informação sobre a resolução de serviço.

source: Default: 1000
pt: Predefinição: 1000

source: Defines the amount of time (in seconds) to wait to resolve single DNS query (e.g. resolution of a hostname or an SRV record) before trying the next hostname or DNS discovery.
pt: Define a quantidade de tempo (em segundos) a esperar para resolver consultas DNS únicas (ex. resolução de um nome de máquina ou um registo SRV) antes de tentar o próximo nome de máquina ou descoberta DNS.

source: Default: 3
pt: Predefinição: 3

source: dns_resolver_timeout (integer)
pt: dns_resolver_timeout (inteiro)

source: Defines the amount of time (in seconds) to wait for a reply from the internal fail over service before assuming that the service is unreachable. If this timeout is reached, the domain will continue to operate in offline mode.
pt: Define a quantidade de tempo (em segundos) a esperar por resposta do serviço interno fail over antes de assumir que o serviço está fora de alcance. Se este tempo limite for alcançado, o domínio irá continuar a operar em modo offline.

source: dns_resolver_use_search_list (bool)
pt: dns_resolver_use_search_list (booleano)

source: Normally, the DNS resolver searches the domain list defined in the "search" directive from the resolv.conf file. This can lead to delays in environments with improperly configured DNS.
pt: Normalmente, o resolvedor DNS sonda a lista de domínios definida na diretiva "search" do ficheiro resolv.conf. Isto pode levar a atrasos em ambientes com DNS configurado de modo inapropriado.

source: If fully qualified domain names (or _srv_) are used in the SSSD configuration, setting this option to FALSE can prevent unnecessary DNS lookups in such environments.
pt: Se nomes de domínio totalmente qualificados (ou _srv_) forem usados na configuração do SSSD, definir esta opção para FALSE pode prevenir pesquisas DNS desnecessárias em tais ambientes.

source: Default: TRUE
pt: Predefinição: TRUE

source: If service discovery is used in the back end, specifies the domain part of the service discovery DNS query.
pt: Se o serviço de descoberta for usado no backend, especifica a parte de domínio da consulta DNS de descoberta de serviço.

source: Default: Use the domain part of machine's hostname
pt: Predefinição: Usa a parte de domínio do nome-de-máquina das máquinas

source: failover_primary_timeout (integer)
pt: failover_primary_timeout (inteiro)

source: When no primary server is available, SSSD fails over to a backup server. This option defines the number of seconds SSSD waits before attempting to reconnect to the primary server.
pt: Quando nenhum servidor primário está disponível, o SSSD cai para um servidor de salvaguarda. Esta opção define o número de segundos que o SSSD espera antes de tentar se re-ligar ao servidor principal.

source: Note: The minimum value is 31.
pt: Nota: O valor mínimo é 31.

source: Default: 31
pt: Predefinição: 31

source: override_gid (integer)
pt: override_gid (inteiro)

source: Override the primary GID value with the one specified.
pt: Sobrepõe o valor GID principal com o que é especificado.

source: Case sensitive. This value is invalid for AD provider.
pt: Sensível a maiúsculas/minúsculas. Este valor é inválido para provedor AD.

source: Case insensitive.
pt: Insensível a maiúsculas/minúsculas.

source: Same as False (case insensitive), but does not lowercase names in the result of NSS operations. Note that name aliases (and in case of services also protocol names) are still lowercased in the output.
pt: O mesmo que False (Insensível a maiúsculas/minúsculas), mas não reduz a minúsculas os nomes no resultado da operação NSS. Note que nomes alternativos (e no caso de serviços também nomes de protocolos) são na mesma reduzidos a minúsculas nos resultados.

source: If you want to set this value for trusted domain with IPA provider, you need to set it on both the client and SSSD on the server.
pt: Se você desejar definir este valor para domínio de confiança com provedor IPA, você precisa de defini-lo em ambos o cliente e no SSSD no servidor.

source: Treat user and group names as case sensitive. Possible option values are: <placeholder type="variablelist" id="0"/>
pt: Trata nomes de utilizador e grupo como sensível a maiúsculas/minúsculas. Os valores de opção possíveis são: <placeholder type="variablelist" id="0"/>

source: Default: True (False for AD provider)
pt: Predefinição: True (False para provedor AD)
