Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: The user account has expired.
pt: A conta do utilizador expirou.

source: Unable to fetch IPA Desktop Profile rules or user info.
pt: Incapaz de obter regras IPA Desktop Profile ou informação do utilizador.

source: Unable to retrieve Kerberos user credentials.
pt: Incapaz de obter credenciais de utilizador do Kerberos.

source: No authentication method was found by Kerberos. This might happen if the user has a Smartcard assigned but the pkint plugin is not available on the client.
pt: Nenhum método de autenticação encontrado pelo Kerberos. Isto pode acontecer se o utilizador tiver uma Smartcard assinada mas o plugin pkint não está disponível no cliente.

source: Conversation failure.
pt: Falha de conversação.

source: No KDC suitable for password change is available.
pt: Nenhum KDC apropriado disponível para mudança de palavra passe.

source: Unknown PAM call.
pt: Chamada PAM desconhecida.

source: Unsupported PAM task or command.
pt: Tarefa ou comando PAM não suportado.

source: The authentication module cannot handle Smartcard credentials.
pt: O módulo de autenticação não é capaz de lidar com credenciais Smartcard.

source: FILES
pt: FICHEIROS

source: If a password reset by root fails, because the corresponding SSSD provider does not support password resets, an individual message can be displayed. This message can e.g. contain instructions about how to reset a password.
pt: Se um reset de palavra passe pelo root falhar, porque o provedor SSSD correspondente não suporta resets de palavras passe, pode ser mostrada uma mensagem individual. A mensagem pode, por exemplo, conter instruções sobre como fazer reset à palavra passe.

source: The message is read from the file <filename>pam_sss_pw_reset_message.LOC</filename> where LOC stands for a locale string returned by <citerefentry> <refentrytitle>setlocale</refentrytitle><manvolnum>3</manvolnum> </citerefentry>. If there is no matching file the content of <filename>pam_sss_pw_reset_message.txt</filename> is displayed. Root must be the owner of the files and only root may have read and write permissions while all other users must have only read permissions.
pt: A mensagem é lida do ficheiro <filename>pam_sss_pw_reset_message.LOC</filename> onde LOC significa uma string de locale retornado por <citerefentry> <refentrytitle>setlocale</refentrytitle><manvolnum>3</manvolnum> </citerefentry>. Se não existir ficheiro correspondente é mostrado o conteúdo de <filename>pam_sss_pw_reset_message.txt</filename>. O root tem de ser o dono dos ficheiros e apenas o root pode ter permissões de leitura e escrita enquanto todos os outros utilizadores só podem ter permissões de leitura.

source: These files are searched in the directory <filename>/etc/sssd/customize/DOMAIN_NAME/</filename>. If no matching file is present a generic message is displayed.
pt: Estes ficheiros são procurados no directório <filename>/etc/sssd/customize/NOME_DOMÍNIO/</filename>. Se não estiver presente nenhum ficheiro correspondente, é mostrada uma mensagem genérica.

source: PAM module for SSSD GSSAPI authentication
pt: Módulo PAM para autenticação GSSAPI do SSSD

source: <command>pam_sss_gss.so</command> authenticates user over GSSAPI in cooperation with SSSD.
pt: <command>pam_sss_gss.so</command> autentica o utilizador sobre GSSAPI em cooperação com o SSSD.

source: This module will try to authenticate the user using the GSSAPI hostbased service name host@hostname which translates to host/hostname@REALM Kerberos principal. The <emphasis>REALM</emphasis> part of the Kerberos principal name is derived by Kerberos internal mechanisms and it can be set explicitly in configuration of [domain_realm] section in /etc/krb5.conf.
pt: Este módulo irá tentar autenticar o utilizador usando nome de serviço baseado-em-maquina do GSSAPI host@hostname o que traduz para host/hostname@REALM principal do Kerberos. A parte <emphasis>REALM</emphasis> do nome principal Kerberos é derivada pelos mecanismos internos do Kerberos e pode ser definida explicitamente na configuração da secção [domain_realm] em /etc/krb5.conf.

source: SSSD is used to provide desired service name and to validate the user's credentials using GSSAPI calls. If the service ticket is already present in the Kerberos credentials cache or if user's ticket granting ticket can be used to get the correct service ticket then the user will be authenticated.
pt: SSSD é usado para fornecer o nome de serviço desejado e para validar as credenciais do utilizador usando chamadas GSSAPI. Se o bilhete de serviço já estiver presente na cache de credenciais do Kerberos ou o bilhete do utilizador puder ser usado para obter o bilhete do serviço correto então o utilizador será autenticado.

source: If <option>pam_gssapi_check_upn</option> is True (default) then SSSD requires that the credentials used to obtain the service tickets can be associated with the user. This means that the principal that owns the Kerberos credentials must match with the user principal name as defined in LDAP.
pt: Se <option>pam_gssapi_check_upn</option> for True (predefinição) então o SSSD requer que as credenciais usadas para obter o bilhete de serviço possam ser associadas com o utilizador. Isto significa que o principal que possui as credenciais Kerberos tem de corresponder ao nome principal do utilizador como definido em LDAP.

source: To enable GSSAPI authentication in SSSD, set <option>pam_gssapi_services</option> option in [pam] or domain section of sssd.conf. The service credentials need to be stored in SSSD's keytab (it is already present if you use ipa or ad provider). The keytab location can be set with <option>krb5_keytab</option> option. See <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> and <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for more details on these options.
pt: Para activar a autenticação GSSAPI no SSSD, defina a opção <option>pam_gssapi_services</option> em [pam] ou secção domain do sssd.conf. As credenciais de serviços precisam de ser guardadas na keytab do SSSD (já está presente se usar o provedor ipa ou ad). A localização da keytab pode ser definida com a opção <option>krb5_keytab</option>. Veja <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> e <citerefentry> <refentrytitle>sssd-krb5</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais detalhes sobre estas opções.

source: Some Kerberos deployments allow to associate authentication indicators with a particular pre-authentication method used to obtain the ticket granting ticket by the user. <command>pam_sss_gss.so</command> allows to enforce presence of authentication indicators in the service tickets before a particular PAM service can be accessed.
pt: Alguns desenvolvimentos Kerberos permitem associar indicadores de autenticação com um método particular de pré-autenticação usado para obter um bilhete de concessão de bilhete pelo utilizador. O <command>pam_sss_gss.so</command> permite forçar a presença de indicadores de autenticação nos bilhetes de serviço antes de que se possa aceder a um serviço particular do PAM.

source: If <option>pam_gssapi_indicators_map</option> is set in the [pam] or domain section of sssd.conf, then SSSD will perform a check of the presence of any configured indicators in the service ticket.
pt: Se a opção <option>pam_gssapi_indicators_map</option> estiver definida em [pam] ou secção domain do sssd.conf, então o SSSD irá executar uma verificação da presença de quaisquer indicadores configurados no bilhete de serviço.

source: Print debugging information.
pt: Escreve informação de depuração.

source: Only the <option>auth</option> module type is provided.
pt: Apenas se o tipo de módulo <option>auth</option> for fornecido.

source: The user is not known to the authentication service or the GSSAPI authentication is not supported.
pt: O utilizador não é conhecido pelo serviço de autenticação ou a autenticação GSSAPI não é suportada.

source: Authentication failure.
pt: Falha de autenticação.

source: The main use case is to provide password-less authentication in sudo but without the need to disable authentication completely. To achieve this, first enable GSSAPI authentication for sudo in sssd.conf:
pt: O principal caso de uso é fornecer autenticação sem palavra passe no sudo mas sem a necessidade de desactivar completamente a autenticação. Para conseguir isto, primeiro active a autenticação GSSAPI para o sudo no sssd.conf:

source: And then enable the module in desired PAM stack (e.g. /etc/pam.d/sudo and /etc/pam.d/sudo-i).
pt: E depois active o módulo na pilha PAM desejada (ex. /etc/pam.d/sudo e /etc/pam.d/sudo-i).

source: TROUBLESHOOTING
pt: RESOLUÇÃO DE PROBLEMAS

source: SSSD logs, pam_sss_gss debug output and syslog may contain helpful information about the error. Here are some common issues:
pt: Registos do SSSD, a saída de depuração do pam_sss_gss e o syslog podem conter informação auxiliar acerca do erro. Aqui estão alguns problemas comuns:

source: 1. I have KRB5CCNAME environment variable set and the authentication does not work: Depending on your sudo version, it is possible that sudo does not pass this variable to the PAM environment. Try adding KRB5CCNAME to <option>env_keep</option> in /etc/sudoers or in your LDAP sudo rules default options.
pt: 1. Eu tenho a variável de ambiente KRB5CCNAME definida e a autenticação não funciona: Dependendo da sua versão de sudo, é possível que o sudo não passe esta variável para o ambiente PAM. Tente adicionar KRB5CCNAME a <option>env_keep</option> em /etc/sudoers ou nas suas opções predefinidas de regras sudo do LDAP.

source: 2. Authentication does not work and syslog contains "Server not found in Kerberos database": Kerberos is probably not able to resolve correct realm for the service ticket based on the hostname. Try adding the hostname directly to <option>[domain_realm]</option> in /etc/krb5.conf like so:
pt: 2. Autenticação não funciona e o syslog contém "Servidor não encontrado na base de dados do Kerberos": Provavelmente o Kerberos não é capaz de resolver o reino correctamente para o bilhete de serviço baseado no nome de máquina. Tente adicionar o nome de máquina directamente a <option>[domain_realm]</option> em /etc/krb5.conf tal como:

source: 3. Authentication does not work and syslog contains "No Kerberos credentials available": You don't have any credentials that can be used to obtain the required service ticket. Use kinit or authenticate over SSSD to acquire those credentials.
pt: 3. Autenticação não funciona e o syslog contém "Nenhuma credencial do Kerberos disponível": Você não tem nenhumas credenciais que possam ser usadas obter o bilhete de serviço requerido. Use o kinit ou autentique-se sobre o SSSD para adquirir essas credenciais.

source: 4. Authentication does not work and SSSD sssd-pam log contains "User with UPN [$UPN] was not found." or "UPN [$UPN] does not match target user [$username].": You are using credentials that can not be mapped to the user that is being authenticated. Try to use kswitch to select different principal, make sure you authenticated with SSSD or consider disabling <option>pam_gssapi_check_upn</option>.
pt: 4. Autenticação não funciona e o registo sssd-pam do SSSD contém "Utilizador com UPN [$UPN] não foi encontrado." ou "UPN [$UPN] não corresponde ao utilizador alvo [$username].": Você está a usar credenciais que não podem ser mapeadas ao utilizador que está a ser autenticado. Tente usar o kswitch para selecionar um principal diferente, certifique-se que se autentica com o SSSD ou considere desactivar <option>pam_gssapi_check_upn</option>.

source: Kerberos locator plugin
pt: Plugin locador do Kerberos

source: The Kerberos locator plugin <command>sssd_krb5_locator_plugin</command> is used by libkrb5 to find KDCs for a given Kerberos realm. SSSD provides such a plugin to guide all Kerberos clients on a system to a single KDC. In general it should not matter to which KDC a client process is talking to. But there are cases, e.g. after a password change, where not all KDCs are in the same state because the new data has to be replicated first. To avoid unexpected authentication failures and maybe even account lockings it would be good to talk to a single KDC as long as possible.
pt: O plugin locador do Kerberos <command>sssd_krb5_locator_plugin</command> é usado pela libkrb5 para encontrar KDCs para um dado reino Kerberos. O SSSD fornece tal plugin para guiar todos os clientes Kerberos num sistema para um único KDC. Em geral não deve ter importância para qual KDC um processo cliente está a falar. Mas existem casos, ex. após uma mudança de palavra passe, onde nem todos os KDCs estão no mesmo estado porque os novos dados têm primeiro de ser replicados. Para evitar falhas de autenticação inesperadas e talvez até contas bloqueadas, será bom falar com um único KDC o maior tempo possível.

source: libkrb5 will search the locator plugin in the libkrb5 sub-directory of the Kerberos plugin directory, see plugin_base_dir in <citerefentry> <refentrytitle>krb5.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for details. The plugin can only be disabled by removing the plugin file. There is no option in the Kerberos configuration to disable it. But the SSSD_KRB5_LOCATOR_DISABLE environment variable can be used to disable the plugin for individual commands. Alternatively the SSSD option krb5_use_kdcinfo=False can be used to not generate the data needed by the plugin. With this the plugin is still called but will provide no data to the caller so that libkrb5 can fall back to other methods defined in krb5.conf.
pt: A libkrb5 irá procurar o plugin locador no sub-directório libkrb5 do directório plugin do Kerberos, veja plugin_base_dir em <citerefentry> <refentrytitle>krb5.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para detalhes. O plugin só pode ser desactivado ao se remover o ficheiro do plugin. Não existe opção na configuração do Kerberos para o desactivar. Mas a variável de ambiente SSSD_KRB5_LOCATOR_DISABLE pode ser usada para desactivar o plugin para comandos individuais. Em alternativa a opção do SSSD krb5_use_kdcinfo=False pode ser usada para não gerar os dados necessários pelo plugin. Com isto o plugin é ainda chamado mas não irá fornecer nenhuns dados ao chamador para que a libkrb5 possa cair para outros métodos definidos em krb5.conf.

source: The plugin reads the information about the KDCs of a given realm from a file called <filename>kdcinfo.REALM</filename>. The file should contain one or more DNS names or IP addresses either in dotted-decimal IPv4 notation or the hexadecimal IPv6 notation. An optional port number can be added to the end separated with a colon, the IPv6 address has to be enclosed in squared brackets in this case as usual. Valid entries are:
pt: O plugin lê a informação acerca dos KDCs de um dado reino a partir de um ficheiro chamado <filename>kdcinfo.REINO</filename>. O ficheiro deve conter um ou mais nomes de DNS ou endereços IP seja em notação IPv4 decimal-pontuado ou a notação IPv6 hexadecimal. Um numero de porto opcional pode ser adicionado ao final separado pelo caractere dois pontos, o endereço IPv6 tem de ficar dentro de parênteses rectos neste caso como usual. As entradas válidas são:

source: SSSD's krb5 auth-provider which is used by the IPA and AD providers as well adds the address of the current KDC or domain controller SSSD is using to this file.
pt: Provedor de autenticação krb5 do SSSD o qual é usado pelos provedores IPA e AD assim como adiciona os endereços do KDC actual ou controlador de domínio que o SSSD está usar para este ficheiro.

source: In environments with read-only and read-write KDCs where clients are expected to use the read-only instances for the general operations and only the read-write KDC for config changes like password changes a <filename>kpasswdinfo.REALM</filename> is used as well to identify read-write KDCs. If this file exists for the given realm the content will be used by the plugin to reply to requests for a kpasswd or kadmin server or for the MIT Kerberos specific master KDC. If the address contains a port number the default KDC port 88 will be used for the latter.
pt: Em ambientes com KDCs só-leitura e leitura-escrita onde se espera que os clientes usem as instâncias só-leitura para as operações gerais e apenas o KDC de leitura-escrita para mudanças de configuração como mudanças de palavra passe, é usado um <filename>kpasswdinfo.REALM</filename> também identificar os KDCs de leitura-escrita. Se este ficheiro existir para o reino fornecido, o conteúdo será usado pelo plugin para responder a pedidos para um servidor kpasswd ou kadmin ou para o mestre KDC específico do MIT Kerberos. Se o endereço conter um número de porto o porto 88 predefinido do KDC será usado para o posterior.

source: Not all Kerberos implementations support the use of plugins. If <command>sssd_krb5_locator_plugin</command> is not available on your system you have to edit /etc/krb5.conf to reflect your Kerberos setup.
pt: Nem todas as implementações de Kerberos suportam o uso de plugins. Se <command>sssd_krb5_locator_plugin</command> não estiver disponível no seu sistema você tem de editar /etc/krb5.conf para refletir a sua configuração de Kerberos.

source: If the environment variable SSSD_KRB5_LOCATOR_DEBUG is set to any value debug messages will be sent to stderr.
pt: Se a variável de ambiente SSSD_KRB5_LOCATOR_DEBUG estiver definida para qualquer valor as mensagens de depuração são enviadas para o stderr.

source: If the environment variable SSSD_KRB5_LOCATOR_DISABLE is set to any value the plugin is disabled and will just return KRB5_PLUGIN_NO_HANDLE to the caller.
pt: Se a variável de ambiente SSSD_KRB5_LOCATOR_DISABLE estiver definida para qualquer valor o plugin é desactivado e irá apenas retornar KRB5_PLUGIN_NO_HANDLE ao chamador.

source: If the environment variable SSSD_KRB5_LOCATOR_IGNORE_DNS_FAILURES is set to any value plugin will try to resolve all DNS names in kdcinfo file. By default plugin returns KRB5_PLUGIN_NO_HANDLE to the caller immediately on first DNS resolving failure.
pt: Se a variável de ambiente SSSD_KRB5_LOCATOR_IGNORE_DNS_FAILURES estiver definida para qualquer valor o plugin irá tentar resolver todos os nomes DNS no ficheiro kdcinfo. Por predefinição o plugin retorna KRB5_PLUGIN_NO_HANDLE ao chamador imediatamente na primeira falha ao resolver DNS.

source: the configuration file for SSSD's 'simple' access-control provider
pt: o ficheiro de configuração para provedor de controle de acesso 'simples' do SSSD

source: This manual page describes the configuration of the simple access-control provider for <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. For a detailed syntax reference, refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page.
pt: Este manual descreve a configuração do provedor de controlo-de-acesso simples para <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Para uma referência detalhada da sintaxe, consulte a secção <quote>FORMATO DE FICHEIRO</quote> do manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: The simple access provider grants or denies access based on an access or deny list of user or group names.
pt: O provedor de acesso simples concede ou nega acesso com base numa lista de acesso ou negação de nomes de utilizadores e grupos.

source: Groups from other domains configured in sssd.conf, even if the simple access provider is used there as well, and groups managed outside of SSSD are not evaluated.
pt: Grupos de outros domínios configurados no sssd.conf, mesmo que o provedor de acesso simple seja usado lá também, e grupos geridos fora do SSSD não são avaliados.

source: The following rules apply:
pt: Aplicam-se as seguintes regras:

source: It is not recommended to leave an option empty, it might cause errors. If you want to allow all users, do not specify any `simple_allow_users` or `simple_allow_groups`.
pt: Não é recomendado deixar esta opção vazia, pode casuar erros. Se deseja permitir todos os utilizadores, não especifique nenhum `simple_allow_users` ou `simple_allow_groups`.

source: If any list is provided, the order of evaluation is: allow → deny. This means that any matching deny rule will supersede any matched allow rule.
pt: Se alguma lista for fornecida, a ordem de avaliação é: permitir -> negar. Isto significa que qualquer regra de negação correspondente irá sobrepor qualquer regra de permissão correspondente.

source: If either or both "allow" lists are provided, all users are denied unless they appear in at least one of these lists (OR condition).
pt: Se uma ou ambas listas "allow" forem fornecidas, todos os utilizadores têm o acesso negado a menos que apareçam pelo menos em uma destas listas (condição OU).

source: If either or both "deny" lists are provided, all users are granted access unless they appear in at least one of these lists (OR condition).
pt: Se uma ou ambas listas "deny" forem fornecidas, todos os utilizadores têm acesso concedido a menos que apareçam em pelo menos uma destas na listas (condição OU).

source: Comma-separated list of users who are allowed to log in. If this option is specified, all other users are denied unless they are members of groups listed in`simple_allow_groups`.
pt: Lista separada por vírgulas de utilizadores que têm permissão de fazer login. Se esta opção for especificada, todos os outros utilizadores são negados a menos que sejam membros dos grupos listados em `simple_allow_groups`.

source: Comma-separated list of users who are explicitly denied access. If this option is specified, these users will be denied regardless of whether they appear in `simple_allow_users` or `simple_allow_groups`.
pt: Lista de utilizadores separados por vírgulas a quem foi explicitamente negado o acesso. Se esta opção for especificada, estes utilizadores serão negados independentemente de eles aparecerem em `simple_allow_users` ou `simple_allow_groups`.

source: OR Logic Applies: A user will be denied access if they are listed in `simple_deny_users` or if they are a member of a group in `simple_deny_groups`.
pt: Aplica-se Lógica OR: Um utilizador terá acesso negado se estiver listado em `simple_deny_users` ou se for membro de um grupo em `simple_deny_groups`.

source: Comma-separated list of groups that are allowed to log in. If this option is specified, all other users are denied unless they are explicitly listed in `simple_allow_users`.
pt: Lista de grupos separados por vírgulas que têm permissão de login. Se esta opção for especificada, todos os outros utilizadores são negados a menos que estejam explicitamente listados em `simple_allow_users`.

source: OR Logic Applies: A user can log in if they are listed in `simple_allow_users` or if they belong to a group in `simple_allow_groups`.
pt: Aplica-se Lógica OR: Um utilizador pode fazer login se estiver listado em `simple_allow_users` ou se pertencer a um grupo em `simple_allow_groups`.

source: This applies only to groups within this SSSD domain. Local groups are not evaluated.
pt: Isto aplica-se apenas aos grupos dentro deste domínio SSSD. Os grupos locais não são avaliados.

source: Comma-separated list of groups that are explicitly denied access. This applies only to groups within this SSSD domain. Local groups are not evaluated.
pt: Lista separada por vírgulas de grupos que têm negação de acesso explícita. Isto aplica-se apenas aos grupos dentro deste domínio SSSD. Os grupos locais não são avaliados.
