Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: Users, groups and other entities served by SSSD are always treated as case-insensitive in the AD provider for compatibility with Active Directory's LDAP implementation.
pt: Utilizadores, grupos e outras entidades servidas pelo SSSD são sempre tratadas com insensibilidade a maiúsculas/minúsculas no provedor AD para compatibilidade com a implementação LDAP do Active Directory.

source: SSSD only resolves Active Directory Security Groups. For more information about AD group types see: <ulink url="https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/manage/understand-security-groups"> Active Directory security groups</ulink>
pt: SSSD apenas resolve Grupos de Segurança Active Directory. Para mais informação sobre tipos de grupo AD veja: <ulink url="https://docs.microsoft.com/en-us/windows-server/identity/ad-ds/manage/understand-security-groups"> Grupos de segurança Active Directory</ulink>

source: SSSD filters out Domain Local groups from remote domains in the AD forest. By default they are filtered out e.g. when following a nested group hierarchy in remote domains because they are not valid in the local domain. This is done to be in agreement with Active Directory's group-membership assignment which can be seen in the PAC of the Kerberos ticket of a user issued by Active Directory.
pt: SSSD filtra e separa grupos Domain Local de domínios remotos na floresta AD. Por predefinição eles são filtrados por ex quando se segue uma hierarquia de grupo aninhado em domínios remotos porque eles não são válidos no domínio local. Isto é feito para se estar de acordo com a atribuição de membros de grupo de Active Directory que pode ser visto no PAC do bilhete Kerberos dum utilizador publicado por Active Directory.

source: Specifies the name of the Active Directory domain. This is optional. If not provided, the configuration domain name is used.
pt: Especifica o nome do domínio Active Directory. Isto é opcional. Se não for fornecido, é usado o nome de domínio da configuração.

source: For proper operation, this option should be specified as the lower-case version of the long version of the Active Directory domain.
pt: Para operação apropriada, esta opção deve ser especificada como a versão curta da versão longa do domínio Active Directory.

source: The short domain name (also known as the NetBIOS or the flat name) is autodetected by the SSSD.
pt: O nome de domínio curto (também conhecido como NetBIOS ou nome liso) é auto-detectado pelo SSSD.

source: A comma-separated list of enabled Active Directory domains. If provided, SSSD will ignore any domains not listed in this option. If left unset, all discovered domains from the AD forest will be available.
pt: Uma lista separada por vírgulas de domínios Active Directory activos. Se fornecida, o SSSD irá ignorar quaisquer domínios não listados nesta opção. Se deixada por definir, todos os domínios da floresta AD irão estar disponíveis.

source: During the discovery of the domains SSSD will filter out some domains where flags or attributes indicate that they do not belong to the local forest or are not trusted. If ad_enabled_domains is set, SSSD will try to enable all listed domains.
pt: Durante a descoberta de domínios, o SSSD irá filtrar alguns domínios onde as bandeiras ou atributos indicam que eles não pertencem à floresta local ou não são de confiança. Se ad_enabled_domains estiver definido, o SSSD irá tentar ativar todos os domínios listados.

source: For proper operation, this option must be specified in all lower-case and as the fully qualified domain name of the Active Directory domain. For example: <placeholder type="programlisting" id="0"/>
pt: Para operação apropriada, esta opção tem de ser especificada toda em minúsculas e como o nome de domínio totalmente qualificado do domínio Active Directory. Por exemplo: <placeholder type="programlisting" id="0"/>

source: The short domain name (also known as the NetBIOS or the flat name) will be autodetected by SSSD.
pt: O nome de domínio curto (também conhecido como NetBIOS ou nome liso) será auto-detectado pelo SSSD.

source: The comma-separated list of hostnames of the AD servers to which SSSD should connect in order of preference. For more information on failover and server redundancy, see the <quote>FAILOVER</quote> section.
pt: A lista separada por vírgulas de nomes de máquinas dos servidores AD aos quais o SSSD deve ligar por ordem de preferência. Consulte a secção <quote>FAILOVER</quote> para mais informação sobre failover e redundância de serviços.

source: This is optional if autodiscovery is enabled. For more information on service discovery, refer to the <quote>SERVICE DISCOVERY</quote> section.
pt: Isto é opcional se a auto-descoberta estiver activa. Para mais informação sobre descoberta de serviços, consulte a secção <quote>DESCOBERTA DE SERVIÇOS</quote>.

source: Note: Trusted domains will always auto-discover servers even if the primary server is explicitly defined in the ad_server option.
pt: Nota: Domínios de confiança irão sempre auto-descobrir servidores mesmo que o servidor primário esteja explicitamente definido na opção ad_server.

source: Optional. On machines where the hostname(5) does not reflect the fully qualified name, sssd will try to expand the short name. If it is not possible or the short name should be really used instead, set this parameter explicitly.
pt: Opcional. Em máquinas onde o nome-de-máquina(5) não reflete o nome qualificado completo, o sssd irá tentar expandir o nome curto. Se tal não for possível ou se é o nome curto que deve realmente ser usado, defina este parâmetro explicitamente.

source: This field is used to determine the host principal in use in the keytab and to perform dynamic DNS updates. It must match the hostname for which the keytab was issued.
pt: Este campo é usado para determinar a principal máquina em uso na keytab e para executar actualizações DNS dinâmicas. Tem de corresponder ao nome de máquina para a qual a keytab foi emitida.

source: ad_enable_dns_sites (boolean)
pt: ad_enable_dns_sites (booleano)

source: Enables DNS sites - location based service discovery.
pt: Activa sítios DNS - descoberta de serviços baseada em localização.

source: If true and service discovery (see Service Discovery paragraph at the bottom of the man page) is enabled, the SSSD will first attempt to discover the Active Directory server to connect to using the Active Directory Site Discovery and fall back to the DNS SRV records if no AD site is found. The DNS SRV configuration, including the discovery domain, is used during site discovery as well.
pt: Se true e a descoberta de serviços (veja o parágrafo Descoberta de Serviços no fundo do manual) estiver activa, o SSSD irá primeiro tentar descobrir o servidor Active Directory onde ligar para usar o Active Directory Site Discovery e cair para os registos DNS SRV se nenhum sítio AD for encontrado. A configuração DNS SRV, incluindo o domínio de descoberta, é usada também durante a descoberta de sítios.

source: Specifies an LDAP access control filter that a user must match to gain access. The <quote>access_provider</quote> option must be explicitly set to <quote>ad</quote> for this option to take effect. If you want to use the <quote>ad_access_filter</quote> as the only access control scheme, you must disable GPO based access control (see option <quote>ad_gpo_access_control</quote> for details).
pt: Especifica um filtro de controle de acesso LDAP que o utilizador tem de corresponder para obter acesso. A opção <quote>access_provider</quote> tem de ser explicitamente definida para <quote>ad</quote> para esta opção ter efeito. Se você desejar usar o <quote>ad_access_filter</quote> como único esquema de controle de acesso, você tem de desativar o controle de acesso baseado em GPO (veja a opção <quote>ad_gpo_access_control</quote> para detalhes).

source: The option also supports specifying different filters per domain or forest. This extended filter would consist of: <quote>KEYWORD:NAME:FILTER</quote>. The keyword can be either <quote>DOM</quote>, <quote>FOREST</quote> or missing.
pt: A opção também suporta especificar filtros diferentes por domínio ou floresta. Este filtro estendido irá consistir de <quote>KEYWORD:NAME:FILTER</quote>. A palavra chave pode ser ou <quote>DOM</quote>, <quote>FOREST</quote> ou estar em falta.

source: If the keyword equals to <quote>DOM</quote> or is missing, then <quote>NAME</quote> specifies the domain or subdomain the filter applies to. If the keyword equals to <quote>FOREST</quote>, then the filter equals to all domains from the forest specified by <quote>NAME</quote>.
pt: Se a palavra chave for igual a <quote>DOM</quote> ou estiver em falta, então <quote>NAME</quote> especifica o domínio ou sub-domínio a que o filtro se aplica. Se a palavra chave for igual a <quote>FOREST</quote>, então o filtro é igual a todos os domínios da floresta especificada por <quote>NAME</quote>.

source: Multiple filters can be separated with the <quote>?</quote> character, similarly to how search bases work.
pt: Múltiplos filtros podem ser separados com o caractere <quote>?</quote>, de modo semelhante a como funcionam as bases de busca.

source: Nested group membership must be searched for using a special OID <quote>:1.2.840.113556.1.4.1941:</quote> in addition to the full DOM:domain.example.org: syntax to ensure the parser does not attempt to interpret the colon characters associated with the OID. If you do not use this OID then nested group membership will not be resolved. See usage example below and refer here for further information about the OID: <ulink url="https://msdn.microsoft.com/en-us/library/cc223367.aspx"> [MS-ADTS] section LDAP extensions</ulink>
pt: Os membros de grupo aninhado têm de ser procurados para usarem um OID especial <quote>:1.2.840.113556.1.4.1941:</quote> em adição à sintaxe DOM:domain.example.org: completa para assegurar que o analisador não tenta interpretar os caracteres dois pontos associados com o OID. Se você não usar este OID então os membros de grupo aninhado não serão resolvidos. Veja a utilização do exemplo em baixo e consulte aqui mais informação sobre o OID: <ulink url="https://msdn.microsoft.com/en-us/library/cc223367.aspx"> secção [MS-ADTS] extensões do LDAP</ulink>

source: The most specific match is always used. For example, if the option specified filter for a domain the user is a member of and a global filter, the per-domain filter would be applied. If there are more matches with the same specification, the first one is used.
pt: A correspondência mais específica é sempre usada. Por exemplo, se a opção especificou um filtro para um domínio que o utilizador é membro e um filtro global, será aplicado o filtro por-domínio. Se existirem mais correspondências com a mesma especificação, é usada a primeira.

source: Specify AD site to which client should try to connect. If this option is not provided, the AD site will be auto-discovered.
pt: Especifica o sítio AD ao qual o cliente deve tentar ligar. Se esta opção não for fornecida, o sítio AD será auto-descoberto.

source: ad_enable_gc (boolean)
pt: ad_enable_gc (booleano)

source: By default, the SSSD connects to the Global Catalog first to retrieve users from trusted domains and uses the LDAP port to retrieve group memberships or as a fallback. Disabling this option makes the SSSD only connect to the LDAP port of the current AD server.
pt: Por predefinição, o SSSD liga-se ao Global Catalog primeiro para obter utilizadores dos domínios de confiança e usa o porto LDAP para obter os membros dos grupos ou como um recurso em caso de falha. Desactivar esta opção faz com que o SSSD apenas se ligue ao porto LDAP do servidor AD actual.

source: Please note that disabling Global Catalog support does not disable retrieving users from trusted domains. The SSSD would connect to the LDAP port of trusted domains instead. However, Global Catalog must be used in order to resolve cross-domain group memberships.
pt: Por favor note que desactivar o suporte a Global Catalog não desactiva o obter de utilizadores de domínios de confiança. O SSSD deve ligar ao porto LDAP dos domínios de confiança. No entanto, Global Catalog tem de ser usado de modo a se resolver membros de grupos de domínios-cruzados.

source: This option specifies the operation mode for GPO-based access control functionality: whether it operates in disabled mode, enforcing mode, or permissive mode. Please note that the <quote>access_provider</quote> option must be explicitly set to <quote>ad</quote> in order for this option to have an effect.
pt: Esta opção especifica o modo de operação para a funcionalidade de controle de acesso baseado em GPO. Se vai operar em modo desactivado, modo forçado, ou modo permissivo. Por favor note que a opção <quote>access_provider</quote> tem de ser explicitamente definida para <quote>ad</quote> de modo a esta opção ter efeito.

source: GPO-based access control functionality uses GPO policy settings to determine whether or not a particular user is allowed to logon to the host. For more information on the supported policy settings please refer to the <quote>ad_gpo_map</quote> options.
pt: A funcionalidade de controle de acesso baseada em GPO usa definições de política GPO para determinar se é ou não concedida permissão a um utilizador particular de fazer login na máquina. Para mais informação sobre as definições de políticas suportadas por favor consulte as opções <quote>ad_gpo_map</quote>.

source: Please note that current version of SSSD does not support Active Directory's built-in groups. Built-in groups (such as Administrators with SID S-1-5-32-544) in GPO access control rules will be ignored by SSSD. See upstream issue tracker https://github.com/SSSD/sssd/issues/5063 .
pt: Por favor note que a versão actual do SSSD não suporta grupos embutidos do Active Directory. Os grupos embutidos (tais como Administrators com SID S-1-5-32-544) nas regras de controlo de acesso GPO serão ignorados pelo SSSD. Veja o rasteio de problemas emitido pelo autor https://github.com/SSSD/sssd/issues/5063 .

source: Before performing access control SSSD applies group policy security filtering on the GPOs. For every single user login, the applicability of the GPOs that are linked to the host is checked. In order for a GPO to apply to a user, the user or at least one of the groups to which it belongs must have following permissions on the GPO:
pt: Antes de executar o controle de acesso o SSSD aplica filtragem de segurança de política de grupo nos GPOs. Para cada login de utilizador singular, é verificada a aplicabilidade dos GPOs que estão vinculados à máquina. De modo a que um GPO seja aplicado a um utilizador, o utilizador ou pelo menos um dos grupos c que pertence tem de ter as seguintes permissões no GPO:

source: Read: The user or one of its groups must have read access to the properties of the GPO (RIGHT_DS_READ_PROPERTY)
pt: Read: O utilizador ou um dos seus grupos tem de ter acesso de leitura às propriedades do GPO (RIGHT_DS_READ_PROPERTY)

source: Apply Group Policy: The user or at least one of its groups must be allowed to apply the GPO (RIGHT_DS_CONTROL_ACCESS).
pt: Apply Group Policy: O utilizador ou pelo menos um dos seus grupos tem de ter permissão para aplicar o GPO (RIGHT_DS_CONTROL_ACCESS).

source: By default, the Authenticated Users group is present on a GPO and this group has both Read and Apply Group Policy access rights. Since authentication of a user must have been completed successfully before GPO security filtering and access control are started, the Authenticated Users group permissions on the GPO always apply also to the user.
pt: Por predefinição, o grupo Authenticated Users está presente num GPO e este grupo tem ambos direitos de acesso Read e Apply Group Policy. Como a autenticação do utilizador tem de ser completada com sucesso antes da filtragem de segurança GPO e o controle de acesso ser arrancado, as permissões do grupo Authenticated Users no GPO também se aplicam sempre ao utilizador.

source: NOTE: If the operation mode is set to enforcing, it is possible that users that were previously allowed logon access will now be denied logon access (as dictated by the GPO policy settings). In order to facilitate a smooth transition for administrators, a permissive mode is available that will not enforce the access control rules, but will evaluate them and will output a syslog message if access would have been denied. By examining the logs, administrators can then make the necessary changes before setting the mode to enforcing. For logging GPO-based access control debug level 'trace functions' is required (see <citerefentry> <refentrytitle>sssctl</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> manual page).
pt: NOTA: Se o modo de operação está definido para forçar, é possível que os utilizadores que antes tinham permissão de acesso de login tenham agora o acesso de login negado (como ditado pelas definições de política GPO). De modo a facilitar uma transição suave para administradores, está disponível um modo permissivo que não irá forçar as regras de controlo de acesso, mas irá avalia-las e irá escrever uma mensagem no syslog se o acesso teria sido negado. Ao examinar os registos, os administradores podem então fazer as mudanças necessárias antes de definirem o modo de forçar. Para registar o controle de acesso baseado em GPO é requerido o nível de depuração 'trace functions' (veja o manual <citerefentry> <refentrytitle>sssctl</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>).

source: There are three supported values for this option:
pt: Existem três valores suportados para esta opção:

source: disabled: GPO-based access control rules are neither evaluated nor enforced.
pt: disabled: as regras de controlo de acesso baseadas em GPO não são avaliadas nem forçadas.

source: enforcing: GPO-based access control rules are evaluated and enforced.
pt: enforcing: as regras de controlo de acesso baseadas em GPO são avaliadas e forçadas.

source: permissive: GPO-based access control rules are evaluated, but not enforced. Instead, a syslog message will be emitted indicating that the user would have been denied access if this option's value were set to enforcing.
pt: permissive: As regras de controle de acesso baseadas em GPO são avaliadas, mas não impostas. Em vez de negar acesso, é emitida uma mensagem no syslog indicando que o utilizador teria o acesso negado, se o valor desta opção estivesse definido para enforcing.

source: Default: permissive
pt: Predefinição: permissive

source: Default: enforcing
pt: Predefinição: enforcing

source: ad_gpo_implicit_deny (boolean)
pt: ad_gpo_implicit_deny (booleano)

source: Normally when no applicable GPOs are found the users are allowed access. When this option is set to True users will be allowed access only when explicitly allowed by a GPO rule. Otherwise users will be denied access. This can be used to harden security but be careful when using this option because it can deny access even to users in the built-in Administrators group if no GPO rules apply to them.
pt: Normalmente quando são encontrados GPOs não aplicáveis, os utilizadores têm o acesso concedido. Quando esta opção é definida para True os utilizadores terão permissão de acesso apenas quando explicitamente concedida por uma regra GPO. Caso contrário os utilizadores terão o acesso negado. Isto pode ser usado para endurecer a segurança mas tenha cuidado quando usar esta opção porque pode negar acesso até a utilizadores do grupo embutido Administrators se nenhuma regra GPO se aplicar a eles.

source: The following 2 tables should illustrate when a user is allowed or rejected based on the allow and deny login rights defined on the server-side and the setting of ad_gpo_implicit_deny.
pt: As 2 tabelas seguintes devem ilustrar quando um utilizador é permitido ou negado com base dos direitos de concessão ou negação de login definidos no lado servidor e na definição de ad_gpo_implicit_deny.

source: ad_gpo_implicit_deny = False (default)
pt: ad_gpo_implicit_deny = False (predefinido)

source: all users are allowed
pt: todos os utilizadores têm permissão

source: only users not in deny-rules are allowed
pt: apenas utilizadores não em deny-rules têm permissão

source: only users in allow-rules are allowed
pt: apenas utilizadores em allow-rules têm permissão

source: only users in allow-rules and not in deny-rules are allowed
pt: apenas utilizadores em allow-rules e não em deny-rules têm permissão

source: no users are allowed
pt: nenhum utilizador tem permissão

source: ad_gpo_ignore_unreadable (boolean)
pt: ad_gpo_ignore_unreadable (booleano)

source: Normally when some group policy containers (AD object) of applicable group policy objects are not readable by SSSD then users are denied access. This option allows to ignore group policy containers and with them associated policies if their attributes in group policy containers are not readable for SSSD.
pt: Normalmente quando algum contentor de política de grupo (objecto AD) de objecto de política de grupo aplicável não pode ser lido pelo SSSD então os utilizadores têm o acesso negado. Esta opção permite ignorar os contentores de política de grupo e com eles as políticas associadas se os seus atributos nesses contentores não forem legíveis pelo SSSD.

source: ad_gpo_cache_timeout (integer)
pt: ad_gpo_cache_timeout (inteiro)

source: The amount of time between lookups of GPO policy files against the AD server. This will reduce the latency and load on the AD server if there are many access-control requests made in a short period.
pt: A quantidade de tempo entre procuras de ficheiros de política GPO num servidor AD. Isto irá reduzir a latência e carga no servidor AD se existirem muitos pedidos de controle de acesso feitos num curto período.

source: A comma-separated list of PAM service names for which GPO-based access control is evaluated based on the InteractiveLogonRight and DenyInteractiveLogonRight policy settings. Only those GPOs are evaluated for which the user has Read and Apply Group Policy permission (see option <quote>ad_gpo_access_control</quote>). If an evaluated GPO contains the deny interactive logon setting for the user or one of its groups, the user is denied local access. If none of the evaluated GPOs has an interactive logon right defined, the user is granted local access. If at least one evaluated GPO contains interactive logon right settings, the user is granted local access only, if it or at least one of its groups is part of the policy settings.
pt: Uma lista separada por vírgulas de nomes de serviço PAM para os quais o controle de acesso baseado em GPO é avaliado com base nas definições de política InteractiveLogonRight e DenyInteractiveLogonRight. Apenas esses GPOs são avaliados para os quais o utilizador tem permissão Read e Apply Group Policy (veja a opção <quote>ad_gpo_access_control</quote>). Se um GPO avaliado conter a definição de logon interactivo deny para o utilizador ou para um dos seus grupos, ao utilizador é negado acesso local. Se nenhum dos GPOs avaliados tiver um direito de logon interactivo definido, ao utilizador é concedido acesso local. Se pelo menos um GPO avaliado conter definições de direito de logon interactivo, ao utilizador é concedido acesso local apenas, se ele ou pelo menos um dos seus grupos fizer parte das definições de política.

source: Note: Using the Group Policy Management Editor this value is called "Allow log on locally" and "Deny log on locally".
pt: Nota: Usando o Editor de Gestão de Política de Grupo este valor é chamado "Allow log on locally" e "Deny log on locally".
