Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: When using service discovery for KDC or kpasswd servers, SSSD first searches for DNS entries that specify _udp as the protocol and falls back to _tcp if none are found.
pt: Quando se usa descoberta de serviços para servidores KDC ou kpasswd, o SSSD primeiro procura por entradas DNS que especifiquem _udp como o protocolo e regressa a _tcp se nenhuma for encontrada.

source: This option was named <quote>krb5_kdcip</quote> in earlier releases of SSSD. While the legacy name is recognized for the time being, users are advised to migrate their config files to use <quote>krb5_server</quote> instead.
pt: Esta opção tinha o nome <quote>krb5_kdcip</quote> em lançamentos anteriores do SSSD. Apesar do nome antigo ser reconhecido por agora, aconselha-se os utilizadores a migrarem os seus ficheiros de configuração para usar <quote>krb5_server</quote> em vez disto.

source: Specify the Kerberos REALM (for SASL/GSSAPI/GSS-SPNEGO auth).
pt: Especifica o REINO Kerberos (para autenticação SASL/GSSAPI/GSS-SPNEGO).

source: Default: System defaults, see <filename>/etc/krb5.conf</filename>
pt: Predefinição: Predefinições do sistema, veja <filename>/etc/krb5.conf</filename>

source: krb5_canonicalize (boolean)
pt: krb5_canonicalize (booleano)

source: Specifies if the host principal should be canonicalized when connecting to LDAP server. This feature is available with MIT Kerberos >= 1.7
pt: Especifica se a máquina principal deve ser canonizada quando se liga ao servidor LDAP. Esta funcionalidade está disponível com MIT Kerberos >= 1.7

source: krb5_use_kdcinfo (boolean)
pt: krb5_use_kdcinfo (booleano)

source: Specifies if the SSSD should instruct the Kerberos libraries what realm and which KDCs to use. This option is on by default, if you disable it, you need to configure the Kerberos library using the <citerefentry> <refentrytitle>krb5.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> configuration file.
pt: Especifica se o SSSD deve instruir as bibliotecas Kerberos qual reino e quais KDCs usar. Esta opção está ligada por predefinição, se você a desactivar, você precisa de configurar a biblioteca Kerberos usando o ficheiro de configuração <citerefentry> <refentrytitle>krb5.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: See the <citerefentry> <refentrytitle>sssd_krb5_locator_plugin</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> manual page for more information on the locator plugin.
pt: Veja o manual <citerefentry> <refentrytitle>sssd_krb5_locator_plugin</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> para mais informação no plugin locador.

source: Select the policy to evaluate the password expiration on the client side. The following values are allowed:
pt: Seleciona a política para avaliar o expirar de palavra passe no lado do cliente. Os seguintes valores são permitidos:

source: <emphasis>none</emphasis> - No evaluation on the client side. This option cannot disable server-side password policies.
pt: <emphasis>none</emphasis> - Nenhuma avaliação no lado do cliente. Esta opção não consegue desactivar as políticas de palavra passe no lado do servidor.

source: <emphasis>shadow</emphasis> - Use <citerefentry><refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum></citerefentry> style attributes to evaluate if the password has expired. Please see option "ldap_chpass_update_last_change" as well.
pt: <emphasis>shadow</emphasis> - Usa atributos do estilo <citerefentry><refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum></citerefentry> para avaliar se a palavra passe expirou. Por favor veja também a opção "ldap_chpass_update_last_change".

source: <emphasis>mit_kerberos</emphasis> - Use the attributes used by MIT Kerberos to determine if the password has expired. Use chpass_provider=krb5 to update these attributes when the password is changed.
pt: <emphasis>mit_kerberos</emphasis> - Usa os atributos usados pelo MIT Kerberos para determinar se a palavra passe expirou. Usa chpass_provider=krb5 para actualizar estes atributos quando a palavra passe é mudada.

source: <emphasis>Note</emphasis>: if a password policy is configured on server side, it always takes precedence over policy set with this option.
pt: <emphasis>Nota</emphasis>: se uma política de palavra passe for configurada no lado do servidor, essa toma sempre precedência sobre a política definida com esta opção.

source: ldap_referrals (boolean)
pt: ldap_referrals (booleano)

source: Specifies whether automatic referral chasing should be enabled.
pt: Especifica se a perseguição de referência automática deve ser activada.

source: Please note that sssd only supports referral chasing when it is compiled with OpenLDAP version 2.4.13 or higher.
pt: Por favor note que o sssd apenas suporta perseguição de referência quando é compilado com OpenLDAP versão 2.4.13 ou superior.

source: Chasing referrals may incur a performance penalty in environments that use them heavily, a notable example is Microsoft Active Directory. If your setup does not in fact require the use of referrals, setting this option to false might bring a noticeable performance improvement. Setting this option to false is therefore recommended in case the SSSD LDAP provider is used together with Microsoft Active Directory as a backend. Even if SSSD would be able to follow the referral to a different AD DC no additional data would be available.
pt: A perseguição de referência pode incluir uma penalização de performance em ambientes que a usem pesadamente, um exemplo notável é Microsoft Active Directory. Se a sua configuração não precisa de facto a utilização de referências, definir esta opção para false pode trazer uma melhoria de performance notável. Definir esta opção para falso é assim recomendado no caso do provedor LDAP do SSSD ser usado juntamente com Microsoft Active Directory como backend. Mesmo que o SSSD seja capaz de seguir a referência a um AD DC diferente, nenhuns dados adicionais estarão disponíveis.

source: Specifies the service name to use when service discovery is enabled.
pt: Especifica o nome de serviço a usar quando a descoberta de serviços está activa.

source: Default: ldap
pt: Predefinição: ldap

source: Specifies the service name to use to find an LDAP server which allows password changes when service discovery is enabled.
pt: Especifica o nome de serviço a usar para encontrar um servidor LDAP e qual permite alterações de palavra passe quando a descoberta de serviços está desactivada.

source: Default: not set, i.e. service discovery is disabled
pt: Predefinição: não definido, isto é, a descoberta de serviços é desativada

source: ldap_chpass_update_last_change (bool)
pt: ldap_chpass_update_last_change (booleano)

source: Specifies whether to update the ldap_user_shadow_last_change attribute with days since the Epoch after a password change operation.
pt: Especifica se deve-se actualizar o atributo ldap_user_shadow_last_change com dias desde o Epoch após uma operação de mudança de palavra passe.

source: If using access_provider = ldap and ldap_access_order = filter (default), this option is mandatory. It specifies an LDAP search filter criteria that must be met for the user to be granted access on this host. If access_provider = ldap, ldap_access_order = filter and this option is not set, it will result in all users being denied access. Use access_provider = permit to change this default behavior. Please note that this filter is applied on the LDAP user entry only and thus filtering based on nested groups may not work (e.g. memberOf attribute on AD entries points only to direct parents). If filtering based on nested groups is required, please see <citerefentry> <refentrytitle>sssd-simple</refentrytitle><manvolnum>5</manvolnum> </citerefentry>.
pt: Se se usar access_provider = ldap e ldap_access_order = filter (predefinição), esta opção é obrigatória. Especifica um critério de filtro de procura LDAP que tem de ser reconhecido ao utilizador para ter acesso garantido a esta máquina. Caso access_provider = ldap, ldap_access_order = filter e esta opção não esteja definida, irá resultar em que todos os utilizadores tenham acesso negado. Use access_provider = permit para mudar este comportamento predefinido. Por favor note que este filtro é aplicado à entrada de utilizador LDAP apenas e assim a filtragem baseada em grupos aninhados pode não funcionar (ex. atributo memberOf em entradas AD que apontam apenas para parentes diretos). Se for requerido filtragem baseada em grupos aninhados, por favor veja <citerefentry> <refentrytitle>sssd-simple</refentrytitle><manvolnum>5</manvolnum> </citerefentry>.

source: Example:
pt: Exemplo:

source: This example means that access to this host is restricted to users whose employeeType attribute is set to "admin".
pt: Este exemplo significa que o acesso a esta máquina é restrito a utilizadores cujo atributo employeeType está definido para "admin".

source: Offline caching for this feature is limited to determining whether the user's last online login was granted access permission. If they were granted access during their last login, they will continue to be granted access while offline and vice versa.
pt: A cache offline para esta funcionalidade está limitada a determinar se no último login online do utilizador foi garantida permissão de acesso. Se lhe foi dado acesso durante o seu último login, irá continuar a ter acesso concedido enquanto em offline e vice versa.

source: Default: Empty
pt: Predefinição: Empty

source: With this option a client side evaluation of access control attributes can be enabled.
pt: Com esta opção pode ser activada uma avaliação no lado do cliente dos atributos de controle de acesso.

source: Please note that it is always recommended to use server side access control, i.e. the LDAP server should deny the bind request with a suitable error code even if the password is correct.
pt: Por favor note que é sempre recomendado usar controle de acesso no lado do servidor, isto é, o servidor LDAP deve negar o pedido de união com um código de erro apropriado mesmo que a palavra passe esteja correcta.

source: The following values are allowed:
pt: Os seguintes valores são permitidos:

source: <emphasis>shadow</emphasis>: use the value of ldap_user_shadow_expire to determine if the account is expired.
pt: <emphasis>shadow</emphasis>: usa o valor de ldap_user_shadow_expire para determinar se a conta está expirada.

source: <emphasis>ad</emphasis>: use the value of the 32bit field ldap_user_ad_user_account_control and allow access if the second bit is not set. If the attribute is missing access is granted. Also the expiration time of the account is checked.
pt: <emphasis>ad</emphasis>: usa o valor do campo de 32bit ldap_user_ad_user_account_control e permite acesso se o segundo bit não estiver definido. Se o atributo estiver em falta é concedido acesso. Também é verificado o tempo de expiração da conta.

source: <emphasis>rhds</emphasis>, <emphasis>ipa</emphasis>, <emphasis>389ds</emphasis>: use the value of ldap_ns_account_lock to check if access is allowed or not.
pt: <emphasis>rhds</emphasis>, <emphasis>ipa</emphasis>, <emphasis>389ds</emphasis>: usa o valor de ldap_ns_account_lock para verificar se o acesso é permitido ou não.

source: <emphasis>nds</emphasis>: the values of ldap_user_nds_login_allowed_time_map, ldap_user_nds_login_disabled and ldap_user_nds_login_expiration_time are used to check if access is allowed. If both attributes are missing access is granted.
pt: <emphasis>nds</emphasis>: são usados os valores de ldap_user_nds_login_allowed_time_map, ldap_user_nds_login_disabled e ldap_user_nds_login_expiration_time para verificar se o acesso é permitido. Se ambos os atributos estiverem em falta o acesso é concedido.

source: Please note that the ldap_access_order configuration option <emphasis>must</emphasis> include <quote>expire</quote> in order for the ldap_account_expire_policy option to work.
pt: Por favor note que a opção de configuração ldap_access_order <emphasis>tem</emphasis> de incluir <quote>expire</quote> de modo a que a opção ldap_account_expire_policy funcione.

source: Comma separated list of access control options. Allowed values are:
pt: Lista separada por vírgulas de opções de controlo de acesso. Os valores permitidos são:

source: <emphasis>filter</emphasis>: use ldap_access_filter
pt: <emphasis>filter</emphasis>: usa ldap_access_filter

source: <emphasis>lockout</emphasis>: use account locking. If set, this option denies access in case that ldap attribute 'pwdAccountLockedTime' is present and has value of '000001010000Z'. Please see the option ldap_pwdlockout_dn. Please note that 'access_provider = ldap' must be set for this feature to work.
pt: <emphasis>lockout</emphasis>: usa bloqueio de conta. Se definida, esta opção nega acesso no caso do atributo ldap 'pwdAccountLockedTime' estar presente e ter o valor de '000001010000Z'. Por favor veja a opção ldap_pwdlockout_dn. Por favor note que 'access_provider = ldap' tem de estar definido para esta funcionalidade funcionar.

source: <emphasis> Please note that this option is superseded by the <quote>ppolicy</quote> option and might be removed in a future release. </emphasis>
pt: <emphasis> Por favor note que esta opção é suplantada pela opção <quote>ppolicy</quote> e poderá ser removida num lançamento futuro. </emphasis>

source: <emphasis>ppolicy</emphasis>: use account locking. If set, this option denies access in case that ldap attribute 'pwdAccountLockedTime' is present and has value of '000001010000Z' or represents any time in the past. The value of the 'pwdAccountLockedTime' attribute must end with 'Z', which denotes the UTC time zone. Other time zones are not currently supported and will result in "access-denied" when users attempt to log in. Please see the option ldap_pwdlockout_dn. Please note that 'access_provider = ldap' must be set for this feature to work.
pt: <emphasis>ppolicy</emphasis>: usa bloqueio de conta. Se definida, esta opção nega acesso no caso do atributo ldap 'pwdAccountLockedTime' estar presente e ter o valor '000001010000Z' ou represente qualquer hora no passado. O valor do atributo 'pwdAccountLockedTime' tem de terminar com 'Z', o que denota a zona horária UTC. Outras zonas horárias não são presentemente suportadas e irão resultar em "acesso-negado" quando os utilizadores tentarem fazer login. Por favor veja a opção ldap_pwdlockout_dn. Por favor note que 'access_provider = ldap' tem de estar definido para esta funcionalidade funcionar.

source: <emphasis>expire</emphasis>: use ldap_account_expire_policy
pt: <emphasis>expire</emphasis>: usa ldap_account_expire_policy

source: <emphasis>pwd_expire_policy_reject, pwd_expire_policy_warn, pwd_expire_policy_renew: </emphasis> These options are useful if users are interested in being warned that password is about to expire and authentication is based on using a different method than passwords - for example SSH keys.
pt: <emphasis>pwd_expire_policy_reject, pwd_expire_policy_warn, pwd_expire_policy_renew: </emphasis> Estas opções são úteis se os utilizadores estiverem interessados em serem avisados que a palavra passe está prestes a expirar e a autenticação é baseada em se usar um método diferente que palavras passe - por exemplo chaves SSH.

source: The difference between these options is the action taken if user password is expired:
pt: A diferença entre estas opções é a acção tomada se a palavra passe do utilizador estiver expirada:

source: pwd_expire_policy_reject - user is denied to log in,
pt: pwd_expire_policy_reject - é negado o login ao utilizador,

source: pwd_expire_policy_warn - user is still able to log in,
pt: pwd_expire_policy_warn - o utilizador ainda é capaz de fazer login,

source: pwd_expire_policy_renew - user is prompted to change their password immediately.
pt: pwd_expire_policy_renew - o utilizador é incitado a mudar a sua palavra passe imediatamente.

source: Please note that 'access_provider = ldap' must be set for this feature to work. Also 'ldap_pwd_policy' must be set to shadow or mit_kerberos, these options do not work with server-side password policies.
pt: Por favor note que 'access_provider = ldap' tem de estar definido para esta funcionalidade funcionar. E também 'ldap_pwd_policy' tem de estar definido para shadow ou mit_kerberos, estas opções não funcionam com políticas de palavra passe do lado do servidor.

source: <emphasis>authorized_service</emphasis>: use the authorizedService attribute to determine access
pt: <emphasis>authorized_service</emphasis>: usa o atributo authorizedService para determinar o acesso

source: <emphasis>host</emphasis>: use the host attribute to determine access
pt: <emphasis>host</emphasis>: usa o atributo host para determinar o acesso

source: <emphasis>rhost</emphasis>: use the rhost attribute to determine whether remote host can access
pt: <emphasis>rhost</emphasis>: usa o atributo rhost para determinar se a máquina remota pode ter acesso

source: Please note, rhost field in pam is set by application, it is better to check what the application sends to pam, before enabling this access control option
pt: Por favor note, o campo rhost no pam é definido por aplicação, é melhor verificar que a aplicação envia para o pam, antes de activar esta opção de controlo de acesso

source: Default: filter
pt: Predefinição: filter

source: Please note that it is a configuration error if a value is used more than once.
pt: Por favor note que é um erro de configuração se um valor for usado mais do que uma vez.

source: This option specifies the DN of password policy entry on LDAP server. Please note that absence of this option in sssd.conf in case of enabled account lockout checking will yield access denied as ppolicy attributes on LDAP server cannot be checked properly.
pt: Esta opção especifica o DN de entrada de política de palavra passe no servidor LDAP. Por favor note que a ausência desta opção no sssd.conf no caso de bloqueio de conta activa a verificação irá colher negação de acesso pois os atributos ppolicy no servidor LDAP não podem ser verificados apropriadamente.

source: Example: cn=ppolicy,ou=policies,dc=example,dc=com
pt: Exemplo: cn=ppolicy,ou=policies,dc=example,dc=com

source: Default: cn=ppolicy,ou=policies,$ldap_search_base
pt: Predefinição: cn=ppolicy,ou=policies,$ldap_search_base

source: Specifies how alias dereferencing is done when performing a search. The following options are allowed:
pt: Especifica como a diferenciação de nomes alternativos é feita quando se executa uma busca. As seguintes opções são permitidas:

source: <emphasis>never</emphasis>: Aliases are never dereferenced.
pt: <emphasis>never</emphasis>: Os nomes alternativos nunca são diferenciados.

source: <emphasis>searching</emphasis>: Aliases are dereferenced in subordinates of the base object, but not in locating the base object of the search.
pt: <emphasis>searching</emphasis>: Os nomes alternativos são diferenciados em subordinados do objecto base, mas não ao localizar o objecto base da busca.

source: <emphasis>finding</emphasis>: Aliases are only dereferenced when locating the base object of the search.
pt: <emphasis>finding</emphasis>: Os nomes alternativos são apenas diferenciados quando se localiza o objecto base da busca.

source: <emphasis>always</emphasis>: Aliases are dereferenced both in searching and in locating the base object of the search.
pt: <emphasis>always</emphasis>: Os nomes alternativos são diferenciados tanto na busca como ao localizar o objecto base da busca.

source: Default: Empty (this is handled as <emphasis>never</emphasis> by the LDAP client libraries)
pt: Predefinição: Vazio (isto é lidado como <emphasis>never</emphasis> pelas bibliotecas cliente do LDAP)

source: ldap_rfc2307_fallback_to_local_users (boolean)
pt: ldap_rfc2307_fallback_to_local_users (booleano)

source: Allows to retain local users as members of an LDAP group for servers that use the RFC2307 schema.
pt: Permite reter utilizadores locais como membros dum grupo LDAP para servidores que usam o esquema RFC2307.

source: In some environments where the RFC2307 schema is used, local users are made members of LDAP groups by adding their names to the memberUid attribute. The self-consistency of the domain is compromised when this is done, so SSSD would normally remove the "missing" users from the cached group memberships as soon as nsswitch tries to fetch information about the user via getpw*() or initgroups() calls.
pt: Em alguns ambientes onde o esquema RFC2307 é usado, os utilizadores locais são tornados membros de grupos LDAP ao adicionar os seus nomes ao atributo memberUid. A auto-consistência do domínio fica comprometida quando isto acontece, assim o SSSD deveria normalmente remover os utilizadores "em falta" dos membros de grupo em cache assim que o nsswitch tente obter informação acerca do utilizador via chamadas getpw*() ou initgroups().

source: This option falls back to checking if local users are referenced, and caches them so that later initgroups() calls will augment the local users with the additional LDAP groups.
pt: Esta opção cai para o verificar se os utilizadores locais são referenciados, e põe-os em cache para que as chamadas initgroups() posteriores acrescentem os utilizadores locais com os grupos LDAP adicionais.

source: wildcard_limit (integer)
pt: wildcard_limit (inteiro)

source: Specifies an upper limit on the number of entries that are downloaded during a wildcard lookup.
pt: Especifica o limite máximo do número de entradas que são descarregadas durante uma procura de wildcard.

source: At the moment, only the InfoPipe responder supports wildcard lookups.
pt: De momento, apenas o respondedor InfoPipe suporta procuras wildcard.

source: Default: 1000 (often the size of one page)
pt: Predefinição: 1000 (muitas vezes o tamanho de uma página)

source: ldap_library_debug_level (integer)
pt: ldap_library_debug_level (inteiro)

source: Switches on libldap debugging with the given level. The libldap debug messages will be written independent of the general debug_level.
pt: Liga a depuração de libldap com o nível dado. As mensagens de depuração do libldap serão escritas independentemente do debug_level geral.

source: OpenLDAP uses a bitmap to enable debugging for specific components, -1 will enable full debug output.
pt: OpenLDAP usa um mapa de bits para activar a depuração para componentes específicos. -1 irá activar a saída completa de depuração.

source: Default: 0 (libldap debugging disabled)
pt: Predefinição: 0 (depuração libldap desactivada)

source: ldap_use_ppolicy (boolean)
pt: ldap_use_ppolicy (booleano)

source: Turns on requesting and relying on the server-side password policy controls. Disabling this allows interacting with services which send back invalid ppolicy extension.
pt: Ativa o requisitar e confiar nos controles de política de palavra passe do lado do servidor. Desativar isto permite interações com serviços que devolvem uma extensão ppolicy inválida.

source: ldap_ppolicy_pwd_change_threshold (integer)
pt: ldap_ppolicy_pwd_change_threshold (inteiro)
