Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: This manual page describes the mapping attributes of SSSD LDAP provider <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>. Refer to the <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page for full details about SSSD LDAP provider configuration options.
pt: Este manual descreve os atributos de mapeamento do provedor LDAP SSSD <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>. Consulte o manual <citerefentry> <refentrytitle>sssd-ldap</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para detalhes completos acerca das opções de configuração do provedor LDAP do SSSD.

source: USER ATTRIBUTES
pt: ATRIBUTOS DE UTILIZADOR

source: The object class of a user entry in LDAP.
pt: A classe de objecto de uma entrada de utilizador em LDAP.

source: Default: posixAccount
pt: Predefinição: posixAccount

source: The LDAP attribute that corresponds to the user's login name.
pt: O atributo LDAP que corresponde ao nome de login do utilizador.

source: Default: uid (rfc2307, rfc2307bis and IPA), sAMAccountName (AD)
pt: Predefinição: uid (rfc2307, rfc2307bis e IPA), sAMAccountName (AD)

source: The LDAP attribute that corresponds to the user's id.
pt: O atributo LDAP que corresponde ao id do utilizador.

source: Default: uidNumber
pt: Predefinição: uidNumber

source: The LDAP attribute that corresponds to the user's primary group id.
pt: O atributo LDAP que corresponde ao id do grupo principal do utilizador.

source: Default: gidNumber
pt: Predefinição: gidNumber

source: Active Directory primary group attribute for ID-mapping. Note that this attribute should only be set manually if you are running the <quote>ldap</quote> provider with ID mapping.
pt: Atributo de grupo principal para Active Directory para mapeamento de ID. Note que este atributo só deve ser definido manualmente se você está a correr o provedor <quote>ldap</quote> com mapeamento de ID.

source: Default: unset (LDAP), primaryGroupID (AD)
pt: Predefinição: não definido (LDAP), primaryGroupID (AD)

source: The LDAP attribute that corresponds to the user's gecos field.
pt: O atributo LDAP que corresponde ao campo gecos do utilizador.

source: Default: gecos
pt: Predefinição: gecos

source: The LDAP attribute that contains the name of the user's home directory.
pt: O atributo do LDAP que contém o nome do directório home do utilizador.

source: Default: homeDirectory (LDAP and IPA), unixHomeDirectory (AD)
pt: Predefinição: homeDirectory (LDAP e IPA), unixHomeDirectory (AD)

source: The LDAP attribute that contains the path to the user's default shell.
pt: O atributo LDAP que contém o caminho para a shell predefinida do utilizador.

source: Default: loginShell
pt: Predefinição: loginShell

source: The LDAP attribute that contains the UUID/GUID of an LDAP user object.
pt: O atributo do LDAP que contém o UUID/GUID de um objecto utilizador de LDAP.

source: Default: not set in the general case, objectGUID for AD and ipaUniqueID for IPA
pt: Predefinição: não definida em caso geral, objectGUID para AD e ipaUniqueID para IPA

source: The LDAP attribute that contains the objectSID of an LDAP user object. This is usually only necessary for ActiveDirectory servers.
pt: O atributo do LDAP que contém o objectSID de um objecto utilizador LDAP. Isto é geralmente apenas necessário para servidores ActiveDirectory.

source: Default: objectSid for ActiveDirectory, not set for other servers.
pt: Predefinição: objectSid para ActiveDirectory, não definida para outros servidores.

source: The LDAP attribute that contains timestamp of the last modification of the parent object.
pt: O atributo do LDAP que contém a marca temporal da última modificação do objecto pai.

source: Default: modifyTimestamp
pt: Predefinição: modifyTimestamp

source: When using ldap_pwd_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (date of the last password change).
pt: Quando se usa ldap_pwd_policy=shadow, este parâmetro contém o nome de um atributo LDAP que corresponde ao seu duplicado <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> (data da última modificação de palavra passe).

source: Default: shadowLastChange
pt: Predefinição: shadowLastChange

source: When using ldap_pwd_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (minimum password age).
pt: Quando se usa ldap_pwd_policy=shadow, este parâmetro contém o nome de um atributo LDAP que corresponde ao seu duplicado <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> (idade mínima da palavra passe).

source: Default: shadowMin
pt: Predefinição: shadowMin

source: When using ldap_pwd_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (maximum password age).
pt: Quando se usa ldap_pwd_policy=shadow, este parâmetro contém o nome de um atributo LDAP que corresponde ao seu duplicado <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> (idade máxima da palavra passe).

source: Default: shadowMax
pt: Predefinição: shadowMax

source: When using ldap_pwd_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (password warning period).
pt: Quando se usa ldap_pwd_policy=shadow, este parâmetro contém o nome de um atributo LDAP que corresponde ao seu duplicado <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> (período de aviso da palavra passe).

source: Default: shadowWarning
pt: Predefinição: shadowWarning

source: When using ldap_pwd_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (password inactivity period).
pt: Quando se usa ldap_pwd_policy=shadow, este parâmetro contém o nome de um atributo LDAP que corresponde ao seu duplicado <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> (período de inactividade da palavra passe).

source: Default: shadowInactive
pt: Predefinição: shadowInactive

source: When using ldap_pwd_policy=shadow or ldap_account_expire_policy=shadow, this parameter contains the name of an LDAP attribute corresponding to its <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> counterpart (account expiration date).
pt: Quando se usa ldap_pwd_policy=shadow ou ldap_account_expire_policy=shadow, este parâmetro contém o nome de um atributo LDAP que corresponde ao seu duplicado <citerefentry> <refentrytitle>shadow</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> (data de expiração da conta).

source: Default: shadowExpire
pt: Predefinição: shadowExpire

source: When using ldap_pwd_policy=mit_kerberos, this parameter contains the name of an LDAP attribute storing the date and time of last password change in kerberos.
pt: Quando se usa ldap_pwd_policy=mit_kerberos, este parâmetro contém o nome de um atributo LDAP que guarda a data e hora da última mudança de palavra passe no kerberos.

source: Default: krbLastPwdChange
pt: Predefinição: krbLastPwdChange

source: When using ldap_pwd_policy=mit_kerberos, this parameter contains the name of an LDAP attribute storing the date and time when current password expires.
pt: Quando se usa ldap_pwd_policy=mit_kerberos, este parâmetro contém o nome de um atributo LDAP que guarda a data e hora que a palavra passe actual expira.

source: Default: krbPasswordExpiration
pt: Predefinição: krbPasswordExpiration

source: When using ldap_account_expire_policy=ad, this parameter contains the name of an LDAP attribute storing the expiration time of the account.
pt: Quando se usa ldap_account_expire_policy=ad, este parâmetro contém o nome de um atributo LDAP que guarda a hora de expiração da conta.

source: Default: accountExpires
pt: Predefinição: accountExpires

source: When using ldap_account_expire_policy=ad, this parameter contains the name of an LDAP attribute storing the user account control bit field.
pt: Quando se usa ldap_account_expire_policy=ad, este parâmetro contém o nome de um atributo LDAP que guarda o campo de bit de controlo da conta de utilizador.

source: Default: userAccountControl
pt: Predefinição: userAccountControl

source: When using ldap_account_expire_policy=rhds or equivalent, this parameter determines if access is allowed or not.
pt: Quando se usa ldap_account_expire_policy=rhds ou equivalente, este parâmetro determina se o acesso é concedido ou não.

source: Default: nsAccountLock
pt: Predefinição: nsAccountLock

source: When using ldap_account_expire_policy=nds, this attribute determines if access is allowed or not.
pt: Quando se usa ldap_account_expire_policy=nds, este atributo determina se o acesso é concedido ou não.

source: Default: loginDisabled
pt: Predefinição: loginDisabled

source: When using ldap_account_expire_policy=nds, this attribute determines until which date access is granted.
pt: Quando se usa ldap_account_expire_policy=nds, este atributo determina até que data o acesso é concedido.

source: When using ldap_account_expire_policy=nds, this attribute determines the hours of a day in a week when access is granted.
pt: Quando se usa ldap_account_expire_policy=nds, este atributo determina as horas do dia numa semana quando o acesso é concedido.

source: Default: loginAllowedTimeMap
pt: Predefinição: loginAllowedTimeMap

source: The LDAP attribute that contains the user's Kerberos User Principal Name (UPN).
pt: O atributo LDAP que contém o Nome Principal de Utilizador Kerberos (UPN) do utilizador.

source: Default: krbPrincipalName
pt: Predefinição: krbPrincipalName

source: Comma-separated list of LDAP attributes that SSSD would fetch along with the usual set of user attributes.
pt: Lista separada por vírgulas de atributos LDAP que o SSSD iria obter juntamente com o conjunto usual de atributos de utilizador.

source: The list can either contain LDAP attribute names only, or colon-separated tuples of SSSD cache attribute name and LDAP attribute name. In case only LDAP attribute name is specified, the attribute is saved to the cache verbatim. Using a custom SSSD attribute name might be required by environments that configure several SSSD domains with different LDAP schemas.
pt: A lista pode ou conter apenas nomes de atributos LDAP, ou tuples separados por dois-pontos de nome de atributo de cache SSSD e nome de atributo LDAP. No caso de ser especificado apenas nomes de atributos LDAP, o atributo é guardado na cache literalmente. A utilização de nome de atributo SSSD personalizado pode ser requerida por ambientes que configuram vários domínios SSSD com esquemas LDAP diferentes.

source: Please note that several attribute names are reserved by SSSD, notably the <quote>name</quote> attribute. SSSD would report an error if any of the reserved attribute names is used as an extra attribute name.
pt: Por favor note que vários nomes de atributos estão reservados pelo SSSD, notavelmente o atributo <quote>name</quote>. O SSSD deverá reportar um erro se qualquer um dois nomes de atributo reservados for usado como um nome de atributo extra.

source: Save the <quote>telephoneNumber</quote> attribute from LDAP as <quote>telephoneNumber</quote> to the cache.
pt: Salva o atributo <quote>telephoneNumber</quote> do LDAP como <quote>telephoneNumber</quote> na cache.

source: Save the <quote>telephoneNumber</quote> attribute from LDAP as <quote>phone</quote> to the cache.
pt: Salva o atributo <quote>telephoneNumber</quote> do LDAP como <quote>phone</quote> na cache.

source: The LDAP attribute that contains the user's SSH public keys.
pt: O atributo LDAP que contém a chave pública SSH do utilizador.

source: Default: sshPublicKey
pt: Predefinição: sshPublicKey

source: The LDAP attribute that corresponds to the user's full name.
pt: O atributo LDAP que corresponde ao nome completo do utilizador.

source: The LDAP attribute that lists the user's group memberships.
pt: O atributo LDAP que lista os membros do grupo do utilizador.

source: Default: memberOf
pt: Predefinição: memberOf

source: If access_provider=ldap and ldap_access_order=authorized_service, SSSD will use the presence of the authorizedService attribute in the user's LDAP entry to determine access privilege.
pt: Se access_provider=ldap e ldap_access_order=authorized_service, o SSSD irá usar a presença do atributo authorizedService na entrada LDAP do utilizador para determinar o privilégio de acesso.

source: An explicit deny (!svc) is resolved first. Second, SSSD searches for explicit allow (svc) and finally for allow_all (*).
pt: Uma negação explícita (!svc) é resolvida primeiro. Segundo, o SSSD procura um allow explícito (svc) e finalmente por allow_all (*).

source: Please note that the ldap_access_order configuration option <emphasis>must</emphasis> include <quote>authorized_service</quote> in order for the ldap_user_authorized_service option to work.
pt: Por favor note que a opção de configuração ldap_access_order <emphasis>tem</emphasis> de incluir <quote>authorized_service</quote> para que a opção ldap_user_authorized_service funcione.

source: Some distributions (such as Fedora-29+ or RHEL-8) always include the <quote>systemd-user</quote> PAM service as part of the login process. Therefore when using service-based access control, the <quote>systemd-user</quote> service might need to be added to the list of allowed services.
pt: Algumas distribuições (como a Fedora-29+ ou RHEL-8) incluem sempre o serviço PAM <quote>systemd-user</quote> como parte do processo de login. Assim quando se usa controle de acesso baseado em serviço, o serviço <quote>systemd-user</quote> pode precisar de ser adicionado à lista de serviços permitidos.

source: Default: authorizedService
pt: Predefinição: authorizedService

source: If access_provider=ldap and ldap_access_order=host, SSSD will use the presence of the host attribute in the user's LDAP entry to determine access privilege.
pt: Se access_provider=ldap e ldap_access_order=host, o SSSD irá usar a presença do atributo host na entrada LDAP do utilizador para determinar o privilégio de acesso.

source: An explicit deny (!host) is resolved first. Second, SSSD searches for explicit allow (host) and finally for allow_all (*).
pt: Um deny explícito (host) é resolvido primeiro. Segundo, o SSSD procura um allow explícito (host) e finalmente por allow_all (*).

source: Please note that the ldap_access_order configuration option <emphasis>must</emphasis> include <quote>host</quote> in order for the ldap_user_authorized_host option to work.
pt: Por favor note que a opção de configuração ldap_access_order <emphasis>tem</emphasis> de incluir <quote>host</quote> para que a opção ldap_user_authorized_host funcione.

source: Default: host
pt: Predefinição: host

source: If access_provider=ldap and ldap_access_order=rhost, SSSD will use the presence of the rhost attribute in the user's LDAP entry to determine access privilege. Similarly to host verification process.
pt: Se access_provider=ldap e ldap_access_order=rhost, o SSSD irá usar a presença do atributo rhost na entrada LDAP do utilizador para determinar o privilégio de acesso. Semelhante ao processo de verificação de host.

source: An explicit deny (!rhost) is resolved first. Second, SSSD searches for explicit allow (rhost) and finally for allow_all (*).
pt: Um deny explícito (rhost) é resolvido primeiro. Segundo, o SSSD procura um allow explícito (rhost) e finalmente por allow_all (*).

source: Please note that the ldap_access_order configuration option <emphasis>must</emphasis> include <quote>rhost</quote> in order for the ldap_user_authorized_rhost option to work.
pt: Por favor note que a opção de configuração ldap_access_order <emphasis>tem</emphasis> de incluir <quote>rhost</quote> para que a opção ldap_user_authorized_rhost funcione.

source: Default: rhost
pt: Predefinição: rhost

source: Name of the LDAP attribute containing the X509 certificate of the user.
pt: Nome do atributo LDAP que contém o certificado X509 do utilizador.

source: Default: userCertificate;binary
pt: Predefinição: userCertificate;binary

source: Name of the LDAP attribute containing the email address of the user.
pt: Nome do atributo LDAP que contém o endereço email do utilizador.

source: Note: If an email address of a user conflicts with an email address or fully qualified name of another user, then SSSD will not be able to serve those users properly. This option allows users to login by (1) username, and (2) e-mail address. If for some reason several users need to share the same email address then set this option to a nonexistent attribute name in order to disable user lookup/login by email.
pt: Nota: Se um endereço de email de um utilizador entrar em conflito com um endereço de email ou nome totalmente qualificado de outro utilizador, então o SSSD não será capaz de servir esses utilizadores de maneira apropriada. Esta opção permite aos utilizadores fazerem login por (1) nome de utilizador, e (2) endereço de email. Se por alguma razão vários utilizadores precisarem de partilhar o mesmo endereço de email então defina esta opção para um nome de atributo não-existente de modo a desactivar a pesquisa/login de utilizador por email.

source: Default: mail
pt: Predefinição: mail

source: Name of the LDAP attribute containing the passkey mapping data of the user.
pt: Nome do atributo LDAP que contém os dados de mapeamento da passkey do utilizador.

source: Default: passkey (LDAP), ipaPassKey (IPA), altSecurityIdentities (AD)
pt: Predefinição: passkey (LDAP), ipaPassKey (IPA), altSecurityIdentities (AD)

source: GROUP ATTRIBUTES
pt: ATRIBUTOS DE GRUPO

source: The object class of a group entry in LDAP.
pt: A classe de objecto de uma entrada de grupo em LDAP.

source: Default: posixGroup
pt: Predefinição: posixGroup

source: The LDAP attribute that corresponds to the group name. In an environment with nested groups, this value must be an LDAP attribute which has a unique name for every group. This requirement includes non-POSIX groups in the tree of nested groups.
pt: O atributo LDAP que corresponde ao nome do grupo. Num ambiente com grupos aninhados, este valor tem de ser um atributo LDAP que tem um nome único para cada grupo. Este requerimento inclui grupos não-POSIX na árvore dos grupos aninhados.

source: Default: cn (rfc2307, rfc2307bis and IPA), sAMAccountName (AD)
pt: Predefinição: cn (rfc2307, rfc2307bis e IPA), sAMAccountName (AD)

source: The LDAP attribute that corresponds to the group's id.
pt: O atributo LDAP que corresponde ao id do grupo.

source: The LDAP attribute that contains the names of the group's members.
pt: O atributo do LDAP que contém os nomes dos membros do grupo.

source: Default: memberuid (rfc2307) / member (rfc2307bis)
pt: Predefinição: memberuid (rfc2307) / member (rfc2307bis)

source: The LDAP attribute that contains the UUID/GUID of an LDAP group object.
pt: O atributo do LDAP que contém o UUID/GUID de um objecto grupo de LDAP.

source: The LDAP attribute that contains the objectSID of an LDAP group object. This is usually only necessary for ActiveDirectory servers.
pt: O atributo do LDAP que contém o objectSID de um objecto grupo LDAP. Isto é geralmente apenas necessário para servidores ActiveDirectory.

source: The LDAP attribute that contains an integer value indicating the type of the group and maybe other flags.
pt: O atributo LDAP que contém um valor inteiro que indica o tipo de grupo e talvez outras bandeiras.

source: This attribute is currently only used by the AD provider to determine if a group is a domain local groups and has to be filtered out for trusted domains.
pt: Este atributo actualmente é usado apenas pelo provedor AD para determinar se um grupo é um grupo local de domínio e tem de ser filtrado dos domínios de confiança.

source: Default: groupType in the AD provider, otherwise not set
pt: Predefinição: groupType no provedor AD, caso contrário não definido

source: The LDAP attribute that references group members that are defined in an external domain. At the moment, only IPA's external members are supported.
pt: O atributo LDAP que referencia membros de grupo que estão definidos num domínio externo. De momento, apenas os membros externos do IPA são suportados.

source: Default: ipaExternalMember in the IPA provider, otherwise unset.
pt: Predefinição: ipaExternalMember no provedor IPA, caso contrário não definido.

source: NETGROUP ATTRIBUTES
pt: ATRIBUTOS DE NETGROUP

source: The object class of a netgroup entry in LDAP.
pt: A classe de objecto de uma entrada netgroup em LDAP.

source: In IPA provider, ipa_netgroup_object_class should be used instead.
pt: No provedor IPA, deve ser usado ipa_netgroup_object_class em vez deste.

source: Default: nisNetgroup
pt: Predefinição: nisNetgroup

source: The LDAP attribute that corresponds to the netgroup name.
pt: O atributo LDAP que corresponde ao nome netgroup.

source: In IPA provider, ipa_netgroup_name should be used instead.
pt: No provedor IPA, deve ser usado ipa_netgroup_name em vez deste.

source: The LDAP attribute that contains the names of the netgroup's members.
pt: O atributo do LDAP que contém os nomes dos membros do netgroup.

source: In IPA provider, ipa_netgroup_member should be used instead.
pt: No provedor IPA, deve ser usado ipa_netgroup_member em vez deste.

source: Default: memberNisNetgroup
pt: Predefinição: memberNisNetgroup

source: The LDAP attribute that contains the (host, user, domain) netgroup triples.
pt: O atributo do LDAP que contém os triplos netgroup (máquina, utilizador, domínio).

source: This option is not available in IPA provider.
pt: Esta opção não está disponível no provedor IPA.

source: Default: nisNetgroupTriple
pt: Predefinição: nisNetgroupTriple

source: HOST ATTRIBUTES
pt: ATRIBUTOS DE ANFITRIÃO

source: The object class of a host entry in LDAP.
pt: A classe de objecto de uma entrada de máquina em LDAP.

source: Default: ipService
pt: Predefinição: ipService

source: The LDAP attribute that corresponds to the host's name.
pt: O atributo LDAP que corresponde ao nome da máquina.

source: The LDAP attribute that corresponds to the host's fully-qualified domain name.
pt: O atributo LDAP que corresponde ao nome de domínio totalmente qualificado da máquina.

source: Default: fqdn
pt: Predefinição: fqdn

source: Default: serverHostname
pt: Predefinição: serverHostname

source: The LDAP attribute that lists the host's group memberships.
pt: O atributo LDAP que lista os membros do grupo da máquina.

source: The LDAP attribute that contains the host's SSH public keys.
pt: O atributo LDAP que contém as chaves públicas SSH da máquina.

source: The LDAP attribute that contains the UUID/GUID of an LDAP host object.
pt: O atributo do LDAP que contém o UUID/GUID de um objecto máquina de LDAP.

source: SERVICE ATTRIBUTES
pt: ATRIBUTOS DE SERVIÇO

source: The object class of a service entry in LDAP.
pt: A classe de objecto de uma entrada de serviço em LDAP.

source: The LDAP attribute that contains the name of service attributes and their aliases.
pt: O atributo do LDAP que contém o nome dos atributos de serviços e os seus nomes alternativos (aliases).
