Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: Comma separated list of domains and subdomains representing the lookup order that will be followed. The list doesn't have to include all possible domains as the missing domains will be looked up based on the order they're presented in the <quote>domains</quote> configuration option. The subdomains which are not listed as part of <quote>lookup_order</quote> will be looked up in a random order for each parent domain.
pt: Lista separada por vírgulas de domínios e subdomínios que representa a ordem de procura que será seguida. A lista não tem de incluir todos os domínios possíveis pois os domínios em falta serão vistos com base na ordem que foram apresentados na opção de configuração <quote>domains</quote>. Os subdomínios que não estão listados como parte de <quote>lookup_order</quote> irão ser vistos numa ordem aleatória para cada domínio pai.

source: Please, note that when this option is set the output format of all commands is always fully-qualified even when using short names for input. In case the administrator wants the output not fully-qualified, the full_name_format option can be used as shown below: <quote>full_name_format=%1$s</quote> However, keep in mind that during login, login applications often canonicalize the username by calling <citerefentry> <refentrytitle>getpwnam</refentrytitle> <manvolnum>3</manvolnum> </citerefentry> which, if a shortname is returned for a qualified input (while trying to reach a user which exists in multiple domains) might re-route the login attempt into the domain which uses shortnames, making this workaround totally not recommended in cases where usernames may overlap between domains.
pt: Por favor, note que quando esta opção está definida o formato de saída de todos os comandos é sempre totalmente-qualificado mesmo quando se usa nomes curtos para a entrada. No caso do administrador querer os resultados não totalmente-qualificados, a opção full_name_format pode ser usada como mostrado em baixo: <quote>full_name_format=%1$s</quote> No entanto, lembre que durante o login, as aplicações de login muitas vezes canonizam o nome de utilizador ao chamarem <citerefentry> <refentrytitle>getpwnam</refentrytitle> <manvolnum>3</manvolnum> </citerefentry> o qual, se um nome curto for retornado para uma entrada qualificada (enquanto se tenta alcançar um utilizador que existe em múltiplos domínios) pode re-rotear a tentativa de login para o domínio que usa nomes curtos, tornando este contorno totalmente não recomendado nos casos onde os nomes de utilizadores podem sobrepor-se entre domínios.

source: Default: Not set
pt: Predefinição: Não definida

source: implicit_pac_responder (boolean)
pt: implicit_pac_responder (booleano)

source: The PAC responder is enabled automatically for the IPA and AD provider to evaluate and check the PAC. If it has to be disabled set this option to 'false'.
pt: O respondedor PAC é activado automaticamente para o provedor IPA e AD para avaliar e verificar o PAC. Se isso tiver de ser desactivado defina esta opção para 'false'.

source: core_dumpable (boolean)
pt: core_dumpable (booleano)

source: This option can be used for general system hardening: setting it to 'false' forbids core dumps for all SSSD processes to avoid leaking plain text passwords. See man page prctl:PR_SET_DUMPABLE on Linux or procctl:PROC_TRACE_CTL on FreeBSD for details.
pt: Esta opção pode ser usada para endurecimento geral do sistema: definindo-a para 'false' proíbe despejos do núcleo para todos os processos do SSSD para evitar fugas de palavras passe em texto simples. Veja o manual prctl:PR_SET_DUMPABLE em Linux ou procctl:PROC_TRACE_CTL em FreeBSD para detalhes.

source: Take a note that this setting has no effect for 'ldap_child', 'krb5_child' and 'sssd_pam' as those privileged binaries can have a copy of a host keytab data in a memory and their behavior in this regards is governed by /proc/sys/fs/suid_dumpable system setting.
pt: Note que esta definição não tem efeito para 'ldap_child', 'krb5_child' e 'sssd_pam' pois esses binários privilegiados podem ter uma cópia dos dados keytab da máquina na memória e o seu comportamento para estes assuntos é governado pela definição de sistema /proc/sys/fs/suid_dumpable.

source: Enable or disable the user verification (i.e. PIN, fingerprint) during authentication. If enabled, the PIN will always be requested.
pt: Ativa ou desativa a verificação de utilizador (isto é, PIN, impressão digital) durante a autenticação. Se ativo, o PIN será sempre pedido.

source: The default is that the key settings decide what to do. In the IPA or kerberos pre-authentication case, this value will be overwritten by the server.
pt: A predefinição é que as definições da chave decidem o que fazer. No caso de pré-autenticação IPA ou kerberos, este valor irá ser sobreposto pelo servidor.

source: With this parameter the passkey verification can be tuned with a comma separated list of options. Supported options are: <placeholder type="variablelist" id="0"/>
pt: Com este parâmetro a verificação passkey pode ser afinada com uma lista de opções separadas por vírgulas. As opções suportadas são: <placeholder type="variablelist" id="0"/>

source: Individual pieces of SSSD functionality are provided by special SSSD services that are started and stopped together with SSSD. The services are managed by a special service frequently called <quote>monitor</quote>. The <quote>[sssd]</quote> section is used to configure the monitor as well as some other important options like the identity domains. <placeholder type="variablelist" id="0"/>
pt: Peças individuais da funcionalidade do SSSD são fornecidas por serviços SSSD especiais que são arrancados e parados juntamente com o SSSD. Os serviços são geridos por um serviço especial frequentemente chamado <quote>monitor</quote>. A secção <quote>[sssd]</quote> é usada para configurar o monitor assim como outras opções importantes como os domínios de identidade. <placeholder type="variablelist" id="0"/>

source: SERVICES SECTIONS
pt: SECÇÕES DE SERVIÇOS

source: Settings that can be used to configure different services are described in this section. They should reside in the [<replaceable>$NAME</replaceable>] section, for example, for NSS service, the section would be <quote>[nss]</quote>
pt: As definições que podem ser usadas para configurar os diferentes serviços são descritas nesta secção. Elas devem residir na secção [<replaceable>$NOME</replaceable>], por exemplo, para o serviço NSS, a secção será <quote>[nss]</quote>

source: General service configuration options
pt: Opções de configuração de serviços gerais

source: These options can be used to configure any service.
pt: Estas opções podem ser usadas para configurar qualquer serviço.

source: This option specifies the maximum number of file descriptors that may be opened at one time by this SSSD process. On systems where SSSD is granted the CAP_SYS_RESOURCE capability, this will be an absolute setting. On systems without this capability, the resulting value will be the lower value of this or the limits.conf "hard" limit.
pt: Esta opção especifica o número máximo de descritores de ficheiro que podem ser abertos de uma vez por estes processos do SSSD. Em sistemas onde o SSSD tem garantida a capacidade CAP_SYS_RESOURCE, isto será uma definição absoluta. Em sistema sem esta capacidade, o valor resultante irá ser o menor valor disto ou limite "hard" do limits.conf.

source: Default: 8192 (or limits.conf "hard" limit)
pt: Predefinição: 8192 (ou limite "hard" de limits.conf)

source: This option specifies the number of seconds that a client of an SSSD process can hold onto a file descriptor without communicating on it. This value is limited in order to avoid resource exhaustion on the system. The timeout can't be shorter than 10 seconds. If a lower value is configured, it will be adjusted to 10 seconds.
pt: Esta opção especifica o número de segundos que um cliente de um processo SSSD pode esperar por um descritor de ficheiro sem comunicar nele. Este valor é limitado de modo a evitar a exaustão de recursos do sistema. O tempo limite não pode ser mais curto que 10 segundos. Se for configurado um valor menor, será ajustado para 10 segundos.

source: Default: 60, KCM: 300
pt: Predefinição: 60, KCM: 300

source: offline_timeout (integer)
pt: offline_timeout (inteiro)

source: When SSSD switches to offline mode the amount of time before it tries to go back online will increase based upon the time spent disconnected. By default SSSD uses incremental behaviour to calculate delay in between retries. So, the wait time for a given retry will be longer than the wait time for the previous ones. After each unsuccessful attempt to go online, the new interval is recalculated by the following:
pt: Quando o SSSD comuta para modo offline a quantidade de tempo antes de tentar voltar online irá aumentar com base no tempo que passou desligado. Por predefinição o SSSD usa comportamento incremental para calcular o atraso entre tentativas. Assim, o tempo de espera para uma dada tentativa será maior que o tempo de espera das anteriores. Após cada tentativa sem sucesso de ir online, o novo intervalo é recalculado pelo seguinte:

source: The offline_timeout default value is 60. The offline_timeout_max default value is 3600. The offline_timeout_random_offset default value is 30. The end result is amount of seconds before next retry.
pt: O valor predefinido de offline_timeout é 60. O valor predefinido de offline_timeout_max é 3600. O valor predefinido de offline_timeout_random_offset é 30. O resultado final é a quantidade de segundos antes da próxima tentativa.

source: Note that the maximum length of each interval is defined by offline_timeout_max (apart of random part).
pt: Note que a duração máxima de cada intervalo é definida por offline_timeout_max (à parte da parte aleatória).

source: Default: 60
pt: Predefinição: 60

source: offline_timeout_max (integer)
pt: offline_timeout_max (inteiro)

source: Controls by how much the time between attempts to go online can be incremented following unsuccessful attempts to go online.
pt: Controla quanto o tempo entre tentativas de ir online pode ser incrementado a seguir a tentativas de ir online sem sucesso.

source: A value of 0 disables the incrementing behaviour.
pt: Um valor de 0 desactiva o comportamento incremental.

source: The value of this parameter should be set in correlation to offline_timeout parameter value.
pt: O valor deste parâmetro deve ser definido em correlação com o valor do parâmetro offline_timeout.

source: With offline_timeout set to 60 (default value) there is no point in setting offlinet_timeout_max to less than 120 as it will saturate instantly. General rule here should be to set offline_timeout_max to at least 4 times offline_timeout.
pt: Com offline_timeout definido para 60 (valor predefinido) não faz sentido definir offline_timeout_max para menos de 120 pois isso iria saturar instantaneamente. Geralmente a regra aqui deverá ser definir offline_timeout_max para pelo menos 4 vezes o offline_timeout.

source: Although a value between 0 and offline_timeout may be specified, it has the effect of overriding the offline_timeout value so is of little use.
pt: Apesar de poder ser especificado um valor entre 0 e offline_timeout, isso tem o efeito de sobrepor o valor offline_timeout, assim tem pouca utilidade.

source: Default: 3600
pt: Predefinição: 3600

source: offline_timeout_random_offset (integer)
pt: offline_timeout_random_offset (inteiro)

source: When SSSD is in offline mode it keeps probing backend servers in specified time intervals:
pt: Quando o SSSD está em modo offline continua a fazer provas a servidores backend em intervalos de tempo especificados:

source: This parameter controls the value of the random offset used for the above equation. Final random_offset value will be random number in range:
pt: Este parâmetro controla o valor do desvio aleatório usado para a equação em cima. O valor random_offset final será um número aleatório dentro da gama:

source: A value of 0 disables the random offset addition.
pt: Um valor de 0 desactiva a adição de desvio aleatório.

source: Default: 30
pt: Predefinição: 30

source: This option specifies the number of seconds that an SSSD responder process can be up without being used. This value is limited in order to avoid resource exhaustion on the system. The minimum acceptable value for this option is 60 seconds. Setting this option to 0 (zero) means that no timeout will be set up to the responder. This option only has effect when SSSD is built with systemd support and when services are either socket or D-Bus activated.
pt: Esta opção especifica o número de segundos que um processo respondedor do SSSD pode estar activo sem ser usado. Este valor é limitado para evitar a exaustão de recursos do sistema. O valor mínimo aceitável para esta opção é 60 segundos. Definir esta opção para 0 (zero) significa que nenhum tempo limite será definido para o respondedor. Esta opção apenas tem efeito quando o SSSD é compilado com suporte a systemd e quando os serviços são activados ou em socket ou em D-Bus.

source: Default: 300
pt: Predefinição: 300

source: This option specifies whether the responder should query all caches before querying the Data Providers.
pt: Esta opção especifica se o respondedor deve questionar todas as caches antes de questionar os Provedores de Dados.

source: NSS configuration options
pt: Opções de configuração do NSS

source: These options can be used to configure the Name Service Switch (NSS) service.
pt: Estas opções podem ser usadas para configurar o serviço Name Service Switch (NSS).

source: enum_cache_timeout (integer)
pt: enum_cache_timeout (inteiro)

source: How many seconds should nss_sss cache enumerations (requests for info about all users)
pt: Quantos segundos deve nss_sss manter em cache enumerações (pedidos de informação sobre todos os utilizadores)

source: Default: 120
pt: Predefinição: 120

source: entry_cache_nowait_percentage (integer)
pt: entry_cache_nowait_percentage (inteiro)

source: The entry cache can be set to automatically update entries in the background if they are requested beyond a percentage of the entry_cache_timeout value for the domain.
pt: A cache de entrada pode ser definida para actualizar automaticamente as entradas em segundo plano se elas forem requisitadas para lá duma percentagem do valor entry_cache_timeout do domínio.

source: For example, if the domain's entry_cache_timeout is set to 30s and entry_cache_nowait_percentage is set to 50 (percent), entries that come in after 15 seconds past the last cache update will be returned immediately, but the SSSD will go and update the cache on its own, so that future requests will not need to block waiting for a cache update.
pt: Por exemplo, se entry_cache_timeout do domínio for definido para 30s e entry_cache_nowait_percentage for definido para 50 (porcento), as entradas que cheguem após 15 segundos após a última actualização da cache serão retornadas imediatamente, mas o SSSD irá continuar e actualizar a cache por si, para que pedidos futuros não precisem de bloquear à espera de uma actualização à cache.

source: Valid values for this option are 0-99 and represent a percentage of the entry_cache_timeout for each domain. For performance reasons, this percentage will never reduce the nowait timeout to less than 10 seconds. (0 disables this feature)
pt: Valores válidos para esta opção são 0-99 e representam um percentagem de entry_cache_timeout para cada domínio. Por razões de performance, esta percentagem nunca irá reduzir o tempo limite nowait para menos de 10 segundos. (0 desactiva esta funcionalidade)

source: Default: 50
pt: Predefinição: 50

source: entry_negative_timeout (integer)
pt: entry_negative_timeout (inteiro)

source: Specifies for how many seconds nss_sss should cache negative cache hits (that is, queries for invalid database entries, like nonexistent ones) before asking the back end again.
pt: Especifica durante quantos segundos deve o nss_sss manter em cache entradas de cache negativas (isto é, consultas por entradas inválidas na base de dados, como as não existentes) antes de perguntar de novo ao backend.

source: Default: 15
pt: Predefinição: 15

source: Exclude certain users or groups from being fetched from the sss NSS database. This is particularly useful for system accounts. This option can also be set per-domain or include fully-qualified names to filter only users from the particular domain or by a user principal name (UPN).
pt: Exclui certos utilizadores ou grupos de serem obtidos a partir da base de dados sss do NSS. Isto é particularmente útil para contas do sistema. Esta opção pode também ser definida por-domínio ou incluir nomes totalmente qualificados para filtrar apenas utilizadores de um domínio particular ou por um nome principal de utilizador (UPN).

source: NOTE: The filter_groups option doesn't affect inheritance of nested group members, since filtering happens after they are propagated for returning via NSS. E.g. a group having a member group filtered out will still have the member users of the latter listed.
pt: NOTA: A opção filter_groups não afeta a herança de membros de grupo aninhados, pois a filtragem acontece apos eles serem propagados para retornar via NSS. Ex. um grupo a ter um membro do grupo filtrado irão ainda ter os utilizadores membros na listagem posterior.

source: Default: root
pt: Predefinição: root

source: filter_users_in_groups (bool)
pt: filter_users_in_groups (booleano)

source: If you want filtered user still be group members set this option to false.
pt: Se você deseja que o utilizador filtrado ainda seja membro de grupo defina esta opção para false.

source: Set a default template for a user's home directory if one is not specified explicitly by the domain's data provider.
pt: Define um modelo predefinido para o directório home do utilizador se nenhum foi especificado explicitamente pelo provedor de dados do domínio.

source: The available values for this option are the same as for override_homedir.
pt: Os valores disponíveis para esta opção são os mesmos que para override_homedir.

source: example: <placeholder type="programlisting" id="0"/>
pt: exemplo: <placeholder type="programlisting" id="0"/>

source: Default: not set (no substitution for unset home directories)
pt: Predefinição: não definida (nenhum substituição para directórios home não definidos)

source: Override the login shell for all users. This option supersedes any other shell options if it takes effect and can be set either in the [nss] section or per-domain.
pt: Sobrepõe a shell de login para todos os utilizadores. Esta opção suplanta quaisquer outras opções de shell se tomar efeito e pode ser definida ou na secção [nss] ou por-domínio.

source: Default: not set (SSSD will use the value retrieved from LDAP)
pt: Predefinição: não definida (o SSSD irá usar o valor obtido de LDAP)

source: Restrict user shell to one of the listed values. The order of evaluation is:
pt: Restringe a shell de utilizador para um dos valores listados. A ordem de avaliação é:

source: 1. If the shell is present in <quote>/etc/shells</quote>, it is used.
pt: 1. Se a shell está presente em <quote>/etc/shells</quote>, é usada.

source: 2. If the shell is in the allowed_shells list but not in <quote>/etc/shells</quote>, use the value of the shell_fallback parameter.
pt: 2. Se a shell está na lista allowed_shells mas não em <quote>/etc/shells</quote>, usa o valor do parâmetro shell_fallback.

source: 3. If the shell is not in the allowed_shells list and not in <quote>/etc/shells</quote>, a nologin shell is used.
pt: 3. Se a shell não está na lista allowed_shells e também não em <quote>/etc/shells</quote>, é usada uma shell nologin.

source: The wildcard (*) can be used to allow any shell.
pt: O asterisco (*) pode ser usado para permitir qualquer shell.

source: The (*) is useful if you want to use shell_fallback in case that user's shell is not in <quote>/etc/shells</quote> and maintaining list of all allowed shells in allowed_shells would be to much overhead.
pt: O (*) é útil se você desejar usar shell_fallback no caso da shell do utilizador não esteja em <quote>/etc/shells</quote> e mantendo a lista de todas as shells permitidas em allowed_shells seria grande sobrecarga.

source: An empty string for shell is passed as-is to libc.
pt: Uma string vazia para shell é passada como está ao libc.

source: The <quote>/etc/shells</quote> is only read on SSSD start up, which means that a restart of the SSSD is required in case a new shell is installed.
pt: O <quote>/etc/shells</quote> apenas é lido no arranque do SSSD, o que significa que é necessário um reinicio do SSSD no caso de uma nova shell ser instalada.

source: Default: Not set. The user shell is automatically used.
pt: Predefinição: Não definida. A shell do utilizador é automaticamente usada.

source: Replace any instance of these shells with the shell_fallback
pt: Substitui qualquer instância destas shells por shell_fallback

source: The default shell to use if an allowed shell is not installed on the machine.
pt: A shell predefinida a usar se uma shell permitida não estiver instalada na máquina.

source: Default: /bin/sh
pt: Predefinição: /bin/sh

source: The default shell to use if the provider does not return one during lookup. This option can be specified globally in the [nss] section or per-domain.
pt: A shell predefinida a usar se o provedor não retornar uma durante a pesquisa. Esta opção pode ser especificada globalmente na secção [nss] ou por-domínio.

source: Default: not set (Return NULL if no shell is specified and rely on libc to substitute something sensible when necessary, usually /bin/sh)
pt: Predefinição: não definida (Retorna NULL se nenhuma shell for especificada e confia em libc para substituir algo sensível quando necessário, geralmente /bin/sh)

source: get_domains_timeout (int)
pt: get_domains_timeout (inteiro)

source: Specifies time in seconds for which the list of subdomains will be considered valid.
pt: Especifica o tempo em segundos no qual a lista de subdomínios será considerada válida.

source: memcache_timeout (integer)
pt: memcache_timeout (inteiro)

source: Specifies time in seconds for which records in the in-memory cache will be valid. Setting this option to zero will disable the in-memory cache.
pt: Especifica o tempo em segundos no qual os registos na cache em-memória sejam válidos. Definir esta opção para zero irá desactivar a cache em-memória.

source: WARNING: Disabling the in-memory cache will have significant negative impact on SSSD's performance and should only be used for testing.
pt: AVISO: Desactivar a cache em-memória irá ter um impacto negativo significante na performance do SSSD e apenas deve ser usado para testes.

source: NOTE: If the environment variable SSS_NSS_USE_MEMCACHE is set to "NO", client applications will not use the fast in-memory cache.
pt: NOTA: Se a variável de ambiente SSS_NSS_USE_MEMCACHE for definida para "NO", as aplicações do cliente não irão usar a rápida cache em-memória.

source: memcache_size_passwd (integer)
pt: memcache_size_passwd (inteiro)

source: Size (in megabytes) of the data table allocated inside fast in-memory cache for passwd requests. Setting the size to 0 will disable the passwd in-memory cache.
pt: Tamanho (em megabytes) da tabela de dados alocada dentro da cache em-memória rápida para pedidos de passwd. Definir o tamanho para 0 irá desactivar a cache em-memória de passwd.

source: Default: 8
pt: Predefinição: 8

source: WARNING: Disabled or too small in-memory cache can have significant negative impact on SSSD's performance.
pt: AVISO: A cache em-memória desactivada ou muito pequena pode ter impacto negativo significante na performance do SSSD.

source: memcache_size_group (integer)
pt: memcache_size_group (inteiro)
