Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: Forces a password change when server side password policy controls are enabled and remaining grace logins returned by the server after the authentication reach or go below the threshold. Note that the minimum useful value is 2, as changing the password consumes 2 additional grace logins, one to verify the current password and a second one to perform the password change.
pt: Força uma mudança de palavra passe quando os controlos de política de palavra passe do lado do servidor estão ativos e os logins de graça restantes retornados pelo servidor após a autenticação atingiram ou estão abaixo do limiar. Note que o valor útil mínimo é 2, pois mudar a palavra passe consome 2 logins de graça adicionais, um para verificar a palavra passe atual e o segundo para executar a mudança da palavra passe.

source: All of the common configuration options that apply to SSSD domains also apply to LDAP domains. Refer to the <quote>DOMAIN SECTIONS</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page for full details. Note that SSSD LDAP mapping attributes are described in the <citerefentry> <refentrytitle>sssd-ldap-attributes</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page. <placeholder type="variablelist" id="0"/>
pt: Todas as opções de configuração comuns que se aplicam a domínios SSSD também se aplicam a domínios LDAP. Consulte a secção <quote>SECÇÕES DE DOMÍNIO</quote> do manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para todos os detalhes. Note que os atributos de mapeamento LDAP do SSSD estão descritos no manual <citerefentry> <refentrytitle>sssd-ldap-attributes</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>. <placeholder type="variablelist" id="0"/>

source: SUDO OPTIONS
pt: OPÇÕES DO SUDO

source: The detailed instructions for configuration of sudo_provider are in the manual page <citerefentry> <refentrytitle>sssd-sudo</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.
pt: As instruções detalhadas para configuração do provedor sudo estão no manual <citerefentry> <refentrytitle>sssd-sudo</refentrytitle> <manvolnum>5</manvolnum> </citerefentry>.

source: ldap_sudo_full_refresh_interval (integer)
pt: ldap_sudo_full_refresh_interval (inteiro)

source: How many seconds SSSD will wait between executing a full refresh of sudo rules (which downloads all rules that are stored on the server).
pt: Quantos segundos o SSSD irá esperar entre execuções de refrescar total das regras sudo (as quais descarregam todas as regras que estão guardadas no servidor).

source: The value must be greater than <emphasis>ldap_sudo_smart_refresh_interval </emphasis>
pt: O valor tem de ser maior que <emphasis>ldap_sudo_smart_refresh_interval </emphasis>

source: You can disable full refresh by setting this option to 0. However, either smart or full refresh must be enabled.
pt: Você pode desactivar o refrescamento total ao definir esta opção para 0. No entanto, o refrescamento seja inteligente ou total tem de ser activado.

source: Default: 21600 (6 hours)
pt: Predefinição: 21600 (6 horas)

source: ldap_sudo_smart_refresh_interval (integer)
pt: ldap_sudo_smart_refresh_interval (inteiro)

source: How many seconds SSSD has to wait before executing a smart refresh of sudo rules (which downloads all rules that have USN higher than the highest server USN value that is currently known by SSSD).
pt: Quantos segundos o SSSD tem de esperar antes de executar um refrescar inteligente de regras sudo (o qual descarrega todas as regras que têm USN mais alto que o valor USN do servidor mais alto que é actualmente conhecido pelo SSSD).

source: If USN attributes are not supported by the server, the modifyTimestamp attribute is used instead.
pt: Se os atributos USN não forem suportados pelo servidor, é usado o atributo modifyTimestamp em vez destes.

source: <emphasis>Note:</emphasis> the highest USN value can be updated by three tasks: 1) By sudo full and smart refresh (if updated rules are found), 2) by enumeration of users and groups (if enabled and updated users or groups are found) and 3) by reconnecting to the server (by default every 15 minutes, see <emphasis>ldap_connection_expire_timeout</emphasis>).
pt: <emphasis>Nota:</emphasis> o valor USN mais alto pode ser actualizado por três tarefas: 1) Por refrescar total e inteligente do sudo (se forem encontradas regras actualizadas). 2) pela enumeração de utilizadores e grupos (se activa e se forem encontrados utilizadores e grupos actualizados) e 3) ao religar ao servidor (por predefinição a cada 15 minutos, veja <emphasis>ldap_connection_expire_timeout</emphasis>).

source: You can disable smart refresh by setting this option to 0. However, either smart or full refresh must be enabled.
pt: Você pode desactivar o refrescamento inteligente ao definir esta opção para 0. No entanto, o refrescamento seja inteligente ou total tem de ser activado.

source: ldap_sudo_random_offset (integer)
pt: ldap_sudo_random_offset (inteiro)

source: Random offset between 0 and configured value is added to smart and full refresh periods each time the periodic task is scheduled. The value is in seconds.
pt: Desvio aleatório entre 0 e valor configurado é adicionado a períodos de refrescamento inteligente e completo de cada vez que a tarefa periódica é agendada. O valor é em segundos.

source: Note that this random offset is also applied on the first SSSD start which delays the first sudo rules refresh. This prolongs the time when the sudo rules are not available for use.
pt: Note que o desvio aleatório é também aplicado no primeiro arranque do SSSD o que atrasa o primeiro refrescamento de regras sudo. Isto prolonga o tempo em que as regras sudo não estão disponíveis para uso.

source: You can disable this offset by setting the value to 0.
pt: Você pode desactivar este desvio ao definir o valor para 0.

source: ldap_sudo_use_host_filter (boolean)
pt: ldap_sudo_use_host_filter (booleano)

source: If true, SSSD will download only rules that are applicable to this machine (using the IPv4 or IPv6 host/network addresses and hostnames).
pt: Se true, o SSSD irá descarregar apenas regras que são aplicáveis a esta máquina (usando endereços e nomes de máquinas IPv4 ou IPv6 máquina/rede).

source: Space separated list of hostnames or fully qualified domain names that should be used to filter the rules.
pt: Lista separada por espaços de nomes de máquinas ou nomes de domínio totalmente qualificados que devem ser usados para filtras as regras.

source: If this option is empty, SSSD will try to discover the hostname and the fully qualified domain name automatically.
pt: Se esta opção estiver vazia, o SSSD irá tentar descobrir automaticamente o nome de máquina e o nome de domínio totalmente qualificado.

source: If <emphasis>ldap_sudo_use_host_filter</emphasis> is <emphasis>false</emphasis> then this option has no effect.
pt: Se <emphasis>ldap_sudo_use_host_filter</emphasis> for <emphasis>false</emphasis> então esta opção não tem nenhum efeito.

source: Default: not specified
pt: Predefinição: não especificada

source: Space separated list of IPv4 or IPv6 host/network addresses that should be used to filter the rules.
pt: Lista separada por espaços de endereços IPv4 ou IPv6 máquina/rede que devem ser usados para filtrar as regras.

source: If this option is empty, SSSD will try to discover the addresses automatically.
pt: Se esta opção estiver vazia, o SSSD irá tentar descobrir os endereços automaticamente.

source: ldap_sudo_include_netgroups (boolean)
pt: ldap_sudo_include_netgroups (booleano)

source: If true then SSSD will download every rule that contains a netgroup in sudoHost attribute.
pt: Se true então o SSSD irá descarregar todas as regras que contenham um netgroup no atributo sudoHost.

source: ldap_sudo_include_regexp (boolean)
pt: ldap_sudo_include_regexp (booleano)

source: If true then SSSD will download every rule that contains a wildcard in sudoHost attribute.
pt: Se true então o SSSD irá descarregar todas as regras que contenham um wildcard no atributo sudoHost.

source: Using wildcard is an operation that is very costly to evaluate on the LDAP server side!
pt: Usar a wildcard é uma operação com muito custo para avaliar no lado do servidor LDAP!

source: This manual page only describes attribute name mapping. For detailed explanation of sudo related attribute semantics, see <citerefentry> <refentrytitle>sudoers.ldap</refentrytitle><manvolnum>5</manvolnum> </citerefentry>
pt: Este manual apenas descreve o mapeamento de nomes de atributos. Para explicação detalhada de semânticas de atributos relacionados com sudo, veja <citerefentry> <refentrytitle>sudoers.ldap</refentrytitle><manvolnum>5</manvolnum> </citerefentry>

source: AUTOFS OPTIONS
pt: OPÇÕES DO AUTOFS

source: Some of the defaults for the parameters below are dependent on the LDAP schema.
pt: Algumas das predefinições para os parâmetros em baixo dependem do esquema LDAP.

source: The name of the automount master map in LDAP.
pt: O nome do mapa mestre automount no LDAP.

source: Default: auto.master
pt: Predefinição: auto.master

source: ADVANCED OPTIONS
pt: OPÇÕES AVANÇADAS

source: If the option <quote>ldap_use_tokengroups</quote> is enabled, the searches against Active Directory will not be restricted and return all groups memberships, even with no GID mapping. It is recommended to disable this feature, if group names are not being displayed correctly.
pt: Se a opção <quote>ldap_use_tokengroups</quote> estiver activa, as buscas contra Active Directory não ficam restritas e retornam todos os membros dos grupos, mesmo sem mapeamento GID. É recomendado desactivar esta funcionalidade, se os nomes de grupos não forem mostrados corretamente.

source: These options are supported by LDAP domains, but they should be used with caution. Please include them in your configuration only if you know what you are doing. <placeholder type="variablelist" id="0"/> <placeholder type="variablelist" id="1"/>
pt: Estas opções são suportadas por domínios LDAP, mas devem ser usadas com cuidado. Por favor inclua-as na sua configuração apenas se souber o que está a fazer. <placeholder type="variablelist" id="0"/> <placeholder type="variablelist" id="1"/>

source: EXAMPLE
pt: EXEMPLO

source: The following example assumes that SSSD is correctly configured and LDAP is set to one of the domains in the <replaceable>[domains]</replaceable> section.
pt: O seguinte exemplo assume que o SSSD está actualmente configurado e o LDAP está definido para um dos domínios na secção <replaceable>[domains]</replaceable>.

source: LDAP ACCESS FILTER EXAMPLE
pt: EXEMPLO DE FILTRO DE ACESSO LDAP

source: The following example assumes that SSSD is correctly configured and to use the ldap_access_order=lockout.
pt: O seguinte exemplo assume que o SSSD está actualmente configurado e usa o ldap_access_order=lockout.

source: NOTES
pt: NOTAS

source: The descriptions of some of the configuration options in this manual page are based on the <citerefentry> <refentrytitle>ldap.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page from the OpenLDAP 2.4 distribution.
pt: As descrições de algumas das opções de configuração neste manual são baseadas no manual <citerefentry> <refentrytitle>ldap.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> da distribuição OpenLDAP 2.4.

source: PAM module for SSSD
pt: Módulo PAM para SSSD

source: <command>pam_sss.so</command> is the PAM interface to the System Security Services daemon (SSSD). Errors and results are logged through <command>syslog(3)</command> with the LOG_AUTHPRIV facility.
pt: <command>pam_sss.so</command> é a interface do PAM para o System Security Services daemon (SSSD). Erros e resultados são registados através do <command>syslog(3)</command> com a habilidade LOG_AUTHPRIV.

source: OPTIONS
pt: OPÇÕES

source: Suppress log messages for unknown users.
pt: Suprime mensagens de relatório para utilizadores desconhecidos.

source: If <option>forward_pass</option> is set the entered password is put on the stack for other PAM modules to use.
pt: Se <option>forward_pass</option> for definida a palavra passe inserida é colocada na pilha para ser usada por outros módulos PAM.

source: The argument use_first_pass forces the module to use a previous stacked modules password and will never prompt the user - if no password is available or the password is not appropriate, the user will be denied access.
pt: O argumento use_first_pass força o módulo a usar uma palavra passe de módulos empilhada previamente e nunca irá pedir ao utilizador - se nenhuma palavra passe estiver disponível ou se a palavra passe não for apropriada, será negado o acesso ao utilizador.

source: When password changing enforce the module to set the new password to the one provided by a previously stacked password module.
pt: Quando o mudar de palavra passe força o módulo a definir a nova palavra passe para aquela fornecida por um módulo de palavra passe empilhada previamente.

source: If specified the user is asked another N times for a password if authentication fails. Default is 0.
pt: Se especificada é pedida ao utilizador outras N vezes por uma palavra passe se a autenticação falhar. A predefinição é 0.

source: Please note that this option might not work as expected if the application calling PAM handles the user dialog on its own. A typical example is <command>sshd</command> with <option>PasswordAuthentication</option>.
pt: Por favor note que esta opção pode não funcionar como esperado se a aplicação que chama o PAM lidar por si própria com o diálogo com o utilizador. Um exemplo típico é <command>sshd</command> com <option>PasswordAuthentication</option>.

source: If this option is specified and the user does not exist, the PAM module will return PAM_IGNORE. This causes the PAM framework to ignore this module.
pt: Se esta opção for especificada e o utilizador não existir, o módulo PAM irá retornar PAM_IGNORE. Isto faz a estrutura do PAM ignorar este módulo.

source: Specifies that the PAM module should return PAM_IGNORE if it cannot contact the SSSD daemon. This causes the PAM framework to ignore this module.
pt: Especifica que o módulo PAM deve retornar PAM_IGNORE se não puder contactar o daemon do SSSD. Isto faz a estrutura do PAM ignorar este módulo.

source: Allows the administrator to restrict the domains a particular PAM service is allowed to authenticate against. The format is a comma-separated list of SSSD domain names, as specified in the sssd.conf file.
pt: Permite ao administrador restringir os domínios a que um serviço PAM particular tem permissão de se autenticar. O formato é uma lista separada por vírgulas de nomes de domínio SSSD, como especificada no ficheiro sssd.conf.

source: NOTE: If this is used for a service not running as root user, e.g. a web-server, it must be used in conjunction with the <quote>pam_trusted_users</quote> and <quote>pam_public_domains</quote> options. Please see the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page for more information on these two PAM responder options.
pt: NOTA: Se isto for usado para um serviço que não corre como utilizador root, ex. um servidor web, tem de ser usado em conjunto com as opções <quote>pam_trusted_users</quote> e <quote>pam_public_domains</quote>. Por favor veja o manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para mais informação sobre estas duas opções do respondedor PAM.

source: The main purpose of this option is to let SSSD determine the user name based on additional information, e.g. the certificate from a Smartcard.
pt: O principal objectivo desta opção é deixar o SSSD determinar o nome de utilizador baseando-se em informação adicional, por ex, o certificado a partir de um Smartcard.

source: The current use case are login managers which can monitor a Smartcard reader for card events. In case a Smartcard is inserted the login manager will call a PAM stack which includes a line like <placeholder type="programlisting" id="0"/> In this case SSSD will try to determine the user name based on the content of the Smartcard, returns it to pam_sss which will finally put it on the PAM stack.
pt: O caso de utilização actual são gestores de login que conseguem monitorizar um leitor Smartcard para eventos de cartão. No caso de um Smartcard ser inserido o gestor de login irá chamar a pilha PAM que inclui uma linha como <placeholder type="programlisting" id="0"/> Neste caso o SSSD irá tentar determinar o nome de utilizador baseando-se no conteúdo do Smartcard, retorna-o para pam_sss o qual irá finalmente coloca-lo na pilha do PAM.

source: Always prompt the user for credentials. With this option credentials requested by other PAM modules, typically a password, will be ignored and pam_sss will prompt for credentials again. Based on the pre-auth reply by SSSD pam_sss might prompt for a password, a Smartcard PIN or other credentials.
pt: Pede sempre ao utilizador por credenciais. Com esta opção as credenciais pedidas por outros módulos PAM, tipicamente uma palavra passe, serão ignoradas e o pam_sss irá incitar as credenciais outra vez. Com base na resposta de pré-autorização dada pelo SSSD o pam_sss pode pedir uma palavra passe, um PIN de Smartcard ou outras credenciais.

source: Try to use certificate based authentication, i.e. authentication with a Smartcard or similar devices. If a Smartcard is available and the service is allowed for Smartcard authentication the user will be prompted for a PIN and the certificate based authentication will continue
pt: Tenta usar autenticação baseada em certificado, isto é, autenticação com um Smartcard ou dispositivos semelhantes. Se um Smartcard estiver disponível e o serviço for permitido para autenticação por Smartcard o utilizador será incitado por um PIN e a autenticação baseada em certificado irá continuar

source: If no Smartcard is available or certificate based authentication is not allowed for the current service PAM_AUTHINFO_UNAVAIL is returned.
pt: Se nenhum Smartcard estiver disponível ou a autenticação baseada em certificado não seja permitida para o serviço actual será retornado PAM_AUTHINFO_UNAVAIL.

source: Do certificate based authentication, i.e. authentication with a Smartcard or similar devices. If a Smartcard is not available the user will be prompted to insert one. SSSD will wait for a Smartcard until the timeout defined by p11_wait_for_card_timeout passed, please see <citerefentry><refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> for details.
pt: Faz autenticação baseada em certificado, isto é, autenticação com Smartcard ou dispositivo semelhante. Se um Smartcard não estiver disponível o utilizador será incitado a inserir um. O SSSD irá esperar pelo Smartcard até ao tempo limite definido por p11_wait_for_card_timeout, por favor veja <citerefentry><refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> para detalhes.

source: If no Smartcard is available after the timeout or certificate based authentication is not allowed for the current service PAM_AUTHINFO_UNAVAIL is returned.
pt: Se nenhum Smartcard estiver disponível após o tempo limite ou a autenticação baseada em certificado não seja permitida para o serviço actual será retornado PAM_AUTHINFO_UNAVAIL.

source: By default the chauthtok PAM action will short-circuit to returning PAM_SUCCESS when pam_sss.so is invoked by root user.
pt: Por predefinição a acção PAM chauthtok irá fazer curto-circuito para retornar PAM_SUCCESS quando pam_sss.so é invocado pelo utilizador root.

source: This option disables this behavior allowing to change auth tokens when running as root.
pt: Esta opção desativa este comportamento permitindo altera testemunhos de autenticação quando se corre como root.

source: MODULE TYPES PROVIDED
pt: TIPOS DE MÓDULOS FORNECIDOS

source: All module types (<option>account</option>, <option>auth</option>, <option>password</option> and <option>session</option>) are provided.
pt: São disponibilizados todos os tipos de módulos (<option>account</option>, <option>auth</option>, <option>password</option> e <option>session</option>).

source: If SSSD's PAM responder is not running, e.g. if the PAM responder socket is not available, pam_sss will return PAM_USER_UNKNOWN when called as <option>account</option> module to avoid issues with users from other sources during access control.
pt: Se o respondedor PAM do SSSD não estiver a correr, ex. se o socket do respondedor PAM não estiver disponível, o pam_sss irá retornar PAM_USER_UNKNOWN quando chamado como módulo <option>account</option> para evitar problemas com utilizadores de outras fontes durante o controlo de acesso.

source: RETURN VALUES
pt: VALORES DE RETORNO

source: The PAM operation finished successfully.
pt: A operação do PAM terminou com sucesso.

source: The user is not known to the authentication service or the SSSD's PAM responder is not running.
pt: O utilizador não é conhecido pelo serviço de autenticação ou o respondedor PAM do SSSD não esta a correr.

source: Authentication failure. Also, could be returned when there is a problem with getting the certificate.
pt: Falha de autenticação. Também pode ser retornado quando existir um problema com a obtenção do certificado.

source: Permission denied. The SSSD log files may contain additional information about the error.
pt: Permissão negada. Os ficheiros de relatório do SSSD podem conter informação adicional acerca do erro.

source: See options <option>ignore_unknown_user</option> and <option>ignore_authinfo_unavail</option>.
pt: Veja as opções <option>ignore_unknown_user</option> e <option>ignore_authinfo_unavail</option>.

source: Unable to obtain the new authentication token. Also, could be returned when the user authenticates with certificates and multiple certificates are available, but the installed version of GDM does not support selection from multiple certificates.
pt: Incapaz de obter o novo testemunho de autenticação. Também pode ser retornado quando o utilizador se autenticar com certificados e estiverem disponíveis múltiplos certificados, mas a versão instalada do GDM não suporta a selecção de múltiplos certificados.

source: Unable to access the authentication information. This might be due to a network or hardware failure.
pt: Incapaz de aceder à informação de autenticação. Isto pode ser devido a uma falha de rede ou de hardware.

source: A memory error occurred. Also, could be returned when options use_first_pass or use_authtok were set, but no password was found from the previously stacked PAM module.
pt: Ocorreu um erro de memória. Também pode ser retornado quando as opções use_first_pass ou use_authtok foram definidas, mas nenhuma palavra passe foi encontrada a partir do módulo PAM previamente empilhado.

source: A system error occurred. The SSSD log files may contain additional information about the error.
pt: Ocorreu um erro do sistema. Os ficheiros log do SSSD podem conter informação adicional acerca do erro.

source: Unable to set the credentials of the user.
pt: Incapaz de definir as credenciais do utilizador.

source: The application does not have sufficient credentials to authenticate the user. For example, missing PIN during smartcard authentication or missing factor during two-factor authentication.
pt: A aplicação não tem credenciais suficientes para autenticar o utilizador. Por exemplo, PIN em falta durante autenticação por smartcard ou factor em falta durante autenticação de dois-factores.

source: Error in service module.
pt: Erro em módulo de serviço.

source: The user's authentication token has expired.
pt: O testemunho de autenticação do utilizador expirou.
