Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: Specifies the timeout (in seconds) that ldap searches are allowed to run before they are cancelled and cached results are returned (and offline mode is entered)
pt: Especifica o tempo limite (em segundos) em que as buscas ldap têm permissão de correr antes de serem canceladas e os resultados em cache serem retornados (e entra-se no modo offline)

source: Note: this option is subject to change in future versions of the SSSD. It will likely be replaced at some point by a series of timeouts for specific lookup types.
pt: Nota: esta opção está sujeita a mudança em futuras versões do SSSD. Provavelmente será substituída em determinada altura por uma série de tempos limites para tipos de procura específicos.

source: ldap_enumeration_search_timeout (integer)
pt: ldap_enumeration_search_timeout (inteiro)

source: Specifies the timeout (in seconds) that ldap searches for user and group enumerations are allowed to run before they are cancelled and cached results are returned (and offline mode is entered)
pt: Especifica o tempo limite (em segundos) em que as buscas ldap por enumerações de utilizador e grupo têm permissão de correr antes de serem canceladas e os resultados em cache serem retornados (e entra-se no modo offline)

source: ldap_network_timeout (integer)
pt: ldap_network_timeout (inteiro)

source: Specifies the timeout (in seconds) after which the <citerefentry> <refentrytitle>poll</refentrytitle> <manvolnum>2</manvolnum> </citerefentry>/<citerefentry> <refentrytitle>select</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> following a <citerefentry> <refentrytitle>connect</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> returns in case of no activity.
pt: Especifica o tempo limite (em segundos) após o qual o <citerefentry> <refentrytitle>poll</refentrytitle> <manvolnum>2</manvolnum> </citerefentry>/<citerefentry> <refentrytitle>select</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> seguindo de um <citerefentry> <refentrytitle>connect</refentrytitle> <manvolnum>2</manvolnum> </citerefentry> retorna em caso de nenhuma atividade.

source: ldap_opt_timeout (integer)
pt: ldap_opt_timeout (inteiro)

source: Specifies a timeout (in seconds) after which calls to synchronous LDAP APIs will abort if no response is received. Also controls the timeout when communicating with the KDC in case of SASL bind, the timeout of an LDAP bind operation, password change extended operation and the StartTLS operation.
pt: Especifica um tempo limite (em segundos) após o qual as chamadas para APIs LDAP síncronos irão abortar se nenhuma resposta for recebida. Também controla o tempo limite quando se comunica com o KDC no caso de união SASL, o tempo limite duma operação de união LDAP, operação extensiva de mudança de palavra passe e a operação StartTLS.

source: ldap_connection_expire_timeout (integer)
pt: ldap_connection_expire_timeout (inteiro)

source: Specifies a timeout (in seconds) that a connection to an LDAP server will be maintained. After this time, the connection will be re-established. If used in parallel with SASL/GSSAPI, the sooner of the two values (this value vs. the TGT lifetime) will be used.
pt: Especifica um tempo limite (em segundos) que a ligação a um servidor LDAP será mantida. Após este tempo, a ligação será re-estabelecida. Se usado em paralelo com SASL/GSSAPI, será usado o primeiro dos dois valores (este valor contra o tempo de vida TGT).

source: If the connection is idle (not actively running an operation) within <emphasis>ldap_opt_timeout</emphasis> seconds of expiration, then it will be closed early to ensure that a new query cannot require the connection to remain open past its expiration. This implies that connections will always be closed immediately and will never be reused if <emphasis>ldap_connection_expire_timeout &lt;= ldap_opt_timout</emphasis>
pt: Se a ligação estiver em espera (não ativamente a correr uma operação) dentro de <emphasis>ldap_opt_timeout</emphasis> segundos de expirar, então será fechada mais cedo para assegurar que uma nova consulta não possa requerer que a ligação permaneça aberta após a sua validade. Isto implica que as ligações serão sempre fechadas imediatamente e nunca serão reutilizadas se <emphasis>ldap_connection_expire_timeout &lt;= ldap_opt_timout</emphasis>

source: This timeout can be extended of a random value specified by <emphasis>ldap_connection_expire_offset</emphasis>
pt: Este tempo limite pode ser estendido a um valor aleatório especificado por <emphasis>ldap_connection_expire_offset</emphasis>

source: Default: 900 (15 minutes)
pt: Predefinição: 900 (15 minutos)

source: ldap_connection_expire_offset (integer)
pt: ldap_connection_expire_offset (inteiro)

source: Random offset between 0 and configured value is added to <emphasis>ldap_connection_expire_timeout</emphasis>.
pt: Desvio aleatório entre 0 e valor configurado é adicionado a <emphasis>ldap_connection_expire_timeout</emphasis>.

source: ldap_connection_idle_timeout (integer)
pt: ldap_connection_idle_timeout (inteiro)

source: Specifies a timeout (in seconds) that an idle connection to an LDAP server will be maintained. If the connection is idle for more than this time then the connection will be closed.
pt: Especifica um tempo limite (em segundos) que uma ligação em pausa para um servidor LDAP será mantida. Se a ligação estiver em pausa por mais do que este tempo então a ligação será fechada.

source: You can disable this timeout by setting the value to 0.
pt: Você pode desativar este tempo limite ao definir o valor para 0.

source: ldap_page_size (integer)
pt: ldap_page_size (inteiro)

source: Specify the number of records to retrieve from LDAP in a single request. Some LDAP servers enforce a maximum limit per-request.
pt: Especifica o número de registos a obter de LDAP num único pedido. Alguns servidores LDAP forçam um limite máximo por-pedido.

source: ldap_disable_paging (boolean)
pt: ldap_disable_paging (booleano)

source: Disable the LDAP paging control. This option should be used if the LDAP server reports that it supports the LDAP paging control in its RootDSE but it is not enabled or does not behave properly.
pt: Desactiva o controle de paginamento do LDAP. Esta opção deve ser usada se o servidor LDAP reportar que suporta o controle de paginamento LDAP no seu RootDSE não está activo ou não se comporta de modo apropriado.

source: Example: OpenLDAP servers with the paging control module installed on the server but not enabled will report it in the RootDSE but be unable to use it.
pt: Exemplo: Servidores OpenLDAP com o módulo de controle de paginamento instalado no servidor mas não activado irão reporta-lo no RootDSE mas serão incapazes de o usar.

source: Example: 389 DS has a bug where it can only support a one paging control at a time on a single connection. On busy clients, this can result in some requests being denied.
pt: Exemplo: 389 DS tem um bug onde consegue apenas suportar um controle de uma página de cada vez numa única ligação. Em clientes ocupados, isto pode resultar em alguns pedidos a serem negados.

source: ldap_disable_range_retrieval (boolean)
pt: ldap_disable_range_retrieval (booleano)

source: Disable Active Directory range retrieval.
pt: Desactiva a obtenção de alcance Active Directory.

source: Active Directory limits the number of members that can be retrieved in a single lookup using the MaxValRange policy, which defaults to 1500 members. If a group contains more than 1500 members, the reply includes an AD-specific range extension. When enabled, this option prevents SSSD from parsing the range extension. As a result large groups will appear as they have no members. This option does not enable SSSD to read subsequent ranges. To retrieve all members of a group, you must increase the MaxValRange setting in Active Directory.
pt: Active Directory limita o número de membros que podem ser obtidos numa única pesquisa usando a política MaxValRange, que vem predefinida para 1500 membros. Se um grupo conter mais de 1500 membros, a resposta inclui uma extensão de alcance específica de AD, Quando ativa, esta opção previne o SSSD de analisar a extensão do alcance. Como resultado os grupos grandes irão aparecer como se não tivessem membros. Esta opção não ativa o SSSD a ler alcances subsequentes. Para obter todos os membros de um grupo, você tem de aumentar a definição MaxValRange no Active Directory.

source: ldap_sasl_minssf (integer)
pt: ldap_sasl_minssf (inteiro)

source: When communicating with an LDAP server using SASL, specify the minimum security level necessary to establish the connection. The values of this option are defined by OpenLDAP.
pt: Quando se comunica com um servidor LDAP usando SASL, especifica o nível de segurança mínimo necessário para estabelecer a ligação. Os valores desta opção são definidos pelo OpenLDAP.

source: Default: Use the system default (usually specified by ldap.conf)
pt: Predefinição: Usa a predefinição do sistema (geralmente especificada por ldap.conf)

source: ldap_sasl_maxssf (integer)
pt: ldap_sasl_maxssf (inteiro)

source: When communicating with an LDAP server using SASL, specify the maximal security level necessary to establish the connection. The values of this option are defined by OpenLDAP.
pt: Quando se comunica com um servidor LDAP usando SASL, especifica o nível de segurança máximo necessário para estabelecer a ligação. Os valores desta opção são definidos pelo OpenLDAP.

source: ldap_deref_threshold (integer)
pt: ldap_deref_threshold (inteiro)

source: Specify the number of group members that must be missing from the internal cache in order to trigger a dereference lookup. If less members are missing, they are looked up individually.
pt: Especifica o número de membros de grupo que têm de estar em falta na cache interna de modo a despoletar um procura de de-referência. Se existem menos membros em falta, estes são procurados individualmente.

source: You can turn off dereference lookups completely by setting the value to 0. Please note that there are some codepaths in SSSD, like the IPA HBAC provider, that are only implemented using the dereference call, so even with dereference explicitly disabled, those parts will still use dereference if the server supports it and advertises the dereference control in the rootDSE object.
pt: Você pode desligar completamente as procuras de-referência ao definir o valor para 0. Por favor note que existem alguns codepaths no SSSD, como o provedor IPA HBAC, que são apenas implementados usando a chamada de de-referência, assim mesmo com a de-referência explicitamente desactivada, essas partes ainda irão usar a de-referência se o servidor a suportar e publicitar o controle de de-referência no objecto rootDSE.

source: A dereference lookup is a means of fetching all group members in a single LDAP call. Different LDAP servers may implement different dereference methods. The currently supported servers are 389/RHDS, OpenLDAP and Active Directory.
pt: Uma procura de-referência é um meio de obter todos os membros dum grupo numa única chamada LDAP. Servidores LDAP diferentes podem implementar diferentes métodos de de-referência. Os servidores actualmente suportados são 389/RHDS, OpenLDAP e Active Directory.

source: <emphasis>Note:</emphasis> If any of the search bases specifies a search filter, then the dereference lookup performance enhancement will be disabled regardless of this setting.
pt: <emphasis>Nota:</emphasis> Se qualquer uma das bases de busca especificar um filtro de busca, então a melhoria de performance da procura de de-referência será desactivada independentemente desta definição.

source: ldap_ignore_unreadable_references (bool)
pt: ldap_ignore_unreadable_references (booleano)

source: Ignore unreadable LDAP entries referenced in group's member attribute. If this parameter is set to false an error will be returned and the operation will fail instead of just ignoring the unreadable entry.
pt: Ignora entradas LDAP ilegíveis referenciadas em atributo de membros de grupo. Se este parâmetro for definido para false será retornado um erro e a operação irá falhar em vez de apenas ignorar a entrada ilegível.

source: This parameter may be useful when using the AD provider and the computer account that sssd uses to connect to AD does not have access to a particular entry or LDAP sub-tree for security reasons.
pt: Este parâmetro pode ser útil quando se usa o provedor AD e a conta de computador que o sssd usa para ligar ao AD não tem acesso a uma entrada particular ou a sub-árvore do LDAP para razões de segurança.

source: Specifies what checks to perform on server certificates in a TLS session, if any. It can be specified as one of the following values:
pt: Especifica que verificações a executar em certificados de servidor numa sessão TLS, se existirem. Pode ser especificado como um dos seguintes valores:

source: <emphasis>never</emphasis> = The client will not request or check any server certificate.
pt: <emphasis>never</emphasis> = O cliente não irá solicitar ou verificar qualquer certificado de servidor.

source: <emphasis>allow</emphasis> = The server certificate is requested. If no certificate is provided, the session proceeds normally. If a bad certificate is provided, it will be ignored and the session proceeds normally.
pt: <emphasis>allow</emphasis> = O certificado do servidor é requisitado. Se nenhum certificado for fornecido, a sessão prossegue normalmente. Se for fornecido um certificado mau, será ignorado e a sessão prossegue normalmente.

source: <emphasis>try</emphasis> = The server certificate is requested. If no certificate is provided, the session proceeds normally. If a bad certificate is provided, the session is immediately terminated.
pt: <emphasis>try</emphasis> = É requisitado o certificado do servidor. Se nenhum certificado for fornecido, a sessão prossegue normalmente. Se for fornecido um certificado mau, a sessão é terminada imediatamente.

source: <emphasis>demand</emphasis> = The server certificate is requested. If no certificate is provided, or a bad certificate is provided, the session is immediately terminated.
pt: <emphasis>demand</emphasis> = É requisitado o certificado do servidor. Se não for fornecido um certificado, ou se for fornecido um certificado mau, a sessão é terminada imediatamente.

source: <emphasis>hard</emphasis> = Same as <quote>demand</quote>
pt: <emphasis>hard</emphasis> = O mesmo que <quote>demand</quote>

source: Default: hard
pt: Predefinição: hard

source: Specifies the file that contains certificates for all of the Certificate Authorities that <command>sssd</command> will recognize.
pt: Especifica o ficheiro que contém certificados para todos de Certificate Authorities que o <command>sssd</command> irá reconhecer.

source: Default: use OpenLDAP defaults, typically in <filename>/etc/openldap/ldap.conf</filename>
pt: Predefinição: usa predefinições do OpenLDAP, tipicamente em <filename>/etc/openldap/ldap.conf</filename>

source: Specifies the path of a directory that contains Certificate Authority certificates in separate individual files. Typically the file names need to be the hash of the certificate followed by '.0'. If available, <command>openssl rehash</command> or <command>c_rehash</command> can be used to create the correct names.
pt: Especifica o caminho de um directório que contém certificados Certificate Authority em ficheiros separados individuais. Tipicamente os nomes dos ficheiros precisam de ser a cinza do certificado seguido por '.0'. Se disponível, pode ser usado <command>openssl rehash</command> ou <command>c_rehash</command> para criar os nomes corretos.

source: Specifies the file that contains the certificate for the client's key.
pt: Especifica o ficheiro que contém o certificado para a chave do cliente.

source: Specifies the file that contains the client's key.
pt: Especifica o ficheiro que contém a chave do cliente.

source: Specifies acceptable cipher suites. Typically this is a colon separated list. See <citerefentry><refentrytitle>ldap.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> for format.
pt: Especifica as suites de cifra aceitáveis. Tipicamente isto é uma lista separada por dois pontos. Veja <citerefentry><refentrytitle>ldap.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> para o formato.

source: ldap_id_use_start_tls (boolean)
pt: ldap_id_use_start_tls (booleano)

source: Specifies that the id_provider connection must also use <systemitem class="protocol">tls</systemitem> to protect the channel. <emphasis>true</emphasis> is strongly recommended for security reasons.
pt: Especifica que a ligação id_provider tem também de usar <systemitem class="protocol">tls</systemitem> para proteger o canal. <emphasis>true</emphasis> é fortemente recomendado por razões de segurança.

source: ldap_id_mapping (boolean)
pt: ldap_id_mapping (booleano)

source: Specifies that SSSD should attempt to map user and group IDs from the ldap_user_objectsid and ldap_group_objectsid attributes instead of relying on ldap_user_uid_number and ldap_group_gid_number.
pt: Especifica que o SSSD deve tentar mapear os IDs de utilizador e grupo a partir dos atributos ldap_user_objectsid e ldap_group_objectsid em vez de confiar em ldap_user_uid_number e ldap_group_gid_number.

source: Currently this feature supports only ActiveDirectory objectSID mapping.
pt: Actualmente esta funcionalidade apenas suporta mapeamento objectSID de ActiveDirectory.

source: ldap_min_id, ldap_max_id (integer)
pt: ldap_min_id, ldap_max_id (inteiro)

source: In contrast to the SID based ID mapping which is used if ldap_id_mapping is set to true the allowed ID range for ldap_user_uid_number and ldap_group_gid_number is unbound. In a setup with sub/trusted-domains this might lead to ID collisions. To avoid collisions ldap_min_id and ldap_max_id can be set to restrict the allowed range for the IDs which are read directly from the server. Sub-domains can then pick other ranges to map IDs.
pt: Em contraste ao mapeamento de ID baseado em SID o qual é usado se ldap_id_mapping estiver definido para true, o alcance de ID permitido para ldap_user_uid_number e ldap_group_gid_number não está vinculado. Numa configuração com subdomínios de confiança isto pode levar a colisões de ID. Para evitar colisões, ldap_min_id e ldap_max_id podem ser definidos para restringir o alcance permitido para os IDs os quais são lidos diretamente do servidor. Os subdomínios podem então escolher outros alcances para mapear os IDs.

source: Default: not set (both options are set to 0)
pt: Predefinição: não definida (ambas opções são definidas para 0)

source: Specify the SASL mechanism to use. Currently only GSSAPI and GSS-SPNEGO are tested and supported.
pt: Especifica o mecanismo SASL a usar. Presentemente apenas GSSAPI e GSS-SPNEGO estão testados e são suportados.

source: If the backend supports sub-domains the value of ldap_sasl_mech is automatically inherited to the sub-domains. If a different value is needed for a sub-domain it can be overwritten by setting ldap_sasl_mech for this sub-domain explicitly. Please see TRUSTED DOMAIN SECTION in <citerefentry><refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> for details.
pt: Se o backend suportar sub-domínios o valor de ldap_sasl_mech é herdado automaticamente aos sub-domínios. Se for necessário um valor diferentes para um sub-domínio pode ser sobreposto ao definir ldap_sasl_mech para esse sub-domínio explicitamente. Por favor veja a SECÇÃO DOMÍNIO DE CONFIANÇA em <citerefentry><refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum></citerefentry> para detalhes.

source: Specify the SASL authorization id to use. When GSSAPI/GSS-SPNEGO are used, this represents the Kerberos principal used for authentication to the directory. This option can either contain the full principal (for example host/myhost@EXAMPLE.COM) or just the principal name (for example host/myhost). By default, the value is not set and the following principals are used: <placeholder type="programlisting" id="0"/> If none of them are found, the first principal in keytab is returned.
pt: Especifica o id de autorização SASL a usar. Quando é usado GSSAPI/GSS-SPNEGO isto representa o principal Kerberos usado para autenticação para o directório. Esta opção pode ou conter o principal completo (por exemplo host/myhost@EXAMPLE.COM) ou apenas o nome principal (por exemplo host/myhost). Por predefinição, este valor não está definido e são usados os principais seguintes: <placeholder type="programlisting" id="0"/> Se nenhum deles for encontrado, é retornado o primeiro principal em keytab.

source: Default: host/hostname@REALM
pt: Predefinição: host/hostname@REALM

source: Specify the SASL realm to use. When not specified, this option defaults to the value of krb5_realm. If the ldap_sasl_authid contains the realm as well, this option is ignored.
pt: Especifica o reino SASL a usar. Quando não especificado, esta opção vem predefinida para o valor de krb5_realm. Se ldap_sasl_authid conter também o reino, esta opção é ignorada.

source: Default: the value of krb5_realm.
pt: Predefinição: o valor de krb5_realm.

source: ldap_sasl_canonicalize (boolean)
pt: ldap_sasl_canonicalize (booleano)

source: If set to true, the LDAP library would perform a reverse lookup to canonicalize the host name during a SASL bind.
pt: Se definido para true, a biblioteca do LDAP irá executar uma procura reversa para canonizar o nome de máquina durante uma união SASL.

source: Default: false;
pt: Predefinição: false;

source: Specify the keytab to use when using SASL/GSSAPI/GSS-SPNEGO.
pt: Especifica a keytab a usar quando se usa SASL/GSSAPI/GSS-SPNEGO.

source: Default: System keytab, normally <filename>/etc/krb5.keytab</filename>
pt: Predefinição: Sistema keytab, normalmente <filename>/etc/krb5.keytab</filename>

source: ldap_krb5_init_creds (boolean)
pt: ldap_krb5_init_creds (booleano)

source: Specifies that the id_provider should init Kerberos credentials (TGT). This action is performed only if SASL is used and the mechanism selected is GSSAPI or GSS-SPNEGO.
pt: Especifica que o provedor de id deve iniciar credenciais Kerberos (TGT). Esta acção é apenas executada se SASL for usado e o mecanismo selecionado for GSSAPI ou GSS-SPNEGO.

source: ldap_krb5_ticket_lifetime (integer)
pt: ldap_krb5_ticket_lifetime (inteiro)

source: Specifies the lifetime in seconds of the TGT if GSSAPI or GSS-SPNEGO is used.
pt: Especifica o tempo de vida em segundos de TGT se for usado GSSAPI ou GSS-SPNEGO.

source: Default: 86400 (24 hours)
pt: Predefinição: 86400 (24 horas)

source: Specifies the comma-separated list of IP addresses or hostnames of the Kerberos servers to which SSSD should connect in the order of preference. For more information on failover and server redundancy, see the <quote>FAILOVER</quote> section. An optional port number (preceded by a colon) may be appended to the addresses or hostnames. If empty, service discovery is enabled - for more information, refer to the <quote>SERVICE DISCOVERY</quote> section.
pt: Especifica a lista separada por vírgulas de endereços IP ou nomes de máquinas dos servidores Kerberos aos quais o SSSD deve ligar pela ordem de preferência. Para mais informação sobre failover e redundância de servidores, veja a secção <quote>FAILOVER</quote>. Um número de porto opcional (com dois pontos a preceder) pode ser acrescentado aos endereços ou nomes de máquinas. Se vazia, é activada a descoberta de serviços - para mais informação, consulte a secção <quote>DESCOBERTA DE SERVIÇOS</quote>.
