Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: SSSD Manual pages
pt: Manual do SSSD

source: File Formats and Conventions
pt: Formatos de Ficheiros e Convenções

source: the configuration file for SSSD
pt: o ficheiro de configuração para SSSD

source: FILE FORMAT
pt: FORMATO DO FICHEIRO

source: <replaceable>[section]</replaceable> <replaceable>key</replaceable> = <replaceable>value</replaceable> <replaceable>key2</replaceable> = <replaceable>value2,value3</replaceable>
pt: <replaceable>[secção]</replaceable> <replaceable>chave</replaceable> = <replaceable>valor</replaceable> <replaceable>chave2</replaceable> = <replaceable>valor2,valor3</replaceable>

source: The file has an ini-style syntax and consists of sections and parameters. A section begins with the name of the section in square brackets and continues until the next section begins. An example of section with single and multi-valued parameters: <placeholder type="programlisting" id="0"/>
pt: O ficheiro tem uma sintaxe estilo-ini e consiste de secções e parâmetros. Uma secção começa com o nome da secção em parênteses rectos e continua até que a próxima secção comece. Um exemplo de secção com parâmetros singulares e de multi-valores: <placeholder type="programlisting" id="0"/>

source: The data types used are string (no quotes needed), integer and bool (with values of <quote>TRUE/FALSE</quote>).
pt: Os tipos de dados usados são cadeia de caracteres (sem aspas necessárias), inteiro e booleano (com valores de <quote>TRUE/FALSE</quote>).

source: A comment line starts with a hash sign (<quote>#</quote>) or a semicolon (<quote>;</quote>). Inline comments are not supported.
pt: Uma linha de comentário começa com o cardinal (<quote>#</quote>) ou com um ponto-e-vírgula (<quote>;</quote>). Não são suportados comentários em linhas.

source: All sections can have an optional <replaceable>description</replaceable> parameter. Its function is only as a label for the section.
pt: Todas as secções podem ter um parâmetro opcional <replaceable>descrição</replaceable>. A sua função é apenas ser uma etiqueta para a secção.

source: <filename>sssd.conf</filename> must be a regular file that is owned, readable, and writeable only by 'root'.
pt: <filename>sssd.conf</filename> deve ser um ficheiro regular em que o 'root' é dono, e só ele pode ler e escrever.

source: <filename>sssd.conf</filename> must be a regular file that is accessible only by the user used to run SSSD service or root.
pt: <filename>sssd.conf</filename> deve ser um ficheiro regular que é acessível apenas pelo utilizador usado para correr o serviço SSSD ou o root.

source: CONFIGURATION SNIPPETS FROM INCLUDE DIRECTORY
pt: TRECHOS DE CONFIGURAÇÃO DO DIRETÓRIO INCLUDE

source: The configuration file <filename>sssd.conf</filename> will include configuration snippets using the include directory <filename>conf.d</filename>.
pt: O ficheiro de configuração <filename>sssd.conf</filename> irá incluir trechos de configuração usando o directório de inclusão <filename>conf.d</filename>.

source: Any file placed in <filename>conf.d</filename> that ends in <quote><filename>.conf</filename></quote> and does not begin with a dot (<quote>.</quote>) will be used together with <filename>sssd.conf</filename> to configure SSSD.
pt: Qualquer ficheiro colocado em <filename>conf.d</filename> que termine em <quote><filename>.conf</filename></quote> e não comece com um ponto (<quote>.</quote>) será usado juntamente com <filename>sssd.conf</filename> para configurar o SSSD.

source: The configuration snippets from <filename>conf.d</filename> have higher priority than <filename>sssd.conf</filename> and will override <filename>sssd.conf</filename> when conflicts occur. If several snippets are present in <filename>conf.d</filename>, then they are included in alphabetical order (based on locale). Files included later have higher priority. Numerical prefixes (<filename>01_snippet.conf</filename>, <filename>02_snippet.conf</filename> etc.) can help visualize the priority (higher number means higher priority).
pt: Os trechos de configuração de <filename>conf.d</filename> têm prioridade mais alta que <filename>sssd.conf</filename> e irão sobrepor o <filename>sssd.conf</filename> quando ocorrerem conflitos. Se vários trechos estiverem presentes em <filename>conf.d</filename>, então eles são incluídos por ordem alfabética (baseada no locale). Os ficheiros incluídos mais tarde têm prioridade mais alta. Prefixos numéricos (<filename>01_snippet.conf</filename>, <filename>02_snippet.conf</filename> etc.) podem ajudar a visualizar a prioridade (número mais alto significa prioridade mais alta).

source: The snippet files require the same owner and permissions as <filename>sssd.conf</filename>.
pt: Os ficheiros de trechos requerem o mesmo dono e permissões que o <filename>sssd.conf</filename>.

source: GENERAL OPTIONS
pt: OPÇÕES GERAIS

source: Following options are usable in more than one configuration sections.
pt: As seguinte opções são utilizáveis em mais do que uma secção de configuração.

source: Options usable in all sections
pt: Opções utilizáveis em todas as secções

source: debug_level (integer)
pt: debug_level (inteiro)

source: debug (integer)
pt: debug (inteiro)

source: SSSD 1.14 and later also includes the <replaceable>debug</replaceable> alias for <replaceable>debug_level</replaceable> as a convenience feature. If both are specified, the value of <replaceable>debug_level</replaceable> will be used.
pt: SSSD 1.14 e posterior também inclui o alias <replaceable>debug</replaceable> para <replaceable>debug_level</replaceable> como uma funcionalidade de conveniência. Se ambos forem especificados, será usado o valor de <replaceable>debug_level</replaceable>.

source: debug_timestamps (bool)
pt: debug_timestamps (booleano)

source: Add a timestamp to the debug messages. If journald is enabled for SSSD debug logging this option is ignored.
pt: Adiciona uma marca temporal às mensagens de depuração. Se journald estiver ativo para registos de depuração do SSSD esta opção é ignorada.

source: Default: true
pt: Predefinição: true

source: debug_microseconds (bool)
pt: debug_microseconds (booleano)

source: Add microseconds to the timestamp in debug messages. If journald is enabled for SSSD debug logging this option is ignored.
pt: Adiciona micro-segundos à marca temporal nas mensagens de depuração. Se journald estiver activo para registos de depuração do SSSD esta opção é ignorada.

source: Default: false
pt: Predefinição: false

source: debug_backtrace_enabled (bool)
pt: debug_microseconds (booleano)

source: Enable debug backtrace.
pt: Activa o seguimento de depuração.

source: In case SSSD is run with debug_level less than 9, everything is logged to a ring buffer in memory and flushed to a log file on any error up to and including `min(0x0040, debug_level)` (i.e. if debug_level is explicitly set to 0 or 1 then only those error levels will trigger backtrace, otherwise up to 2).
pt: No caso do SSSD correr com debug_level menor que 9, tudo é registado para um anel buffer na memória e despejado para um ficheiro log em qualquer erro até e incluindo `min(0x0040, debug_level)` (isto é, se debug_level for explicitamente definido para 0 ou 1 então apenas esses níveis de erro irão despoletar os registos, caso contrário até ao 2).

source: Feature is only supported for `logger == files` (i.e. setting doesn't have effect for other logger types).
pt: Funcionalidade é apenas suportada para `logger == files` (isto é, a definição não tem efeito para outros tipos de relatório).

source: Options usable in SERVICE and DOMAIN sections
pt: Opções utilizáveis nas secções SERVICE e DOMAIN

source: timeout (integer)
pt: tempo limite (inteiro)

source: Timeout in seconds between heartbeats for this service. This is used to ensure that the process is alive and capable of answering requests. Note that after three missed heartbeats the process will terminate itself.
pt: Tempo limite em segundos entre batimentos do serviço. Isto é usado para assegurar que o processo está vivo e capaz de responder a pedidos. Note que após três batimentos em falta o processo irá terminar por ele próprio.

source: Default: 10
pt: Predefinido: 10

source: SPECIAL SECTIONS
pt: SECÇÕES ESPECIAIS

source: The [sssd] section
pt: A secção [sssd]

source: Section parameters
pt: Parâmetros de secção

source: services
pt: serviços

source: Comma separated list of services that are started when sssd itself starts. <phrase condition="have_systemd"> The services' list is optional on platforms where systemd is supported, as they will either be socket or D-Bus activated when needed. </phrase>
pt: Lista de serviços separados por vírgulas que são iniciados quando o próprio sssd arranca. <phrase condition="have_systemd"> A lista de serviços é opcional em plataformas onde o systemd é suportado, pois eles irão ser ativados via socket ou D-Bus quando necessário. </phrase>

source: Supported services: nss, pam, ifp <phrase condition="with_sudo">, sudo</phrase> <phrase condition="with_autofs">, autofs</phrase> <phrase condition="with_ssh">, ssh</phrase> <phrase condition="with_pac_responder">, pac</phrase>
pt: Serviços suportados: nss, pam ifp <phrase condition="with_sudo">, sudo</phrase> <phrase condition="with_autofs">, autofs</phrase> <phrase condition="with_ssh">, ssh</phrase> <phrase condition="with_pac_responder">, pac</phrase>

source: <phrase condition="have_systemd"> By default, all services are disabled and the administrator must enable the ones allowed to be used by executing: "systemctl enable sssd-@service@.socket". </phrase>
pt: <phrase condition="have_systemd"> Por predefinição, todos os serviços são desativados e o administrador tem de activar os que permite serem usados ao executar: "systemctl enable sssd-@service@.socket". </phrase>

source: domains
pt: domínios

source: A domain is a database containing user information. SSSD can use more domains at the same time, but at least one must be configured or SSSD won't start. This parameter describes the list of domains in the order you want them to be queried. A domain name is recommended to contain only alphanumeric ASCII characters, dashes, dots and underscores. '/' character is forbidden.
pt: Um domínio é uma base de dados que contém informação de utilizador. O SSSD pode usar mais domínios ao mesmo tempo, mas pelo menos um tem de ser configurado ou o SSSD não arranca. Este parâmetro descreve a lista de domínios pela ordem que você deseja que eles sejam questionados. Um nome de domínio é recomendado conter apenas caracteres ASCII alfanuméricos, traços, pontos e underscores. O caractere '/' é proibido.

source: Default regular expression that describes how to parse the string containing user name and domain into these components.
pt: Expressão regular predefinida que descreve como converter a string que contém o nome de utilizador e domínio nestes componentes.

source: Each domain can have an individual regular expression configured. For some ID providers there are also default regular expressions. See DOMAIN SECTIONS for more info on these regular expressions.
pt: Cada domínio pode ter uma expressão regular individual configurada. Para alguns provedores de ID há também expressões regulares predefinidas. Veja SECÇÕES DE DOMÍNIO para mais informação sobre essas expressões regulares.

source: A <citerefentry> <refentrytitle>printf</refentrytitle> <manvolnum>3</manvolnum> </citerefentry>-compatible format that describes how to compose a fully qualified name from user name and domain name components.
pt: Um formato <citerefentry> <refentrytitle>printf</refentrytitle> <manvolnum>3</manvolnum> </citerefentry>-compatível que descreve como compor um nome totalmente qualificado a partir dos componentes nome de utilizador e nome de domínio.

source: user name
pt: nome de utilizador

source: domain name as specified in the SSSD config file.
pt: nome de domínio como especificado no ficheiro de configuração do SSSD.

source: domain flat name. Mostly usable for Active Directory domains, both directly configured or discovered via IPA trusts.
pt: nome de domínio liso. Muito usado para domínios Active Directory, ambos diretamente configurados ou descobertos via confianças de IPA.

source: The following expansions are supported: <placeholder type="variablelist" id="0"/>
pt: São suportadas as seguintes expansões: <placeholder type="variablelist" id="0"/>

source: Each domain can have an individual format string configured. See DOMAIN SECTIONS for more info on this option.
pt: Cada domínio pode ter um formato individual de string configurado. Veja SECÇÕES DE DOMÍNIO para mais informação desta opção.

source: monitor_resolv_conf (boolean)
pt: monitor_resolv_conf (booleano)

source: Controls if SSSD should monitor the state of resolv.conf to identify when it needs to update its internal DNS resolver.
pt: Controla se o SSSD deve monitorizar o estado de resolv.conf para identificar quando precisa de atualizar o seu resolver de DNS interno.

source: try_inotify (boolean)
pt: try_inotify (booleano)

source: By default, SSSD will attempt to use inotify to monitor configuration files changes and will fall back to polling every five seconds if inotify cannot be used.
pt: Por predefinição, o SSSD irá tentar usar inotify para monitorizar alterações nos ficheiros de configuração e irá apoiar-se no polling a cada 5 segundos se o inotify não puder ser usado.

source: There are some limited situations where it is preferred that we should skip even trying to use inotify. In these rare cases, this option should be set to 'false'
pt: Existem algumas situações limitadas onde é preferível devermos até tentar mesmo não usar o inotify. Nestes raros casos, esta opção deve ser definida para 'false'

source: Default: true on platforms where inotify is supported. False on other platforms.
pt: Predefinição: true em plataformas onde inotify é suportado. False nas outras plataformas.

source: Note: this option will have no effect on platforms where inotify is unavailable. On these platforms, polling will always be used.
pt: Nota: esta opção não terá efeito em plataformas onde inotify não está disponível. Nestas plataformas será sempre usado polling.

source: Directory on the filesystem where SSSD should store Kerberos replay cache files.
pt: Directório no sistema de ficheiros onde o SSSD deve armazenar os ficheiros de cache de repetição do Kerberos.

source: This option accepts a special value __LIBKRB5_DEFAULTS__ that will instruct SSSD to let libkrb5 decide the appropriate location for the replay cache.
pt: Esta opção aceita um valor especial __LIBKRB5_DEFAULTS__ que irá instruir o SSSD a deixar libkrb5 decidir a localização apropriada para a cache de repetição.

source: Default: Distribution-specific and specified at build-time. (__LIBKRB5_DEFAULTS__ if not configured)
pt: Predefinição: Específica da distribuição e especificada durante a compilação. (__LIBKRB5_DEFAULTS__ se não configurada)

source: Please note that this option is deprecated and domain_resolution_order should be used.
pt: Por favor note que esta opção está descontinuada e deve ser usada domain_resolution_order.

source: This string will be used as a default domain name for all names without a domain name component. The main use case is environments where the primary domain is intended for managing host policies and all users are located in a trusted domain. The option allows those users to log in just with their user name without giving a domain name as well.
pt: Esta string irá ser usada como o nome de domínio predefinido para todos os nomes sem um componente de nome de domínio. O principal caso de utilização é ambientes onde o domínio principal destina-se a gestão de políticas de máquinas e todos os utilizadores estão localizados num domínio de confiança. Esta opção permite a esses utilizadores fazerem login apenas com os seus nomes de utilizador sem terem de também fornecer um nome de domínio.

source: Please note that if this option is set all users from the primary domain have to use their fully qualified name, e.g. user@domain.name, to log in. Setting this option changes default of use_fully_qualified_names to True. It is not allowed to use this option together with use_fully_qualified_names set to False.
pt: Por favor note que se esta opção for definida, todos os utilizadores do domínio principal têm de usar os seus nomes totalmente qualificados, ex. utilizador@nome-domínio, para login. Definir esta opção muda a predefinição de use_fully_qualified_names para True. Não é permitido usar esta opção em conjunto com use_fully_qualified_names definido para False.

source: Default: not set
pt: Predefinição: não definida

source: This parameter will replace spaces (space bar) with the given character for user and group names. e.g. (_). User name &quot;john doe&quot; will be &quot;john_doe&quot; This feature was added to help compatibility with shell scripts that have difficulty handling spaces, due to the default field separator in the shell.
pt: Este parâmetro irá substituir os espaços (barra de espaços) pelo caractere fornecido para nomes de utilizador e grupo. Ex. (_). O nome de utilizador &quot;john doe&quot; irá ficar &quot;john_doe&quot; Esta funcionalidade foi adicionada para ajudar na compatibilidade com scripts de shell que têm dificuldade a lidar com espaços, devido ao separador de campo predefinido na shell.

source: Please note it is a configuration error to use a replacement character that might be used in user or group names. If a name contains the replacement character SSSD tries to return the unmodified name but in general the result of a lookup is undefined.
pt: Por favor note que é um erro de configuração usar um caractere substituto que possa ser usado em nomes de utilizador ou grupo. Se um nome conter o caractere de substituição, o SSSD tenta retornar o nome não modificado mas no geral o resultado duma procura é indefinido.

source: Default: not set (spaces will not be replaced)
pt: Predefinição: não definida (os espaços não serão substituídos)

source: Disables Online Certificate Status Protocol (OCSP) checks. This might be needed if the OCSP servers defined in the certificate are not reachable from the client.
pt: Desactiva as verificações Online Certificate Status Protocol (OCSP). Isto pode ser necessário se os servidores OCSP definidos no certificado não forem alcançáveis a partir do cliente.

source: If a connection cannot be established to an OCSP responder the OCSP check is skipped. This option should be used to allow authentication when the system is offline and the OCSP responder cannot be reached.
pt: Se uma ligação não puder ser estabelecida com um respondedor OCSP a verificação OCSP é saltada. Esta opção deve ser usada para permitir a autenticação quando o sistema está offline e o respondedor OCSP não pode ser alcançado.

source: Digest (hash) function used to create the certificate ID for the OCSP request. Allowed values are:
pt: Função de digestão (hash) usada para criar o ID de certificado para o pedido OCSP. Os valores permitidos são:

source: Default: sha1 (to allow compatibility with RFC5019-compliant responder)
pt: Predefinição: sha1 (para permitir compatibilidade com respondedor RFC5019-compatível)

source: Disables verification completely. This option should only be used for testing.
pt: Desactiva completamente a verificação. Esta opção só deve ser usada para testes.

source: Allow verification to succeed even if a <replaceable>complete</replaceable> chain cannot be built to a self-signed trust-anchor, provided it is possible to construct a chain to a trusted certificate that might not be self-signed.
pt: Permite que a verificação tenha sucesso mesmo que não possa ser compilada uma cadeia <replaceable>completa</replaceable> a uma ancora de confiança auto-assinada, desde que seja possível construir uma cadeia a um certificado de confiança que pode não ser auto-assinado.

source: Sets the OCSP default responder which should be used instead of the one mentioned in the certificate. URL must be replaced with the URL of the OCSP default responder e.g. http://example.com:80/ocsp.
pt: Define o respondedor predefinido do OCSP o qual deve ser usado em vez do mencionado no certificado. URL tem de ser substituído pelo URL do respondedor predefinido do OCSP ex. http://exemplo.com:80/ocsp.

source: ocsp_default_responder_signing_cert=NAME
pt: ocsp_default_responder_signing_cert=NOME

source: This option is currently ignored. All needed certificates must be available in the PEM file given by pam_cert_db_path.
pt: Esta opção é presentemente ignorada. Todos os certificados necessários têm de estar disponíveis no ficheiro PEM dado por pam_cert_db_path.

source: crl_file=/PATH/TO/CRL/FILE
pt: crl_file=/CAMINHO/PARA/FICHEIRO/CRL

source: Use the Certificate Revocation List (CRL) from the given file during the verification of the certificate. The CRL must be given in PEM format, see <citerefentry> <refentrytitle>crl</refentrytitle> <manvolnum>1ssl</manvolnum> </citerefentry> for details.
pt: Usa a Certificate Revocation List (CRL) a partir do ficheiro dado durante a verificação do certificado. O CRL tem de ser dado em formato PEM, veja <citerefentry> <refentrytitle>crl</refentrytitle> <manvolnum>1ssl</manvolnum> </citerefentry> para detalhes.

source: If a Certificate Revocation List (CRL) is expired ignore the expiration time of the CRL and check the related certificates with the expired CRL. This option should be used to allow authentication when the system is offline and the CRL cannot be renewed.
pt: Se uma Certificate Revocation List (CRL) expirou ignora a validade do CRL e verifica os certificados relacionados com o CRL expirado. Esta opção deve ser usada para permitir autenticação quando o sistema está offline e a CRL não pode ser renovada.

source: With this parameter the certificate verification can be tuned with a comma separated list of options. Supported options are: <placeholder type="variablelist" id="0"/>
pt: Com este parâmetro a verificação de certificado pode ser afinada com uma lista de opções separadas por vírgulas. As opções suportadas são: <placeholder type="variablelist" id="0"/>

source: Unknown options are reported but ignored.
pt: As opções desconhecidas são reportadas mas ignoradas.

source: Default: not set, i.e. do not restrict certificate verification
pt: Predefinição: não definida, isto é, não restringe a verificação de certificados

source: disable_netlink (boolean)
pt: disable_netlink (booleano)

source: SSSD hooks into the netlink interface to monitor changes to routes, addresses, links and trigger certain actions.
pt: SSSD vincula-se à interface netlink para monitorizar alterações a rotas, endereços, ligações e despoleta certas acções.

source: The SSSD state changes caused by netlink events may be undesirable and can be disabled by setting this option to 'true'
pt: As alterações de estado do SSSD causadas pelos eventos netlink podem ser indesejáveis e podem ser desativados ao definir esta opção para 'true'

source: Default: false (netlink changes are detected)
pt: Predefinição: false (alterações netlink são detetadas)
