Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: Size (in megabytes) of the data table allocated inside fast in-memory cache for group requests. Setting the size to 0 will disable the group in-memory cache.
pt: Tamanho (em megabytes) da tabela de dados alocada dentro da cache em-memória rápida para pedidos de grupo. Definir o tamanho para 0 irá desactivar a cache em-memória de grupo.

source: Default: 6
pt: Predefinição: 6

source: memcache_size_initgroups (integer)
pt: memcache_size_initgroups (inteiro)

source: Size (in megabytes) of the data table allocated inside fast in-memory cache for initgroups requests. Setting the size to 0 will disable the initgroups in-memory cache.
pt: Tamanho (em megabytes) da tabela de dados alocada dentro da cache em-memória rápida para pedidos de initgroups. Definir o tamanho para 0 irá desactivar a cache em-memória de initgroups.

source: memcache_size_sid (integer)
pt: memcache_size_sid (inteiro)

source: Size (in megabytes) of the data table allocated inside fast in-memory cache for SID related requests. Only SID-by-ID and ID-by-SID requests are currently cached in fast in-memory cache. Setting the size to 0 will disable the SID in-memory cache.
pt: Tamanho (em megabytes) da tabela de dados alocada dentro da cache em-memória rápida para pedidos relacionados com SID. Apenas pedidos SID-by-ID e ID-by-SID são actualmente postos em cache na cache em-memória rápida. Definir o tamanho para 0 irá desactivar a cache em-memória de SID.

source: Some of the additional NSS responder requests can return more attributes than just the POSIX ones defined by the NSS interface. The list of attributes is controlled by this option. It is handled the same way as the <quote>user_attributes</quote> option of the InfoPipe responder (see <citerefentry> <refentrytitle>sssd-ifp</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> for details) but with no default values.
pt: Alguns dos pedidos adicionais do respondedor NSS podem retornar mais atributos que apenas os POSIX definidos pela interface do NSS. A lista de atributos é controlada por esta opção. É lidada do mesmo modo que a opção <quote>user_attributes</quote> do respondedor InfoPipe (veja <citerefentry> <refentrytitle>sssd-ifp</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para detalhes) mas sem valores predefinidos.

source: To make configuration more easy the NSS responder will check the InfoPipe option if it is not set for the NSS responder.
pt: Para facilitar a configuração o respondedor NSS irá verificar a opção InfoPipe se não está definida para o respondedor NSS.

source: Default: not set, fallback to InfoPipe option
pt: Predefinição: não definida, cai para a opção InfoPipe

source: The value that NSS operations that return users or groups will return for the <quote>password</quote> field.
pt: O valor que as operações NSS que retornam utilizadores ou grupos irá retornar para o campo <quote>password</quote>.

source: Default: <quote>*</quote>
pt: Predefinição: <quote>*</quote>

source: Note: This option can also be set per-domain which overwrites the value in [nss] section.
pt: Nota: Esta opção também pode ser definida por-domínio o que sobrepõe o valor na secção [nss].

source: Default: <quote>not set</quote> (remote domains), <quote>x</quote> (proxy domain with nss_files and sssd-shadowutils target)
pt: Predefinição: <quote>não definida</quote> (domínios remotos), <quote>x</quote> (domínios proxy com nss_files e alvo sssd-shadowutils)

source: PAM configuration options
pt: Opções de configuração do PAM

source: These options can be used to configure the Pluggable Authentication Module (PAM) service.
pt: Estas opções podem ser usadas para configurar o serviço Pluggable Authentication Module (PAM).

source: offline_credentials_expiration (integer)
pt: offline_credentials_expiration (inteiro)

source: If the authentication provider is offline, how long should we allow cached logins (in days since the last successful online login).
pt: Se o provedor de autenticação estiver offline, durante quanto tempo devemos permitir logins em cache (em dias desde o último login online com sucesso).

source: Default: 0 (No limit)
pt: Predefinição: 0 (Sem Limite)

source: offline_failed_login_attempts (integer)
pt: offline_failed_login_attempts (inteiro)

source: If the authentication provider is offline, how many failed login attempts are allowed.
pt: Se o provedor de autenticação estiver offline, quantas tentativas de login falhadas são permitidas.

source: offline_failed_login_delay (integer)
pt: offline_failed_login_delay (inteiro)

source: The time in minutes which has to pass after offline_failed_login_attempts has been reached before a new login attempt is possible.
pt: O tempo em segundos que tem de passar após ser atingido offline_failed_login_attempts e antes de ser possível nova tentativa de login.

source: If set to 0 the user cannot authenticate offline if offline_failed_login_attempts has been reached. Only a successful online authentication can enable offline authentication again.
pt: Se definido para 0 o utilizador não se pode autenticar offline se for atingido offline_failed_login_attempts. Apenas uma autenticação online com sucesso pode activar a autenticação offline outra vez.

source: Default: 5
pt: Predefinição: 5

source: pam_verbosity (integer)
pt: pam_verbosity (inteiro)

source: Controls what kind of messages are shown to the user during authentication. The higher the number to more messages are displayed.
pt: Contra que tipo de mensagens são mostradas ao utilizador durante a autenticação. Quanto mais alto o número mais mensagens são mostradas.

source: Currently sssd supports the following values:
pt: Actualmente o sssd suporta os seguintes valores:

source: <emphasis>0</emphasis>: do not show any message
pt: <emphasis>0</emphasis>: não mostra nenhuma mensagem

source: <emphasis>1</emphasis>: show only important messages
pt: <emphasis>1</emphasis>: mostra apenas mensagens importantes

source: <emphasis>2</emphasis>: show informational messages
pt: <emphasis>2</emphasis>: mostra mensagens informativas

source: <emphasis>3</emphasis>: show all messages and debug information
pt: <emphasis>3</emphasis>: mostra todas as mensagens e informação de depuração

source: Default: 1
pt: Predefinição: 1

source: A comma separated list of strings which allows to remove (filter) data sent by the PAM responder to pam_sss PAM module. There are different kind of responses sent to pam_sss e.g. messages displayed to the user or environment variables which should be set by pam_sss.
pt: Uma lista de strings separadas por vírgulas que permite remover (filtrar) dados enviados pelo respondedor PAM ao módulo pam_sss do PAM. Existem diferentes tipos de respostas enviadas ao pam_sss ex. mensagens mostradas ao utilizador ou variáveis de ambiente que devem ser definidas pelo pam_sss.

source: While messages already can be controlled with the help of the pam_verbosity option this option allows to filter out other kind of responses as well.
pt: Apesar das mensagens já poderem ser controladas com a ajuda da opção pam_verbosity, esta opção permite filtrar também outro tipo de respostas.

source: Do not send any environment variables to any service.
pt: Não envia nenhumas variáveis de ambiente para nenhum serviço.

source: Do not send environment variable var_name to any service.
pt: Não envia a variável de ambiente var_name para nenhum serviço.

source: Do not send environment variable var_name to service.
pt: Não envia a variável de ambiente var_name para o serviço.

source: Currently the following filters are supported: <placeholder type="variablelist" id="0"/>
pt: Actualmente os seguintes filtros são suportados: <placeholder type="variablelist" id="0"/>

source: The list of strings can either be the list of filters which would set this list of filters and overwrite the defaults. Or each element of the list can be prefixed by a '+' or '-' character which would add the filter to the existing default or remove it from the defaults, respectively. Please note that either all list elements must have a '+' or '-' prefix or none. It is considered as an error to mix both styles.
pt: A lista de strings pode ou ser a lista de filtros o que iria definir esta lista de filtros e sobrepor as predefinições, Ou cada elemento da lista pode ser prefixado com um caractere '+' ou '-' o que irá adicionar ou remover o filtro à predefinição existente. Por favor note que ou todos os membros da lista têm de ter um prefixo '+' ou '-' ou nenhum pode. É considerado um erro misturar ambos os estilos.

source: Default: ENV:KRB5CCNAME:sudo, ENV:KRB5CCNAME:sudo-i
pt: Predefinição: ENV:KRB5CCNAME:sudo, ENV:KRB5CCNAME:sudo-i

source: Example: -ENV:KRB5CCNAME:sudo-i will remove the filter from the default list
pt: Exemplo: -ENV:KRB5CCNAME:sudo-i irá remover o filtro da lista predefinida

source: pam_id_timeout (integer)
pt: pam_id_timeout (inteiro)

source: For any PAM request while SSSD is online, the SSSD will attempt to immediately update the cached identity information for the user in order to ensure that authentication takes place with the latest information.
pt: Para qualquer pedido PAM enquanto o SSSD está online, o SSSD irá tentar actualizar imediatamente a informação de identidade em cache para o utilizador de modo a assegurar que a autenticação tem lugar com a informação mais recente.

source: A complete PAM conversation may perform multiple PAM requests, such as account management and session opening. This option controls (on a per-client-application basis) how long (in seconds) we can cache the identity information to avoid excessive round-trips to the identity provider.
pt: Uma conversação PAM pode executar múltiplos pedidos PAM, tais como gestão de conta e abertura de sessão. Esta opção controla (numa base por-aplicação-de-cliente) quanto tempo (em segundos) podemos manter em cache a informação de identificação para evitar viagens de ida-e-volta excessivas do provedor de identidade.

source: pam_pwd_expiration_warning (integer)
pt: pam_pwd_expiration_warning (inteiro)

source: Display a warning N days before the password expires.
pt: Mostra um aviso N dias antes da palavra passe expirar.

source: Please note that the backend server has to provide information about the expiration time of the password. If this information is missing, sssd cannot display a warning.
pt: Por favor note que o servidor backend tem de fornecer informação acerca do tempo de expiração da palavra passe. Se esta informação estiver em falta, o sssd não pode mostrar um aviso.

source: If zero is set, then this filter is not applied, i.e. if the expiration warning was received from backend server, it will automatically be displayed.
pt: Se zero for definido, então este filtro não é aplicado, isto é, se o aviso de expiração foi recebido do servidor backend, será mostrado automaticamente.

source: This setting can be overridden by setting <emphasis>pwd_expiration_warning</emphasis> for a particular domain.
pt: Esta definição pode ser sobreposta ao definir <emphasis>pwd_expiration_warning</emphasis> para um domínio particular.

source: Default: 0
pt: Predefinição: 0

source: Specifies the comma-separated list of UID values or user names that are allowed to run PAM conversations against trusted domains. Users not included in this list can only access domains marked as public with <quote>pam_public_domains</quote>. User names are resolved to UIDs at startup.
pt: Especifica uma lista valores UID ou nomes de utilizadores separados por vírgulas que têm permissão de correr conversações PAM contra domínios de confiança. Os utilizadores não incluídos nesta lista só podem aceder a domínios marcados como públicos com <quote>pam_public_domains</quote>. Os nomes de utilizadores são resolvidos em UIDs no arranque.

source: Default: All users are considered trusted by default
pt: Predefinição: Todos os utilizadores são considerados de confiança por predefinição

source: Please note that UID 0 is always allowed to access the PAM responder even in case it is not in the pam_trusted_users list.
pt: Por favor note que o UID 0 tem sempre permissão de acesso ao respondedor PAM mesmo no caso de não estar na lista pam_trusted_users.

source: Specifies the comma-separated list of domain names that are accessible even to untrusted users.
pt: Especifica a lista de nomes de domínio separados por vírgulas que estão acessíveis até para utilizadores não de confiança.

source: Two special values for pam_public_domains option are defined:
pt: Dois valores especiais para a opção pam_public_domains são definidos:

source: all (Untrusted users are allowed to access all domains in PAM responder.)
pt: all (Utilizadores não de confiança têm permissão de acesso a todos os domínios no respondedor PAM.)

source: none (Untrusted users are not allowed to access any domains PAM in responder.)
pt: none (Utilizadores não de confiança não têm permissão de acesso a nenhum domínio PAM no respondedor.)

source: Default: none
pt: Predefinição: none

source: Allows a custom expiration message to be set, replacing the default 'Permission denied' message.
pt: Permite que se defina uma mensagem de expiração personalizada, substituindo a mensagem "Permissão negada" predefinida.

source: Note: Please be aware that message is only printed for the SSH service unless pam_verbosity is set to 3 (show all messages and debug information).
pt: Nota: Por favor tenha atenção que a mensagem é apenas escrita para o serviço SSH a menos que pam_verbosity seja definido para 3 (mostrar todas as mensagens e informação de depuração).

source: Allows a custom lockout message to be set, replacing the default 'Permission denied' message.
pt: Permite que se defina uma mensagem de bloqueio personalizada, substituindo a mensagem "Permissão negada" predefinida.

source: pam_passkey_auth (bool)
pt: pam_passkey_auth (booleano)

source: Enable passkey device based authentication.
pt: Activar autenticação baseada em dispositivo passkey.

source: Default: True
pt: Predefinição: TRUE

source: passkey_debug_libfido2 (bool)
pt: passkey_debug_libfido2 (booleano)

source: Enable libfido2 library debug messages.
pt: Ativa mensagens de depuração da biblioteca libfido2.

source: Default: False
pt: Predefinição: False

source: pam_cert_auth (bool)
pt: pam_cert_auth (booleano)

source: Enable certificate based Smartcard authentication. Since this requires additional communication with the Smartcard which will delay the authentication process this option is disabled by default.
pt: Activa a certificação baseada em autenticação Smartcard. Como isto requer comunicação adicional com a Smartcard o que vai atrasar o processo de autenticação, esta opção vem desactivada por predefinição.

source: The path to the certificate database.
pt: O caminho para a base de dados de certificados.

source: Default:
pt: Predefinição:

source: /etc/sssd/pki/sssd_auth_ca_db.pem (path to a file with trusted CA certificates in PEM format)
pt: /etc/sssd/pki/sssd_auth_ca_db.pem (caminho para um ficheiro com certificados CA de confiança em formato PEM)

source: With this parameter the PAM certificate verification can be tuned with a comma separated list of options that override the <quote>certificate_verification</quote> value in <quote>[sssd]</quote> section. Supported options are the same of <quote>certificate_verification</quote>.
pt: Com este parâmetro a verificação de certificado PAM pode ser afinada com uma lista separada por vírgulas de opções que sobrepõem o valor <quote>certificate_verification</quote> na secção <quote>[sssd]</quote>. As opções suportadas são as mesmas de <quote>certificate_verification</quote>.

source: Default: not set, i.e. use default <quote>certificate_verification</quote> option defined in <quote>[sssd]</quote> section.
pt: Predefinição: não definida, isto é, usa opção predefinida <quote>certificate_verification</quote> definida na secção <quote>[sssd]</quote>.

source: p11_child_timeout (integer)
pt: p11_child_timeout (inteiro)

source: How many seconds will pam_sss wait for p11_child to finish.
pt: Quantos segundos irá o pam_sss esperar por p11_child terminar.

source: passkey_child_timeout (integer)
pt: passkey_child_timeout (inteiro)

source: How many seconds will the PAM responder wait for passkey_child to finish.
pt: Quantos segundos irá o respondedor PAM esperar que a passkey_child termine.

source: Which PAM services are permitted to contact domains of type <quote>application</quote>
pt: Quais serviços PAM têm permissão de contactar domínios do tipo <quote>application</quote>

source: A comma-separated list of PAM service names for which it will be allowed to use Smartcards.
pt: Uma lista de nomes de serviços PAM separados por vírgulas para os quais será permitido usarem Smartcards.

source: It is possible to add another PAM service name to the default set by using <quote>+service_name</quote> or to explicitly remove a PAM service name from the default set by using <quote>-service_name</quote>. For example, in order to replace a default PAM service name for authentication with Smartcards (e.g. <quote>login</quote>) with a custom PAM service name (e.g. <quote>my_pam_service</quote>), you would use the following configuration: <placeholder type="programlisting" id="0"/>
pt: É possível adicionar outro nome de serviço PAM ao conjunto predefinido ao usar <quote>+service_name</quote> ou removendo explicitamente um nome de serviço PAM do conjunto predefinido ao usar <quote>-service_name</quote>. Por exemplo, de modo a substituir um nome de serviço PAM predefinido para autenticação com Smartcards (ex. <quote>login</quote>) por um nome de serviço PAM personalizado (ex. <quote>my_pam_service</quote>), você deverá usar a seguinte configuração: <placeholder type="programlisting" id="0"/>

source: Default: the default set of PAM service names includes:
pt: Predefinição: o conjunto predefinido de nomes de serviços do PAM inclui:

source: p11_wait_for_card_timeout (integer)
pt: p11_wait_for_card_timeout (inteiro)

source: If Smartcard authentication is required how many extra seconds in addition to p11_child_timeout should the PAM responder wait until a Smartcard is inserted.
pt: Se for requerida autenticação Smartcard quantos segundos extra adicionais a p11_child_timeout deve o respondedor PAM esperar até que uma Smartcard seja inserida.

source: PKCS#11 URI (see RFC-7512 for details) which can be used to restrict the selection of devices used for Smartcard authentication. By default SSSD's p11_child will search for a PKCS#11 slot (reader) where the 'removable' flags is set and read the certificates from the inserted token from the first slot found. If multiple readers are connected p11_uri can be used to tell p11_child to use a specific reader.
pt: URI PKCS#11 (veja RFC-7512 para detalhes) que pode ser usado para restringir a selecção de dispositivos usados para autenticação Smartcard. Por predefinição o p11_child do SSSD irá procurar por uma slot PKCS#11 (leitor) onde a bandeira 'removable' está definida e ler os certificados a partir do token inserido a partir da primeira slot encontrada. Se estiverem ligados múltiplos leitores. o p11_uri pode ser usado para dizer ao p11_child para usar um leitor específico.

source: Example: <placeholder type="programlisting" id="0"/> or <placeholder type="programlisting" id="1"/> To find suitable URI please check the debug output of p11_child. As an alternative the GnuTLS utility 'p11tool' with e.g. the '--list-all' will show PKCS#11 URIs as well.
pt: Exemplo: <placeholder type="programlisting" id="0"/> ou <placeholder type="programlisting" id="1"/> Para encontrar URI apropriado por favor verifique o resultado de depuração de p11_child. Como alternativa o utilitário GnuTLS 'p11tool' com ex. '--list-all' irá também mostrar URIs PKCS#11.

source: Always do an online lookup, please note that pam_id_timeout still applies
pt: Faz sempre uma busca online, por favor note que pam_id_timeout ainda se aplica

source: Only do an online lookup if there is no active session of the user, i.e. if the user is currently not logged in
pt: Apenas faz uma busca online se não existir uma sessão activa do utilizador, isto é, se o utilizador presentemente não está "logged in"

source: Never force an online lookup, use the data from the cache as long as they are not expired
pt: Nunca força uma busca online, usa os dados da cache desde que estes não estejam expirados

source: The PAM responder can force an online lookup to get the current group memberships of the user trying to log in. This option controls when this should be done and the following values are allowed: <placeholder type="variablelist" id="0"/>
pt: O respondedor PAM pode forçar uma pesquisa online para obter os membros do grupo actual do utilizador que tenta fazer login. Esta opção controla quando isto deve ser feito e os seguintes valores são permitidos: <placeholder type="variablelist" id="0"/>

source: Default: no_session
pt: Predefinição: no_session

source: Comma separated list of PAM services that are allowed to try GSSAPI authentication using pam_sss_gss.so module.
pt: Lista de serviços PAM separados por vírgulas que têm permissão de tentar autenticação GSSAPI usando o módulo pam_sss_gss.so.

source: To disable GSSAPI authentication, set this option to <quote>-</quote> (dash).
pt: Para desactivar a autenticação GSSAPI, defina esta opção para <quote>-</quote> (traço).

source: Note: This option can also be set per-domain which overwrites the value in [pam] section. It can also be set for trusted domain which overwrites the value in the domain section.
pt: Nota: Esta opção também pode ser definida por-domínio o que sobrepõe o valor na secção [pam]. Também pode ser definida para domínio de confiança o que sobrepõe o valor na secção domain.

source: Example: <placeholder type="programlisting" id="0"/>
pt: Exemplo: <placeholder type="programlisting" id="0"/>

source: Default: - (GSSAPI authentication is disabled)
pt: Predefinição: - (a autenticação GSSAPI é desactivada)

source: If True, SSSD will require that the Kerberos user principal that successfully authenticated through GSSAPI can be associated with the user who is being authenticated. Authentication will fail if the check fails.
pt: Se True, SSSD irá requerer que o principal utilizador Kerberos que se autenticou com sucesso via GSSAPI possa ser associado ao utilizador que está a ser autenticado. A autenticação irá falhar se a verificação falhar.

source: If False, every user that is able to obtained required service ticket will be authenticated.
pt: Se False, cada utilizador capaz de obter o requerido bilhete de serviço irá ser autenticado.

source: Comma separated list of authentication indicators required to be present in a Kerberos ticket to access a PAM service that is allowed to try GSSAPI authentication using pam_sss_gss.so module.
pt: Lista de indicadores de autenticação separados por vírgulas requeridos a estarem presentes num bilhete Kerberos para acesso a serviço PAM que tem permissão de tentar autenticação GSSAPI usando o módulo pam_sss_gss.so.
