Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: If a special file (<filename>/var/lib/sss/pubconf/pam_preauth_available</filename>) exists SSSD's PAM module pam_sss will ask SSSD to figure out which authentication methods are available for the user trying to log in. Based on the results pam_sss will prompt the user for appropriate credentials.
pt: Se um ficheiro especial (<filename>/var/lib/sss/pubconf/pam_preauth_available</filename>) existir o módulo pam_sss do PAM do SSSD irá pedir ao SSSD para perceber quais métodos de autenticação estão disponíveis para o utilizador que tenta iniciar sessão. Com base nos resultados o pam_sss irá incitar o utilizador pelas credenciais apropriadas.

source: With the growing number of authentication methods and the possibility that there are multiple ones for a single user the heuristic used by pam_sss to select the prompting might not be suitable for all use cases. The following options should provide a better flexibility here.
pt: Com o crescente número de métodos de autenticação e a possibilidade de que existam vários para um único utilizador, a heurística usada pelo pam_sss para selecionar a incitação pode não ser apropriada para todos os casos. As seguintes opções fornecem melhor flexibilidade aqui.

source: to change the string of the password prompt
pt: para alterar o texto da incitação da palavra passe

source: to configure password prompting, allowed options are: <placeholder type="variablelist" id="0"/>
pt: para configurar a incitação da palavra passe, as opções permitidas são: <placeholder type="variablelist" id="0"/>

source: to change the string of the prompt for the first factor
pt: para alterar a string da incitação para o primeiro factor

source: to change the string of the prompt for the second factor
pt: para alterar o texto da incitação para o segundo factor

source: boolean value, if True there will be only a single prompt using the value of first_prompt where it is expected that both factors are entered as a single string. Please note that both factors have to be entered here, even if the second factor is optional.
pt: valor booleano, se True irá existir apenas uma incitação usando o valor de first_prompt onde é esperado que ambos factores são inseridos como uma única string. Por favor note que ambos factores têm de ser inseridos aqui, mesmo que o segundo factor seja opcional.

source: to configure two-factor authentication prompting, allowed options are: <placeholder type="variablelist" id="0"/> If the second factor is optional and it should be possible to log in either only with the password or with both factors two-step prompting has to be used.
pt: para configurar a incitação de autenticação de dois-factores, as opções permitidas são: <placeholder type="variablelist" id="0"/> Se o segundo factor for opcional e se deve ser possível registar ou apenas com a palavra passe ou com ambos factores a incitação de dois-passos tem de ser usada.

source: Some clients, such as SSH with 'PasswordAuthentication yes', generate their own prompts and do not use prompts provided by SSSD or other PAM modules. Additionally, for SSH with PasswordAuthentication, if two-factor authentication is available, SSSD expects that the credentials entered by the user at the SSH password prompt will always be the two factors in a single string, even if two-factor authentication is optional.
pt: Alguns clientes, como o SSH com 'PasswordAuthentication yes', geram os seus próprios avisos e não usam os avisos fornecidos pelo SSSD ou outros módulos PAM. Adicionalmente, para SSH com PasswordAuthentication, se a autenticação de dois-factores estiver ativa, o SSSD espera que as credenciais inseridas pelo utilizador no aviso de palavra passe do SSH seja sempre os dois factores numa única string, mesmo que a autenticação de dois-factores seja opcional.

source: boolean value, if True prompt a message and wait before testing the presence of a passkey device. Recommended if your device doesn’t have a tactile trigger.
pt: valor booleano, se True incita uma mensagem e espera antes de testar a presença dum dispositivo passkey. Recomendado se o seu dispositivo não tiver um gatilho táctico.

source: to change the message of the interactive prompt.
pt: para alterar a mensagem da incitação interactiva.

source: boolean value, if True prompt a message to remind the user to touch the device.
pt: valor booleano, se True incita uma mensagem a lembrar o utilizador a tocar no dispositivo.

source: to change the message of the touch prompt.
pt: para mudar a mensagem do aviso de toque.

source: to configure passkey authentication prompting, allowed options are: <placeholder type="variablelist" id="0"/>
pt: para configura a incitação a autenticação passkey, as opções permitidas são: <placeholder type="variablelist" id="0"/>

source: Each supported authentication method has its own configuration subsection under <quote>[prompting/...]</quote>. Currently there are: <placeholder type="variablelist" id="0"/> <placeholder type="variablelist" id="1"/> <placeholder type="variablelist" id="2"/>
pt: Cada método de autenticação suportado tem a sua sub-secção de configuração sub <quote>[prompting/...]</quote>. Actualmente existem: <placeholder type="variablelist" id="0"/> <placeholder type="variablelist" id="1"/> <placeholder type="variablelist" id="2"/>

source: It is possible to add a subsection for specific PAM services, e.g. <quote>[prompting/password/sshd]</quote> to individual change the prompting for this service.
pt: É possível adicionar uma sub-secção para serviços PAM específicos, ex. <quote>[prompting/password/sshd]</quote> para mudar individualmente a incitação para este serviço.

source: EXAMPLES
pt: EXEMPLOS

source: 1. The following example shows a typical SSSD config. It does not describe configuration of the domains themselves - refer to documentation on configuring domains for more details. <placeholder type="programlisting" id="0"/>
pt: 1. O exemplo seguinte mostra uma configuração SSSD típica. Não descreve a configuração dos próprios domínios - consulte a documentação sobre configuração de domínios para mais detalhes. <placeholder type="programlisting" id="0"/>

source: 2. The following example shows configuration of IPA AD trust where the AD forest consists of two domains in a parent-child structure. Suppose IPA domain (ipa.com) has trust with AD domain(ad.com). ad.com has child domain (child.ad.com). To enable shortnames in the child domain the following configuration should be used. <placeholder type="programlisting" id="0"/>
pt: 2. O seguinte exemplo mostra a configuração de confiança IPA AD onde a floresta AD consiste de dois domínios numa estrutura pai filho. É suposto o domínio IPA (ipa.com) ter confiança com domínio AD (ad.com). ad.com tem domínio filho (child.ad.com). Para activar os nomes curtos no domínio filho deve ser usada a seguinte configuração. <placeholder type="programlisting" id="0"/>

source: 3. The following example shows the configuration of a certificate mapping rule. It is valid for the configured domain <quote>my.domain</quote> and additionally for the subdomains <quote>your.domain</quote> and uses the full certificate in the search filter. <placeholder type="programlisting" id="0"/>
pt: 3. O exemplo seguinte mostra a configuração de uma regra de mapeamento de certificado. É válida para o domínio configurado <quote>my.domain</quote> e adicionalmente para os subdomínios <quote>your.domain</quote> e usa o certificado completo no filtro de procura. <placeholder type="programlisting" id="0"/>

source: SSSD LDAP provider
pt: Provedor LDAP do SSSD

source: DESCRIPTION
pt: DESCRIÇÃO

source: This manual page describes the configuration of LDAP domains for <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Refer to the <quote>FILE FORMAT</quote> section of the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page for detailed syntax information.
pt: Este manual descreve a configuração de domínios LDAP para <citerefentry> <refentrytitle>sssd</refentrytitle> <manvolnum>8</manvolnum> </citerefentry>. Consulte a secção <quote>FORMATO DE FICHEIRO</quote> do manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para informação detalhada de sintaxe.

source: You can configure SSSD to use more than one LDAP domain.
pt: Você pode configurar o SSSD para usar mais de um domínio LDAP.

source: LDAP back end supports id, auth, access and chpass providers. If you want to authenticate against an LDAP server either TLS/SSL or LDAPS is required. <command>sssd</command> <emphasis>does not</emphasis> support authentication over an unencrypted channel. Even if the LDAP server is used only as an identity provider, an encrypted channel is strongly recommended. Please refer to the <quote>ldap_access_filter</quote> config option for more information about using LDAP as an access provider.
pt: O backend do LDAP suporta provedores id, auth, access e chpass. Se você deseja autenticar contra um servidor LDAP é requerido ou TLS/SSL ou LDAPS. O <command>sssd</command> <emphasis>não</emphasis> suporta autenticação por um canal não encriptado. Mesmo que o servidor LDAP seja usado apenas como um provedor de identidade, é fortemente recomendado um canal encriptado. Por favor consulte a opção de configuração <quote>ldap_access_filter</quote> para mais informação sobre usar LDAP como um provedor de acesso.

source: CONFIGURATION OPTIONS
pt: OPÇÕES DE CONFIGURAÇÃO

source: Specifies the comma-separated list of URIs of the LDAP servers to which SSSD should connect in the order of preference. Refer to the <quote>FAILOVER</quote> section for more information on failover and server redundancy. If neither option is specified, service discovery is enabled. For more information, refer to the <quote>SERVICE DISCOVERY</quote> section.
pt: Especifica uma lista de URIs separados por vírgulas dos servidores LDAP aos quais o SSSD deve ligar pela ordem de preferência. Consulte a secção <quote>FAILOVER</quote> para mais informação sobre failover e redundância de servidor. Se nenhuma das opções for especificada, é activa a descoberta de serviço. Para mais informação consulte a secção <quote>DESCOBERTA DE SERVIÇO</quote>.

source: The format of the URI must match the format defined in RFC 2732:
pt: O formato do URI tem de corresponder ao formato definido em RFC 2732:

source: For explicit IPv6 addresses, &lt;host&gt; must be enclosed in brackets []
pt: Para endereços IPv6 explícitos, &lt;host&gt; tem de ficar dentro de parênteses rectos []

source: example: ldap://[fc00::126:25]:389
pt: exemplo: ldap://[fc00::126:25]:389

source: Specifies the comma-separated list of URIs of the LDAP servers to which SSSD should connect in the order of preference to change the password of a user. Refer to the <quote>FAILOVER</quote> section for more information on failover and server redundancy.
pt: Especifica uma lista de URIs separados por vírgulas dos servidores LDAP aos quais o SSSD deve ligar pela ordem de preferência para mudar a palavra passe de um utilizador. Consulte a secção <quote>FAILOVER</quote> para mais informação sobre failover e redundância de servidor.

source: To enable service discovery ldap_chpass_dns_service_name must be set.
pt: Para activar a descoberta de serviços ldap_chpass_dns_service_name tem de ser definido.

source: Default: empty, i.e. ldap_uri is used.
pt: Predefinição: empty, ou seja, é usado ldap_uri.

source: The default base DN to use for performing LDAP user operations.
pt: O DN base predefinido a usar para executar operações de utilizador LDAP.

source: Starting with SSSD 1.7.0, SSSD supports multiple search bases using the syntax:
pt: A partir de SSSD 1.7.0, o SSSD suporta múltiplas bases de procura usando a sintaxe:

source: The scope can be one of "base", "onelevel" or "subtree".
pt: O escopo pode ser um de "base", "onelevel" ou "subtree".

source: The filter must be a valid LDAP search filter as specified by http://www.ietf.org/rfc/rfc2254.txt
pt: O filtro tem de ser um filtro de busca LDAP válido como especificado por http://www.ietf.org/rfc/rfc2254.txt

source: Examples:
pt: Exemplos:

source: ldap_search_base = dc=example,dc=com (which is equivalent to) ldap_search_base = dc=example,dc=com?subtree?
pt: ldap_search_base = dc=example,dc=com (o que é equivalente a) ldap_search_base = dc=example,dc=com?subtree?

source: Note: It is unsupported to have multiple search bases which reference identically-named objects (for example, groups with the same name in two different search bases). This will lead to unpredictable behavior on client machines.
pt: Nota: Não é suportado ter múltiplas bases de procura que referenciam objetos de nomes idênticos (por exemplo, grupos com o mesmo nome em duas bases de procura diferentes). Isto leva a comportamentos não previsíveis nas máquinas cliente.

source: Default: If not set, the value of the defaultNamingContext or namingContexts attribute from the RootDSE of the LDAP server is used. If defaultNamingContext does not exist or has an empty value namingContexts is used. The namingContexts attribute must have a single value with the DN of the search base of the LDAP server to make this work. Multiple values are are not supported.
pt: Predefinição: Se não definida, é usado o valor do atributo defaultNamingContext ou namingContexts a partir de RootDSE do servidor LDAP. Se defaultNamingContext não existir ou tiver um valor vazio é usado namingContexts. O atributo namingContexts tem de ter um valor único com o DN da base de procura do servidor LDAP para fazer isto funcionar. Não são suportados múltiplos valores.

source: SSSD reads RootDSE to get information about LDAP and its capabilities. By default, this is done anonymously. However, this may not be permitted by the LDAP server. In such cases we can use this option to influence SSSD behavior.
pt: O SSSD lê o RootDSE para obter informação sobre o LDAP e as suas capacidades. Por predefinição, isto é feito em anonimato. No entanto, isto pode não ser permitido pelo servidor LDAP. Em tais casos podemos usar esta opção para influenciar o comportamento do SSSD.

source: Allowed values are:
pt: Valores permitidos são:

source: By default, using the "anonymous" option, SSSD tries to read RootDSE anonymously. If this fails SSSD retries the attempt with authentication.
pt: Por predefinição, usando a opção "anonymous", o SSSD tenta ler o RootDSE anônimo. Se isto falhar o SSSD repete a tentativa com autenticação.

source: Default: anonymous
pt: Predefinição: anonymous

source: Specifies the Schema Type in use on the target LDAP server. Depending on the selected schema, the default attribute names retrieved from the servers may vary. The way that some attributes are handled may also differ.
pt: Especifica o Tipo de Esquema em uso no servidor LDAP alvo. Dependendo do esquema selecionado, os nomes de atributos predefinidos obtidos dos servidores podem variar. A maneira com que alguns atributos são manuseados pode também variar.

source: Four schema types are currently supported:
pt: Quatro tipos de esquema são actualmente suportados:

source: The main difference between these schema types is how group memberships are recorded in the server. With rfc2307, group members are listed by name in the <emphasis>memberUid</emphasis> attribute. With rfc2307bis and IPA, group members are listed by DN and stored in the <emphasis>member</emphasis> attribute. The AD schema type sets the attributes to correspond with Active Directory 2008r2 values.
pt: A principal diferença entre estes tipos de esquema é como os membros de grupo são gravados no servidor. Com rfc2307, os membros de grupo são listados pelo nome no atributo <emphasis>memberUid</emphasis>. Com rfc2307bis e IPA, os membros de grupo são listados por DN e guardados no atributo <emphasis>member</emphasis>. O tipo de esquema AD define os atributos para corresponderem com valores 2008r2 de Active Directory.

source: Default: rfc2307
pt: Predefinição: rfc2307

source: Specify the operation that is used to modify user password.
pt: Especifica a operação que é usada para modificar a palavra passe do utilizador.

source: Two modes are currently supported:
pt: Dois modos são presentemente suportados:

source: ldap_modify - Direct modification of userPassword (not recommended).
pt: ldap_modify - Modificação direta da Palavra passe do utilizador (não recomendado).

source: exop_force - Try Password Modify Extended Operation (RFC 3062) even if there are no grace logins left. Depending on the type and configuration of the LDAP server the password change might fail because an authenticated bind is not possible.
pt: exop_force - Tenta Operação Extensa de Modificação de Palavra passe (RFC 3062) mesmo que não existam mais logins de graça disponíveis. Dependendo do tipo e configuração do servidor LDAP a mudança de palavra passe pode falhar porque uma união de autenticação não é possível.

source: Note: First, a new connection is established to verify current password by binding as the user that requested password change. If successful, this connection is used to change the password therefore the user must have write access to userPassword attribute.
pt: Nota: Primeiro, é estabelecida uma nova ligação para verificar a palavra passe actual ao unir ao utilizador que requisitou a mudança de palavra passe. Se com sucesso, esta ligação é usada para mudar a palavra passe assim o utilizador tem de ter acesso de escrita ao atributo userPassword.

source: Default: exop
pt: Predefinição: exop

source: The default bind DN to use for performing LDAP operations.
pt: O vínculo DN predefinido a usar para executar operações LDAP.

source: The type of the authentication token of the default bind DN.
pt: O tipo de testemunho de autenticação do vínculo DN predefinido.

source: The two mechanisms currently supported are:
pt: Os dois mecanismos presentemente suportados são:

source: Default: password
pt: Predefinição: password

source: See the <citerefentry> <refentrytitle>sss_obfuscate</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> manual page for more information.
pt: Veja o manual <citerefentry> <refentrytitle>sss_obfuscate</refentrytitle> <manvolnum>8</manvolnum> </citerefentry> para mais informação.

source: The authentication token of the default bind DN.
pt: O testemunho de autenticação do vínculo DN predefinido.

source: ldap_force_upper_case_realm (boolean)
pt: ldap_force_upper_case_realm (booleano)

source: Some directory servers, for example Active Directory, might deliver the realm part of the UPN in lower case, which might cause the authentication to fail. Set this option to a non-zero value if you want to use an upper-case realm.
pt: Alguns servidores de directórios, por exemplo Active Directory, podem entregar a parte de reino do UPN em minúsculas, o que pode fazer com que a autenticação falhe. Defina esta opção para um valor não-zero se desejar usar reino em letra maiúscula.

source: ldap_enumeration_refresh_timeout (integer)
pt: ldap_enumeration_refresh_timeout (inteiro)

source: Specifies how many seconds SSSD has to wait before refreshing its cache of enumerated records.
pt: Especifica quantos segundos o SSSD tem de esperar antes de refrescar a sua cache de registos enumerados.

source: ldap_purge_cache_timeout (integer)
pt: ldap_purge_cache_timeout (inteiro)

source: Determine how often to check the cache for inactive entries (such as groups with no members and users who have never logged in) and remove them to save space.
pt: Determina a frequência de verificação da cache por entradas inativas (tais como grupos sem membros e utilizadores que nunca fizeram login) e remove-as para libertar espaço.

source: Setting this option to zero will disable the cache cleanup operation. Please note that if enumeration is enabled, the cleanup task is required in order to detect entries removed from the server and can't be disabled. By default, the cleanup task will run every 3 hours with enumeration enabled.
pt: Definir esta opção para zero irá desactivar a operação de limpeza da cache. Por favor note que se a enumeração estiver activa, a tarefa de limpeza é necessária de modo a se detectar entradas removidas do servidor e que não podem ser desactivadas. Por predefinição, a tarefa de limpeza irá correr a cada 3 horas com a enumeração activa.

source: ldap_group_nesting_level (integer)
pt: ldap_group_nesting_level (inteiro)

source: If ldap_schema is set to a schema format that supports nested groups (e.g. RFC2307bis), then this option controls how many levels of nesting SSSD will follow. This option has no effect on the RFC2307 schema.
pt: Se ldap_schema for definido para um formato de esquema que suporte grupos aninhados (ex. RFC2307bis), então esta opção controla quantos níveis de aninhamento o SSSD irá seguir. Esta opção não tem efeito no esquema RFC2307.

source: Note: This option specifies the guaranteed level of nested groups to be processed for any lookup. However, nested groups beyond this limit <emphasis>may be</emphasis> returned if previous lookups already resolved the deeper nesting levels. Also, subsequent lookups for other groups may enlarge the result set for original lookup if re-queried.
pt: Nota: Esta opção especifica o nível garantido de grupos aninhados a ser processado para qualquer procura. No entanto, os grupos aninhados para lá deste limite <emphasis>podem ser</emphasis> retornados se procuras anteriores já tiverem resolvido os níveis de aninhamento mais fundos. Também, procuras subsequentes por outros grupos podem alargar o resultado definido para a procura original se re-consultadas.

source: If ldap_group_nesting_level is set to 0 then no nested groups are processed at all. However, when connected to Active-Directory Server 2008 and later using <quote>id_provider=ad</quote> it is furthermore required to disable usage of Token-Groups by setting ldap_use_tokengroups to false in order to restrict group nesting.
pt: Se ldap_group_nesting_level estiver definido para 0 então nenhuns grupos aninhados são processados. No entanto, quando ligado a Active-Directory Server 2008 e posterior usando <quote>id_provider=ad</quote> é ainda mais requerido desactivar a utilização de Token-Groups ao definir ldap_use_tokengroups para false de modo a restringir aninhamento de grupos.

source: Default: 2
pt: Predefinição: 2

source: This options enables or disables use of Token-Groups attribute when performing initgroup for users from Active Directory Server 2008 and later.
pt: Estas opções ativam e desativam o uso do atributo Token-Groups quando se executa initgroup para utilizadores de Active Directory Server 2008 e posterior.

source: Default: True for AD and IPA otherwise False.
pt: Predefinição: True para AD e IPA e caso contrário False.

source: Optional. Use the given string as search base for host objects.
pt: Opcional. Usa a string fornecida como base de busca para objectos de anfitrião.

source: See <quote>ldap_search_base</quote> for information about configuring multiple search bases.
pt: Veja <quote>ldap_search_base</quote> para informação acerca de configurar múltiplas bases de busca.

source: Default: the value of <emphasis>ldap_search_base</emphasis>
pt: Predefinição: o valor de <emphasis>ldap_search_base</emphasis>

source: Optional. Use the given string as search base for subordinate ranges related objects.
pt: Opcional. Usa a string dada como base de busca para objectos relacionados com alcances subordinados.

source: ldap_search_timeout (integer)
pt: ldap_search_timeout (inteiro)
