Repository: SSSD/sssd
Catalog: src/man/po/*.po
Languages: pt

source: This substitution is designed to be used in an IPA-AD trust scenario. If this substitution is used for the <emphasis>subdomain_homedir</emphasis> option, it propagates the home directory value from the AD domain to the IPA clients. In this scenario, the option must be set in the SSSD configuration on the IPA server where SSSD is running in server mode.
pt: Esta substituição foi desenhada para ser usada num cenário de confiança IPA-AD. Se esta substituição for usada para a opção <emphasis>subdomain_homedir</emphasis>, vai propagar o valor do directório home do domínio AD para os clientes IPA. Neste cenário, a opção tem de ser definida na configuração SSSD no servidor IPA onde o SSSD está a correr em modo servidor.

source: The path defined for the homedir directory attribute of the identity provider, but in lower case. For details of use, see <emphasis>%o</emphasis>.
pt: O caminho definido para o atributo de directório homedir do provedor de identidade, mas em minúsculas. Para detalhes do uso, veja <emphasis>%o</emphasis>.

source: The value of configure option <emphasis>homedir_substring</emphasis>.
pt: O valor da opção de configuração <emphasis>homedir_substring</emphasis>.

source: Override the user's home directory. You can either provide an absolute value or a template. In the template, the following sequences are substituted: <placeholder type="variablelist" id="0"/>
pt: Sobrepõe o directório home do utilizador. Você pode ou fornecer um valor absoluto ou um modelo. No modelo, as seguintes sequências são substituídas: <placeholder type="variablelist" id="0"/>

source: This option can also be set per-domain.
pt: Esta opção também pode ser definida por-domínio.

source: Default: Not set (SSSD will use the value retrieved from LDAP)
pt: Predefinição: Não definida (o SSSD irá usar o valor obtido de LDAP)

source: Please note, the home directory from a specific override for the user, either locally (see <citerefentry><refentrytitle>sss_override</refentrytitle> <manvolnum>8</manvolnum></citerefentry>) or centrally managed IPA id-overrides, has a higher precedence and will be used instead of the value given by override_homedir.
pt: Por favor note, o directório home duma sobreposição específica para o utilizador, seja localmente (veja <citerefentry><refentrytitle>sss_override</refentrytitle> <manvolnum>8</manvolnum></citerefentry>) ou centralmente gerida por id-overrides de IPA , tem uma precedência mais alta e será usada em vez do valor dado por override_homedir.

source: The value of this option will be used in the expansion of the <emphasis>override_homedir</emphasis> option if the template contains the format string <emphasis>%H</emphasis>. An LDAP directory entry can directly contain this template so that this option can be used to expand the home directory path for each client machine (or operating system). It can be set per-domain or globally in the [nss] section. A value specified in a domain section will override one set in the [nss] section.
pt: O valor desta opção será usado na expansão da opção <emphasis>override_homedir</emphasis> se o modelo conter a string de formato <emphasis>%H</emphasis>. Uma entrada de directório LDAP pode conter directamente este modelo para que esta opção possa ser usada para expandir o caminho do directório home para cada máquina cliente (ou sistema operativo). Pode ser definida por-domínio ou globalmente na secção [nss]. Um valor especificado numa secção domain irá sobrepor aquele definido na secção [nss].

source: Default: /home
pt: Predefinição: /home

source: MODIFIED DEFAULT OPTIONS
pt: OPÇÕES PREDEFINIDAS MODIFICADAS

source: Certain option defaults do not match their respective backend provider defaults, these option names and AD provider-specific defaults are listed below:
pt: Certas predefinições de opções não correspondem às suas predefinições de backend respectivos, estes nomes de opção e predefinições específicas de provedor AD estão listadas em baixo:

source: KRB5 Provider
pt: Provedor KRB5

source: LDAP Provider
pt: Provedor LDAP

source: The AD provider looks for a different principal than the LDAP provider by default, because in an Active Directory environment the principals are divided into two groups - User Principals and Service Principals. Only User Principal can be used to obtain a TGT and by default, computer object's principal is constructed from its sAMAccountName and the AD realm. The well-known host/hostname@REALM principal is a Service Principal and thus cannot be used to get a TGT with.
pt: Por predefinição um provedor AD procura um principal diferente que o provedor LDAP, porque num ambiente Active Directory os principais são divididos em dois grupos - Principais de Utilizador e Principais de Serviço. Apenas o Principal de Utilizador pode ser usado para obter um TGT e por predefinição, o principal de objecto de computador é constituído pelo seu sAMAccountName e o reino AD, O principal host/hostname@REALM well-known é um Principal de Serviço e assim não pode ser usado para se obter TGT com ele.

source: NSS configuration
pt: Configuração do NSS

source: The AD provider automatically sets "fallback_homedir = /home/%d/%u" to provide personal home directories for users without the homeDirectory attribute. If your AD Domain is properly populated with Posix attributes, and you want to avoid this fallback behavior, you can explicitly set "fallback_homedir = %o".
pt: O provedor AD define automaticamente "fallback_homedir = /home/%d/%u" para fornecer directórios home pessoais para utilizadores sem o atributo homeDirectory. Se o seu Domínio AD está povoado apropriadamente com atributos Posix, e você quer evitar este comportamento de recurso, você pode explicitamente definir "fallback_homedir = %o".

source: Note that the system typically expects a home directory in /home/%u folder. If you decide to use a different directory structure, some other parts of your system may need adjustments.
pt: Note que o sistema tipicamente espera um directório home na pasta /home/%u: Se você decidir usar uma estrutura diferente de directórios, outras partes do seu sistema podem precisar de ser ajustadas.

source: For example automated creation of home directories in combination with selinux requires selinux adjustment, otherwise the home directory will be created with wrong selinux context.
pt: Como exemplo a criação automática de directórios home em combinação com selinux requer afinação do selinux, caso contrário o directório home será criado com contexto selinux errado.

source: Certain option defaults do not match their respective backend provider defaults, these option names and IPA provider-specific defaults are listed below:
pt: Certas predefinições de opções não correspondem às suas predefinições de backend respectivos, estes nomes de opção e predefinições específicas de provedor IPA estão listadas em baixo:

source: LDAP Provider - General
pt: Fornecedor LDAP - Geral

source: LDAP Provider - User options
pt: Provedor LDAP - Opções de utilizador

source: LDAP Provider - Group options
pt: Provedor LDAP - Opções de grupo

source: krb5_auth_timeout (integer)
pt: krb5_auth_timeout (inteiro)

source: Timeout in seconds after an online authentication request or change password request is aborted. If possible, the authentication request is continued offline.
pt: Tempo limite em segundos após um pedido de autenticação online ou pedido de mudança de palavra passe abortado. Se possível, o pedido de autenticação é continuado em offline.

source: krb5_validate (boolean)
pt: krb5_validate (booleano)

source: Verify with the help of krb5_keytab that the TGT obtained has not been spoofed. The keytab is checked for entries sequentially, and the first entry with a matching realm is used for validation. If no entry matches the realm, the last entry in the keytab is used. This process can be used to validate environments using cross-realm trust by placing the appropriate keytab entry as the last entry or the only entry in the keytab file.
pt: Verifica com a ajuda de krb5_keytab que o TGT obtido não foi falsificado. A keytab é verificada por entradas sequencialmente, e a primeira entrada com um reino correspondente é usada para validação. Se nenhuma entrada corresponder ao reino, é usada a última entrada na keytab, Este processo pode ser usado para validar ambientes que usam confiança de reino-cruzada ao colocar a entrada keytab apropriada como a última entrada ou a única entrada no ficheiro keytab.

source: Default: false (IPA and AD provider: true)
pt: Predefinição: false (Provedor IPA e AD: true)

source: Please note that the ticket validation is the first step when checking the PAC (see 'pac_check' in the <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> manual page for details). If ticket validation is disabled the PAC checks will be skipped as well.
pt: Por favor note que a validação do bilhete é o primeiro passo quando se verifica o PAC (veja 'pac_check' no manual <citerefentry> <refentrytitle>sssd.conf</refentrytitle> <manvolnum>5</manvolnum> </citerefentry> para detalhes). Se a validação de bilhete estiver desativada as verificações de PAC serão também saltadas.

source: Request a renewable ticket with a total lifetime, given as an integer immediately followed by a time unit:
pt: Requisita um bilhete renovável com um tempo de vida total, dado como um inteiro imediatamente seguido de uma unidade de tempo:

source: <emphasis>s</emphasis> for seconds
pt: <emphasis>s</emphasis> para segundos

source: <emphasis>m</emphasis> for minutes
pt: <emphasis>m</emphasis> para minutos

source: <emphasis>h</emphasis> for hours
pt: <emphasis>h</emphasis> para horas

source: <emphasis>d</emphasis> for days.
pt: <emphasis>d</emphasis> para dias.

source: If there is no unit given, <emphasis>s</emphasis> is assumed.
pt: Se não existir nenhuma unidade dada, é assumido <emphasis>s</emphasis>.

source: NOTE: It is not possible to mix units. To set the renewable lifetime to one and a half hours, use '90m' instead of '1h30m'.
pt: NOTA: Não é possível misturar unidades. Para definir um tempo de vida renovável de uma hora e meia, use '90m' em vez de '1h30m'.

source: Default: not set, i.e. the TGT is not renewable
pt: Predefinição: não definido, ou seja, o TGT não é renovável

source: Request ticket with a lifetime, given as an integer immediately followed by a time unit:
pt: Requisita um bilhete com um tempo de vida, dado como um inteiro imediatamente seguido de uma unidade de tempo:

source: If there is no unit given <emphasis>s</emphasis> is assumed.
pt: Se não existir nenhuma unidade dada é assumido <emphasis>s</emphasis>.

source: NOTE: It is not possible to mix units. To set the lifetime to one and a half hours please use '90m' instead of '1h30m'.
pt: NOTA: Não é possível misturar unidades. Para definir um tempo de vida de uma hora e meia por favor use '90m' em vez de '1h30m'.

source: Default: not set, i.e. the default ticket lifetime configured on the KDC.
pt: Predefinição: não definida, isto é, o tempo de vida de bilhete predefinido configurado no KDC.

source: The time in seconds between two checks if the TGT should be renewed. TGTs are renewed if about half of their lifetime is exceeded, given as an integer immediately followed by a time unit:
pt: O tempo em segundos entre duas verificações se o TGT deve ser renovado. Os TGTs são renovados se cerca de metade do seu tempo de vida for excedido, dado como um inteiro imediatamente seguido por uma unidade de tempo:

source: If this option is not set or is 0 the automatic renewal is disabled.
pt: Se esta opção não for definida ou for 0 a renovação automática é desactivada.

source: Specifies if the host and user principal should be canonicalized. This feature is available with MIT Kerberos 1.7 and later versions.
pt: Especifica se a máquina e o principal utilizador devem ser canonizados. Esta funcionalidade está disponível com o MIT Kerberos 1.7 e versões posteriores.
