Repository: SSSD/sssd
Catalog: po/*.po
Languages: it, pt

source: Whether to include rules that contains regular expression in host attribute
it: Se includere regole che contengono espressioni regolari nell'attributo host
pt: Se deve-se incluir regras que contêm expressão regular no seu atributo host

source: Object class for sudo rules
it: Classe oggetto per le regole sudo
pt: Classe objeto para regras sudo

source: Name of attribute that is used as object class for sudo rules
it: Nome dell'attributo utilizzato come classe oggetto per le regole sudo
pt: Nome do atributo que é usado como classe de objeto para regras sudo

source: Sudo rule name
it: Nome regola sudo
pt: Nome de regra sudo

source: Sudo rule command attribute
it: Attributo comando regola sudo
pt: Atributo de comando de regra sudo

source: Sudo rule host attribute
it: Attributo host regola sudo
pt: Atributo de máquina de regra sudo

source: Sudo rule user attribute
it: Attributo utente regola sudo
pt: Atributo de utilizador de regra sudo

source: Sudo rule option attribute
it: Attributo opzione regola sudo
pt: Atributo de opção de regra sudo

source: Sudo rule runas attribute
it: Attributo runas regola sudo
pt: Atributo de runas de regra sudo

source: Sudo rule runasuser attribute
it: Attributo runasuser regola sudo
pt: Atributo de runas-utilizador de regra sudo

source: Sudo rule runasgroup attribute
it: Attributo runasgroup regola sudo
pt: Atributo de runas-grupo de regra sudo

source: Sudo rule notbefore attribute
it: Attributo notbefore regola sudo
pt: Atributo de não-antes de regra sudo

source: Sudo rule notafter attribute
it: Attributo notafter regola sudo
pt: Atributo de não-depois de regra sudo

source: Sudo rule order attribute
it: Attributo ordine regola sudo
pt: Atributo de ordem de regra sudo

source: Object class for automounter maps
it: Classe oggetto per le mappe automounter
pt: Classe de objeto para mapas do automounter

source: Automounter map name attribute
it: Attributo nome mappa automounter
pt: Atributo de nome de mapa do automounter

source: Object class for automounter map entries
it: Classe oggetto per le voci della mappa automounter
pt: Classe de objeto para entradas de mapa do automounter

source: Automounter map entry key attribute
it: Attributo chiave voce mappa automounter
pt: Atributo chave de entrada de mapa do automounter

source: Automounter map entry value attribute
it: Attributo valore voce mappa automounter
pt: Atributo valor de entrada de mapa do automounter

source: Base DN for automounter map lookups
it: DN base per le ricerche della mappa automounter
pt: DN base para pesquisas de mapa de automounter

source: The name of the automount master map in LDAP.
it: Il nome della mappa master automount in LDAP.
pt: O nome do mapa mestre automount no LDAP.

source: Base DN for IP hosts lookups
it: DN base per le ricerche degli host IP
pt: DN base para pesquisas de máquinas IP

source: Object class for IP hosts
it: Classe oggetto per gli host IP
pt: Classe de objeto para máquinas IP

source: IP host name attribute
it: Attributo nome host IP
pt: Atributo do nome da máquina IP

source: IP host number (address) attribute
it: Attributo numero (indirizzo) host IP
pt: Atributo número (endereço) de máquina IP

source: IP host entryUSN attribute
it: Attributo entryUSN host IP
pt: Atributo entryUSN de máquina IP

source: Base DN for IP networks lookups
it: DN base per le ricerche delle reti IP
pt: DN base para pesquisas de redes IP

source: Object class for IP networks
it: Classe oggetto per le reti IP
pt: Classe objeto para redes IP

source: IP network name attribute
it: Attributo nome rete IP
pt: Atributo nome de rede IP

source: IP network number (address) attribute
it: Attributo numero (indirizzo) rete IP
pt: Atributo número (endereço) de rede IP

source: IP network entryUSN attribute
it: Attributo entryUSN rete IP
pt: Atributo entryUSN de rede IP

source: Comma separated list of allowed users
it: Lista separata da virgola degli utenti abilitati
pt: Lista de utilizadores autorizados separados por vírgulas

source: Comma separated list of prohibited users
it: Lista separata da virgola degli utenti non abilitati
pt: Lista de utilizadores proibidos separados por vírgulas

source: Comma separated list of groups that are allowed to log in. This applies only to groups within this SSSD domain. Local groups are not evaluated.
it: Elenco separato da virgole di gruppi autorizzati ad accedere. Questo si applica solo ai gruppi all'interno di questo dominio SSSD. I gruppi locali non vengono valutati.
pt: Lista de grupos separados por vírgulas que têm permissão de login. Isto aplica-se apenas a grupos dentro do domínio SSSD. Os grupos locais não são avaliados.

source: Comma separated list of groups that are explicitly denied access. This applies only to groups within this SSSD domain. Local groups are not evaluated.
it: Elenco separato da virgole di gruppi a cui è esplicitamente negato l'accesso. Questo si applica solo ai gruppi all'interno di questo dominio SSSD. I gruppi locali non vengono valutati.
pt: Lista de grupos separados por vírgulas que têm negação explícita de login. Isto aplica-se apenas a grupos dentro do domínio SSSD. Os grupos locais não são avaliados.

source: The number of preforked proxy children.
it: Il numero di figli proxy preforked.
pt: O número de filhos de proxy pré-forcados.

source: The name of the NSS library to use
it: Il nome della libreria NSS da usare
pt: O nome da biblioteca NSS a utilizar

source: The name of the NSS library to use for hosts and networks lookups
it: Il nome della libreria NSS da utilizzare per le ricerche di host e reti
pt: O nome a biblioteca NSS a usar para procuras por máquinas e redes

source: Whether to look up canonical group name from cache if possible
it: Se cercare il nome canonico del gruppo dalla cache, se possibile
pt: Se deve-se procurar nome de grupo canônico da cache se possível

source: PAM stack to use
it: Stack PAM da usare
pt: Pilha PAM a utilizar

source: Path of passwd file sources.
it: Percorso delle sorgenti del file passwd.
pt: Caminho de fontes do ficheiro passwd.

source: Path of group file sources.
it: Percorso delle sorgenti del file group.
pt: Caminho de fontes do ficheiro group.

source: Become a daemon (default)
it: Esegui come demone (default)
pt: Tornar-se num daemon (predefinição)

source: Run interactive (not a daemon)
it: Esegui interattivamente (non come demone)
pt: Correr em interactivo (não como daemon)

source: Print version number and exit
it: Stampa il numero di versione ed esci
pt: Escreve o número da versão e termina

source: Invalid option %s: %s
it: Opzione non valida %s: %s
pt: Opção inválida %s: %s

source: Option -i|--interactive is not allowed together with -D|--daemon
it: L'opzione -i|--interactive non è consentita insieme a -D|--daemon
pt: A opção -i|--interactive não é permitida juntamente com -D|--daemon

source: Failed to get initial capabilities
it: Impossibile ottenere le capability iniziali
pt: Falhou ao obter capacidades iniciais

source: Non-root service user support isn't built. Can't run under %
it: Il supporto per utente di servizio non root non è compilato. Impossibile eseguire come %
pt: O suporte a utilizador de serviço não-root não está compilado. Não pode correr sob %

source: Can't read config: '%s'
it: Impossibile leggere la configurazione: '%s'
pt: Incapaz de ler configuração: '%s'

source: Failed to boostrap SSSD 'monitor' process: %s
it: Fallito il bootstrap del processo 'monitor' di SSSD: %s
pt: Falhou ao impulsionar o processo 'monitor' do SSSD: %s

source: Out of memory
it: Memoria esaurita
pt: Memória esgotada

source: Ignored, /proc/sys/fs/suid_dumpable setting is in force
pt: Ignorado, a definição /proc/sys/fs/suid_dumpable setting está em forçar

source: Enable debug backtrace
pt: Ativar o retrocesso de depuração

source: An open file descriptor for the debug logs
it: Un descrittore di file aperto per l'output di debug
pt: Um descritor de ficheiro aberto para os registos de depuração

source: Use anonymous PKINIT to request FAST armor ticket
it: Utilizza PKINIT anonimo per richiedere il ticket armatura FAST
pt: Usa PKINIT anônimo para requisitar bilhete armadura FAST

source: Kerberos realm to use
it: Realm Kerberos da utilizzare
pt: Reino Kerberos a usar

source: Requested lifetime of the ticket
it: Durata richiesta del ticket
pt: Tempo de vida requisitado do bilhete

source: Requested renewable lifetime of the ticket
it: Durata rinnovabile richiesta del ticket
pt: Tempo de vida renovável requisitado do bilhete

source: FAST options ('never', 'try', 'demand')
it: Opzioni FAST ('never', 'try', 'demand')
pt: Opções FAST ('never', 'try', 'demand')

source: Specifies the server principal to use for FAST
it: Specifica il principal del server da utilizzare per FAST
pt: Especifica o principal do servidor a usar para FAST

source: Requests canonicalization of the principal name
it: Richiede la canonicalizzazione del nome del principal
pt: Requisita canonização do nome do principal

source: Use custom version of krb5_get_init_creds_password
it: Usa versione personalizzata di krb5_get_init_creds_password
pt: Usa versão personalizada do krb5_get_init_creds_password

source: Tevent chain ID used for logging purposes
it: ID catena Tevent utilizzato per scopi di logging
pt: ID de cadeia de eventos usado para objetivos de registo

source: Check PAC flags
it: Controlla flag PAC
pt: Verifica bandeiras PAC

source: talloc_asprintf failed.
it: talloc_asprintf fallito.
pt: falhou talloc_asprintf.

source: set_debug_file_from_fd failed.
it: set_debug_file_from_fd fallito.
pt: falhou set_debug_file_from_fd.

source: Domain of the information provider (mandatory)
it: Dominio del provider di informazioni (obbligatorio)
pt: Domínio do provedor de informação (obrigatório)

source: Socket has wrong ownership or permissions.
it: Il socket ha proprietario o permessi non validi.
pt: Socket tem posse ou permissões erradas.

source: Unexpected format of the server credential message.
it: Formato inatteso del messaggio di credenziali del server.
pt: Formato inesperado da mensagem de credenciais do servidor.

source: SSSD is not run by trusted user.
it: SSSD non è eseguito da un utente fidato.
pt: O SSSD não está correr por utilizador de confiança.

source: SSSD socket does not exist.
it: Il socket SSSD non esiste.
pt: O socket SSSD não existe.

source: Cannot get stat of SSSD socket.
it: Impossibile ottenere lo stat del socket SSSD.
pt: Incapaz de obter estatuto do socket SSSD.

source: An error occurred, but no description can be found.
it: Si è verificato un errore, ma non è possibile trovare alcuna descrizione.
pt: Ocorreu um erro, mas nenhuma descrição foi encontrada.

source: Unexpected error while looking for an error description
it: Errore inatteso durante la ricerca di una descrizione dell'errore
pt: Erro inesperado ao procurar por uma descrição de erro

source: Permission denied.
it: Permesso negato.
pt: Permissão negada.

source: Server message:
it: Messaggio del server:
pt: Mensagem do Servidor:

source: Kerberos TGT will not be granted upon login, user experience will be affected.
it: Il TGT Kerberos non verrà concesso al login, l'esperienza utente ne risentirà.
pt: TGT de Kerberos não será concedido após login, a experiência do utilizador será afetada.

source: Enter PIN:
it: Inserire PIN:
pt: Insira PIN:

source: Passwords do not match
it: Le password non coincidono
pt: Palavras passe não coincidem

source: Password reset by root is not supported.
it: Il reset della password da parte di root non è supportato.
pt: Não é suportado reiniciar a palavra passe pelo root.

source: Authenticated with cached credentials
it: Autenticato con le credenziali nella cache
pt: Autenticado com credenciais em cache

source: , your cached password will expire at:
it: , la password in cache scadrà il:
pt: , a sua palavra passe guardada em cache irá expirar em:

source: Your password has expired. You have %1$d grace login(s) remaining.
it: La tua password è scaduta. Hai %1$d login di cortesia rimanenti.
pt: A sua palavra passe expirou. Você tem %1$d login(s) de graça restantes.

source: Your password will expire in %1$d %2$s.
it: La tua password scadrà tra %1$d %2$s.
pt: A sua palavra irá expirar em %1$d %2$s.

source: Your password has expired.
it: La tua password è scaduta.
pt: A sua palavra passe expirou.

source: Authentication is denied until:
it: L'autenticazione verrà negata fino al:
pt: A autenticação é negada até:

source: System is offline, password change not possible
it: Il sistema è offline, non è possibile richiedere un cambio password
pt: O sistema está offline, a mudança de palavra passe não é possível

source: After changing the OTP password, you need to log out and back in order to acquire a ticket
it: Dopo aver cambiato la password OTP, è necessario disconnettersi e riconnettersi per acquisire un ticket
pt: Após mudar a palavra passe OTP, você precisa de terminar sessão e regressar de modo a adquirir um bilhete

source: PIN locked
it: PIN bloccato
pt: PIN trancado

source: No Kerberos TGT granted as the server does not support this method. Your single-sign on(SSO) experience will be affected.
it: Nessun TGT Kerberos concesso poiché il server non supporta questo metodo. La tua esperienza di single-sign on (SSO) ne risentirà.
pt: Nenhum TGT de Kerberos concedido pois o servidor não suporta este método. A sua experiência de única-assinatura on (SSO) irá ser afetada.

source: Password change failed.
it: Cambio password fallito.
pt: Alteração da palavra passe falhou.

source: Authenticate at %1$s and press ENTER.
it: Autenticati su %1$s e premi INVIO.
pt: Autentique em %1$s e pressione ENTER.

source: Authenticate with PIN %1$s at %2$s and press ENTER.
it: Autenticati con il PIN %1$s su %2$s e premi INVIO.
pt: Autentique com PIN %1$s em %2$s e pressione ENTER.

source: Please (re)insert (different) Smartcard
it: Per favore (re)inserisci (un'altra) Smartcard
pt: Por favor (re)insira Smartcard (diferente)

source: New Password:
it: Nuova password:
pt: Nova Palavra Passe:

source: Reenter new Password:
it: Conferma nuova password:
pt: Re-insira a nova Palavra Passe:

source: First Factor:
it: Primo Fattore:
pt: Primeiro Factor:

source: Second Factor (optional):
it: Secondo Fattore (opzionale):
pt: Segundo Factor (opcional):

source: Second Factor:
it: Secondo Fattore:
pt: Segundo Factor:

source: Insert your passkey device, then press ENTER.
it: Inserisci il tuo dispositivo passkey, quindi premi INVIO.
pt: Insira o seu dispositivo passkey, depois pressione ENTER.

source: Password:
pt: Palavra Passe:

source: First Factor (Current Password):
it: Primo Fattore (Password attuale):
pt: Primeiro Factor (Palavra Passe Atual):

source: Current Password:
it: Password corrente:
pt: Palavra Passe Actual:

source: Password expired. Change your password now.
it: Password scaduta. Cambiare la password ora.
pt: A palavra passe expirou. Altere a sua palavra passe agora.

source: The debug level to run with
it: Il livello di debug da utilizzare
pt: O nível de depuração a utilizar durante a execução

source: The SSSD domain to use
it: Il dominio SSSD da utilizzare
pt: O domínio SSSD a usar

source: Error setting the locale
it: Errore di impostazione del locale
pt: Erro ao definir a configuração regional

source: Not enough memory
it: Memoria insufficiente
pt: Não há memória suficiente

source: User not specified
it: Utente non specificato
pt: Utilizador não especificado

source: Error looking up public keys
it: Errore nella ricerca delle chiavi pubbliche
pt: Erro ao procurar chaves públicas

source: ****************************************************************************** Your system is configured to use the obsolete tool sss_ssh_knownhostsproxy. Please read the sss_ssh_knownhosts(1) man page to learn about its replacement. ******************************************************************************
it: ****************************************************************************** Il tuo sistema è configurato per usare lo strumento obsoleto sss_ssh_knownhostsproxy. Per favore leggi la pagina man sss_ssh_knownhosts(1) per informazioni sulla sua sostituzione. ******************************************************************************
pt: ****************************************************************************** O sei sistema está configurado para usar a ferramente obsoleta sss_ssh_knownhostsproxy. Por favor leia o manual do sss_ssh_knownhosts(1) para saber sobre a sua substituição. ******************************************************************************

source: No cache object matched the specified search
it: Nessun oggetto della cache corrisponde alla ricerca specificata
pt: Nenhum objeto em cache corresponde à busca especificada

source: Couldn't invalidate %1$s
it: Impossibile invalidare %1$s
pt: Incapaz de invalidar %1$s

source: Couldn't invalidate %1$s %2$s
it: Impossibile invalidare %1$s %2$s
pt: Incapaz de invalidar %1$s %2$s

source: Can't find configuration db, was SSSD configured and run?
it: Impossibile trovare il db di configurazione, SSSD è stato configurato ed eseguito?
pt: Incapaz de encontrar a base de dados de configuração, o SSSD foi configurado e corre?

source: Invalidate all cached entries
it: Invalida tutte le voci nella cache
pt: Invalidar todas as entradas em cache

source: Invalidate particular user
it: Invalida utente specifico
pt: Invalidar utilizador particular

source: Invalidate all users
it: Invalida tutti gli utenti
pt: Invalidar todos os utilizadores

source: Invalidate particular group
it: Invalida gruppo specifico
pt: Invalidar grupo particular

source: Invalidate all groups
it: Invalida tutti i gruppi
pt: Invalidar todos os grupos

source: Invalidate particular netgroup
it: Invalida netgroup specifico
pt: Invalidar netgroup particular

source: Invalidate all netgroups
it: Invalida tutti i netgroup
pt: Invalidar todos os netgroups

source: Invalidate particular service
it: Invalida servizio specifico
pt: Invalidar serviço particular

source: Invalidate all services
it: Invalida tutti i servizi
pt: Invalidar todos os serviços

source: Invalidate particular autofs map
it: Invalida mappa autofs specifica
pt: Invalidar mapa autofs particular

source: Invalidate all autofs maps
it: Invalida tutte le mappe autofs
pt: Invalidar todos os mapas autofs

source: Invalidate particular SSH host
it: Invalida host SSH specifico
pt: Invalidar máquina SSH particular

source: Invalidate all SSH hosts
it: Invalida tutti gli host SSH
pt: Invalidar todas as máquinas SSH

source: Invalidate particular sudo rule
it: Invalida regola sudo specifica
pt: Invalidar regra sudo particular

source: Invalidate all cached sudo rules
it: Invalida tutte le regole sudo nella cache
pt: Invalidar todas as regras sudo em cache

source: Only invalidate entries from a particular domain
it: Invalida solo le voci da un dominio specifico
pt: Apenas invalida entradas de um domínio particular

source: Unexpected argument(s) provided, options that invalidate a single object only accept a single provided argument.
it: Argomento/i inatteso/i fornito/i, le opzioni che invalidano un singolo oggetto accettano solo un singolo argomento fornito.
pt: Argumento(s) inesperado fornecido, as opções que invalidam um único objeto apenas aceitam um único argumento fornecido.

source: Please select at least one object to invalidate
it: Per favore seleziona almeno un oggetto da invalidare
pt: Por favor selecione pelo menos um objeto para invalidar

source: Could not open domain %1$s. If the domain is a subdomain (trusted domain), use fully qualified name instead of --domain/-d parameter.
it: Impossibile aprire il dominio %1$s. Se il dominio è un sottodominio (dominio attendibile), usa il nome completo invece del parametro --domain/-d.
pt: Incapaz de abrir domínio %1$s. Se o domínio é um sub-domínio (domínio de confiança), use o nome totalmente qualificado em vez do parâmetro --domain/-d.

source: Could not open available domains
it: Impossibile aprire i domini disponibili
pt: Incapaz de abrir os domínios disponíveis

source: %1$s must be run as root
it: %1$s deve essere eseguito come root
pt: %1$s tem de correr como root

source: yes
it: sì
pt: sim

source: no
pt: não

source: error
it: errore
pt: erro

source: Invalid result.
it: Risultato non valido.
pt: Resultado inválido.

source: Unable to read user input
it: Impossibile leggere l'input utente
pt: Incapaz de ler entrada do utilizador

source: Invalid input, please provide either '%s' or '%s'.
it: Input non valido, per favore fornisci '%s' o '%s'.
pt: Entrada inválida, por favor forneça um de '%s' ou '%s'.

source: Error while executing external command
it: Errore durante l'esecuzione del comando esterno
pt: Erro ao executar comando externo

source: Error while executing external command '%s'
it: Errore durante l'esecuzione del comando esterno '%s'
pt: Erro ao executar comando externo '%s'

source: Command '%s' failed with [%d]
it: Il comando '%s' è fallito con [%d]
pt: Comando '%s' falhou com [%d]

source: SSSD needs to be running. Start SSSD now?
it: SSSD deve essere in esecuzione. Avviare SSSD ora?
pt: O SSSD precisa de estar a correr. Arrancar o SSSD agora?

source: SSSD must not be running. Stop SSSD now?
it: SSSD non deve essere in esecuzione. Fermare SSSD ora?
pt: O SSSD não pode estar a correr. Parar o SSSD agora?

source: SSSD needs to be restarted. Restart SSSD now?
it: SSSD deve essere riavviato. Riavviare SSSD ora?
pt: O SSSD precisa de ser reiniciado. Reiniciar o SSSD agora?

source: SSSD Status:
it: Stato SSSD:
pt: Estado do SSSD:

source: List available domains
it: Elenca domini disponibili
pt: Lista domínios disponíveis

source: Print information about domain
it: Stampa informazioni sul dominio
pt: Escreve informação acerca de domínio

source: Print information about a user and check authentication
it: Stampa informazioni su un utente e verifica l'autenticazione
pt: Escreve informação acerca dum utilizador e verifica autenticação

source: Generate access report for a domain
it: Genera report di accesso per un dominio
pt: Gera relatório de acesso para um domínio

source: Information about cached content:
it: Informazioni sul contenuto nella cache:
pt: Informação acerca de conteúdo em cache:

source: Information about cached user
it: Informazioni sull'utente nella cache
pt: Informação acerca do utilizador em cache

source: Information about cached group
it: Informazioni sul gruppo nella cache
pt: Informação acerca de grupo em cache

source: Information about cached netgroup
it: Informazioni sul netgroup nella cache
pt: Informação acerca de netgroup em cache

source: Local data tools:
it: Strumenti dati locali:
pt: Ferramentas de dados locais:

source: Backup local data
it: Backup dati locali
pt: Salvaguardar dados locais

source: Restore local data from backup
it: Ripristina dati locali dal backup
pt: Restaurar dados locais a partir de salvaguarda

source: Backup local data and remove cached content
it: Backup dati locali e rimozione contenuto cache
pt: Salvaguardar dados locais e remover conteúdo em cache

source: Invalidate cached objects
it: Invalida oggetti nella cache
pt: Invalidar objetos em cache

source: Manage cache indexes
it: Gestisci indici cache
pt: Gerir índices em cache

source: Log files tools:
it: Strumenti file di log:
pt: Ferramentas de ficheiros de relatório (log):

source: Remove existing SSSD log files
it: Rimuovi file di log SSSD esistenti
pt: Remover ficheiros log do SSSD existentes

source: Archive SSSD log files in tarball
it: Archivia file di log SSSD in tarball
pt: Arquivar ficheiros log do SSSD em ficheiro compactado (tarball)

source: Change or print information about SSSD debug level
it: Cambia o stampa informazioni sul livello di debug SSSD
pt: Muda ou escreve informação acerca do nível de depuração do SSSD
