Repository: SSSD/sssd
Catalog: po/*.po
Languages: it, pt

source: Cache credentials for offline login
it: Salvare in cache le credenziali per login offline
pt: Usar cache de credenciais para inicio de sessões em modo desligado

source: Display users/groups in fully-qualified form
it: Mostrare utenti/gruppi in formato fully-qualified
pt: Apresentar utilizadores/grupos no formato totalmente qualificado

source: Don't include group members in group lookups
it: Non includere i membri del gruppo nelle ricerche di gruppo
pt: Não inclui membros de grupo em pesquisas de grupo

source: Entry cache timeout length (seconds)
it: Durata timeout elementi in cache (secondi)
pt: Tempo limite da entrada de cache (segundos)

source: Restrict or prefer a specific address family when performing DNS lookups
it: Restringere o preferire una specifica famiglia di indirizzi per l'esecuzione di lookup DNS
pt: Restringir ou preferir uma família de endereços específicos quando efectua consultas DNS

source: How long to keep cached entries after last successful login (days)
it: Per quanto tempo tenere in cache gli elementi dopo un login che ha avuto successo (giorni)
pt: Durante quanto tempo manter as entradas em cache após o último login bem sucedido (dias)

source: How long should SSSD talk to single DNS server before trying next server (miliseconds)
it: Per quanto tempo SSSD dovrebbe comunicare con un singolo server DNS prima di provare il server successivo (millisecondi)
pt: Durante quanto tempo deve o SSSD falar com um único servidor DNS antes de tentar o próximo servidor (milisegundos)

source: How long should keep trying to resolve single DNS query (seconds)
it: Per quanto tempo continuare a provare a risolvere una singola query DNS (secondi)
pt: Durante quanto tempo deve-se continuar a tentar resolver consultas DNS únicas (segundos)

source: How long to wait for replies from DNS when resolving servers (seconds)
it: Il tempo di attesa per le richieste DNS (secondi)
pt: Durante quanto tempo esperar por respostas DNS quando se resolve servidores (segundos)

source: The domain part of service discovery DNS query
it: La parte del dominio della query DNS di individuazione del servizio
pt: A parte domínio da consulta DNS de descoberta de serviço

source: Specifies the interval, in seconds, that SSSD waits before attempting to reconnect to the primary server after a successful connection to the backup server
it: Specifica l'intervallo, in secondi, che SSSD attende prima di tentare di riconnettersi al server primario dopo una connessione riuscita al server di backup
pt: Especifica o intervalo, em segundos, que o SSSD espera antes de tentar re-ligar ao servidor principal após uma ligação com sucesso ao servidor de salvaguarda

source: Override GID value from the identity provider with this value
it: Sovrascrive il valore GID dal provider di identità con questo valore
pt: Sobrepõe o valor GID do provedor de identidade com este valor

source: Treat usernames as case sensitive
it: Tratta i nomi utente come sensibili alle maiuscole/minuscole
pt: Trata nomes de utilizador como sensível a maiúsculas/minúsculas

source: How often should expired entries be refreshed in background
it: Ogni quanto tempo le voci scadute devono essere aggiornate in background
pt: Com que frequência devem as entradas expiradas serem refrescadas nos bastidores

source: Maximum period deviation when refreshing expired entries in background
it: Deviazione massima del periodo durante l'aggiornamento in background delle voci scadute
pt: Período máximo de desvio quando se refresca entradas expiradas nos bastidores

source: Whether to automatically update the client's DNS entry
it: Se aggiornare automaticamente la voce DNS del client
pt: Se deve-se atualizar automaticamente a entrada DNS do cliente

source: Whether DNS update of A and AAAA record should be performed in one update or in two separate updates
pt: Se a atualização DNS de um registo A e AAAA deve ser feita numa atualização ou em duas atualizações separadas

source: The TTL to apply to the client's DNS entry after updating it
it: Il TTL da applicare alla voce DNS del client dopo averla aggiornata
pt: O TTL a aplicar à entrada DNS do cliente após a atualizar

source: The interface whose IP should be used for dynamic DNS updates
it: L'interfaccia il cui indirizzo IP dovrebbe essere usato per aggiornamenti DNS dinamici.
pt: A interface cujo IP deve ser usado para atualizações DNS dinâmicas

source: How often to periodically update the client's DNS entry
it: Ogni quanto tempo aggiornare periodicamente la voce DNS del client
pt: Com que frequência se deve atualizar a entrada DNS d cliente

source: Maximum period deviation when updating the client's DNS entry
it: Deviazione massima del periodo durante l'aggiornamento della voce DNS del client
pt: Período máximo de desvio quando se atualiza a entrada DNS do cliente

source: Whether the provider should explicitly update the PTR record as well
it: Se il provider debba aggiornare esplicitamente anche il record PTR
pt: Se o provedor deve explicitamente atualizar também o registo PTR

source: Whether the nsupdate utility should default to using TCP
it: Se l'utilità nsupdate debba utilizzare TCP per impostazione predefinita
pt: Se o utilitário nsupdate deve predefinir para usar TCP

source: What kind of authentication should be used to perform the DNS update
it: Quale tipo di autenticazione deve essere utilizzata per eseguire l'aggiornamento DNS
pt: Que tipo de autenticação deve ser usado para efetuar a atualização DNS

source: Override the DNS server used to perform the DNS update
it: Sovrascrive il server DNS utilizzato per eseguire l'aggiornamento DNS
pt: Sobrepõe o servidor DNS usado para efetuar a atualização DNS

source: The file of the certificate authorities certificates for DoT
pt: O ficheiro do certificado de certificados de autoridades para DoT

source: The certificate(s) file for authentication for the DoT transport
pt: O ficheiro de certificado(s) para autenticação para o transporte DoT

source: The key file for authenticated encryption for the DoT transport
pt: O ficheiro chave para encriptação autenticada para o transporte DoT

source: Control enumeration of trusted domains
it: Controlla l'enumerazione dei domini attendibili
pt: Controla a enumeração de domínios de confiança

source: How often should subdomains list be refreshed
it: Ogni quanto tempo l'elenco dei sottodomini deve essere aggiornato
pt: Com que frequência deve a lista de sub-domínios ser refrescada

source: Maximum period deviation when refreshing the subdomain list
it: Deviazione massima del periodo durante l'aggiornamento dell'elenco dei sottodomini
pt: Período máximo de desvio quando se refresca a lista e sub-domínios

source: List of options that should be inherited into a subdomain
it: Elenco di opzioni che dovrebbero essere ereditate in un sottodominio
pt: Lista de opções que devem ser herdadas num sub-domínio

source: Default subdomain homedir value
it: Valore predefinito homedir del sottodominio
pt: Valor homedir predefinido de sub-domínio

source: How long can cached credentials be used for cached authentication
it: Per quanto tempo le credenziali nella cache possono essere utilizzate per l'autenticazione dalla cache
pt: Durante quanto tempo podem as credenciais em cache ser usadas para autenticação em cache

source: Whether to automatically create private groups for users
it: Se creare automaticamente gruppi privati per gli utenti
pt: Se deve-se criar automaticamente grupos privados para utilizadores

source: Display a warning N days before the password expires.
it: Mostra un avviso N giorni prima della scadenza della password.
pt: Mostra um aviso N dias antes da palavra passe expirar.

source: Various tags stored by the realmd configuration service for this domain.
it: Vari tag memorizzati dal servizio di configurazione realmd per questo dominio.
pt: Várias etiquetas armazenadas pelo serviço de configuração realmd para este domínio.

source: The provider which should handle fetching of subdomains. This value should be always the same as id_provider.
it: Il provider che dovrebbe gestire il recupero dei sottodomini. Questo valore dovrebbe essere sempre lo stesso di id_provider.
pt: O provedor que deve lidar com a obtenção de sub-domínios. Este valor deve ser sempre o mesmo que id_provider.

source: How many seconds to keep a host ssh key after refresh. IE how long to cache the host key for.
it: Per quanti secondi mantenere una chiave ssh host dopo l'aggiornamento. Cioè per quanto tempo mettere in cache la chiave host.
pt: Durante quantos segundos manter uma chave ssh de máquina após refrescar. Isto é, durante quanto tempo manter a chave da máquina em cache.

source: If 2-Factor-Authentication (2FA) is used and credentials should be saved this value determines the minimal length the first authentication factor (long term password) must have to be saved as SHA512 hash into the cache.
it: Se viene utilizzata l'autenticazione a 2 fattori (2FA) e le credenziali devono essere salvate, questo valore determina la lunghezza minima che il primo fattore di autenticazione (password a lungo termine) deve avere per essere salvato come hash SHA512 nella cache.
pt: Se for usado 2-Factor-Authentication (2FA) e as credenciais devem ser guardadas este valor determina o comprimento mínimo do primeiro factor de autenticação (palavra passe de longo termo) tem de ser guardado como cinza SHA512 na cache.

source: Local authentication methods policy
it: Politica dei metodi di autenticazione locali
pt: Política de métodos de autenticação local

source: IPA domain
it: Dominio IPA
pt: Domínio IPA

source: IPA server address
it: Indirizzo del server IPA
pt: Endereço do servidor IPA

source: Address of backup IPA server
it: Indirizzo del server IPA di backup
pt: Endereço do servidor IPA de salvaguarda

source: IPA client hostname
it: Hostname del client IPA
pt: Nome da máquina do cliente IPA

source: Whether to automatically update the client's DNS entry in FreeIPA
it: Se aggiornare automaticamente la voce DNS del client in FreeIPA
pt: Se deve-se atualizar automaticamente a entrada DNS do cliente em FreeIPA

source: Search base for HBAC related objects
it: Base di ricerca per oggetti relativi a HBAC
pt: Base de busca para objetos relacionados com HBAC

source: The amount of time between lookups of the HBAC rules against the IPA server
it: L'intervallo di tempo tra le ricerche delle regole HBAC sul server IPA
pt: A quantidade de tempo entre procuras das regras HBAC contra o servidor IPA

source: The amount of time in seconds between lookups of the SELinux maps against the IPA server
it: L'intervallo di tempo in secondi tra le ricerche delle mappe SELinux sul server IPA
pt: A quantidade de tempo em segundos entre procuras dos mapas SELinux contra o servidor IPA

source: If set to false, host argument given by PAM will be ignored
it: Se impostato su false, l'argomento host fornito da PAM verrà ignorato
pt: Se definido para false, o argumento host dado pelo PAM será ignorado

source: The automounter location this IPA client is using
it: La posizione dell'automounter utilizzata da questo client IPA
pt: A localização de automounter que este cliente IPA está a usar

source: Search base for object containing info about IPA domain
it: Base di ricerca per l'oggetto contenente informazioni sul dominio IPA
pt: Base de busca para objeto que contém informação acerca de domínio IPA

source: Search base for objects containing info about ID ranges
it: Base di ricerca per oggetti contenenti informazioni sugli intervalli ID
pt: Base de busca para objetos que contêm informação acerca de gamas ID

source: Enable DNS sites - location based service discovery
it: Abilita siti DNS - individuazione del servizio basata sulla posizione
pt: Activa sítios DNS - descoberta de serviços baseada em localização

source: Search base for view containers
it: Base di ricerca per i contenitori delle viste
pt: Base de busca para contentores de visualização

source: Objectclass for view containers
it: Objectclass per i contenitori delle viste
pt: Classe de objeto para contentores de visualização

source: Attribute with the name of the view
it: Attributo con il nome della vista
pt: Atributo com nome da visualização

source: Objectclass for override objects
it: Objectclass per gli oggetti di override
pt: Classe de objeto para objetos de sobreposição

source: Attribute with the reference to the original object
it: Attributo con il riferimento all'oggetto originale
pt: Atributo com a referência para o objeto original

source: Objectclass for user override objects
it: Objectclass per gli oggetti di override utente
pt: Classe de objeto para objetos de sobreposição do utilizador

source: Objectclass for group override objects
it: Objectclass per gli oggetti di override gruppo
pt: Classe de objeto para objetos de sobreposição do grupo

source: Search base for Desktop Profile related objects
it: Base di ricerca per oggetti relativi al Profilo Desktop
pt: Base de busca para objetos relacionados com Desktop Profile

source: The amount of time in seconds between lookups of the Desktop Profile rules against the IPA server
it: L'intervallo di tempo in secondi tra le ricerche delle regole del Profilo Desktop sul server IPA
pt: A quantidade de tempo em segundos entre procuras de regras Desktop Profile contra o servidor IPA

source: The amount of time in minutes between lookups of Desktop Profiles rules against the IPA server when the last request did not find any rule
it: L'intervallo di tempo in minuti tra le ricerche delle regole dei Profili Desktop sul server IPA quando l'ultima richiesta non ha trovato alcuna regola
pt: A quantidade de tempo em minutos entre procuras de regras Desktop Profile contra o servidor IPA quando o último pedido não encontrou nenhuma regra

source: Search base for SUBID ranges
it: Base di ricerca per intervalli SUBID
pt: Base de busca para gamas SUBID

source: Which rules should be used to evaluate access control
it: Quali regole dovrebbero essere usate per valutare il controllo degli accessi
pt: Quais regras devem ser usadas para avaliar o controle de acesso

source: The LDAP attribute that contains FQDN of the host.
it: L'attributo LDAP che contiene l'FQDN dell'host.
pt: O atributo LDAP que contém o FQDN da máquina.

source: The object class of a host entry in LDAP.
it: La classe oggetto di una voce host in LDAP.
pt: A classe de objecto de uma entrada de máquina em LDAP.

source: Use the given string as search base for host objects.
it: Usa la stringa fornita come base di ricerca per gli oggetti host.
pt: Usa a string dada como base de busca para objetos máquina.

source: The LDAP attribute that contains the host's SSH public keys.
it: L'attributo LDAP che contiene le chiavi pubbliche SSH dell'host.
pt: O atributo LDAP que contém as chaves públicas SSH da máquina.

source: The LDAP attribute that contains NIS domain name of the netgroup.
it: L'attributo LDAP che contiene il nome di dominio NIS del netgroup.
pt: O atributo LDAP que contém o nome de domínio NIS do netgroup.

source: The LDAP attribute that contains the names of the netgroup's members.
it: L'attributo LDAP che contiene i nomi dei membri del netgroup.
pt: O atributo do LDAP que contém os nomes dos membros do netgroup.

source: The LDAP attribute that lists FQDNs of hosts and host groups that are members of the netgroup.
it: L'attributo LDAP che elenca gli FQDN degli host e dei gruppi di host che sono membri del netgroup.
pt: O atributo LDAP que lista FQDNs de máquinas e grupos e máquinas que são membros do netgroup.

source: The LDAP attribute that lists hosts and host groups that are direct members of the netgroup.
it: L'attributo LDAP che elenca gli host e i gruppi di host che sono membri diretti del netgroup.
pt: O atributo LDAP que lista máquinas e grupos de máquinas que são membros diretos do netgroup.

source: The LDAP attribute that lists netgroup's memberships.
it: L'attributo LDAP che elenca le appartenenze del netgroup.
pt: O atributo LDAP que lista os membros do netgroup.

source: The LDAP attribute that lists system users and groups that are direct members of the netgroup.
it: L'attributo LDAP che elenca gli utenti e i gruppi di sistema che sono membri diretti del netgroup.
pt: O atributo LDAP que lista utilizadores e grupos do sistema que são membros diretos do netgroup.

source: The LDAP attribute that corresponds to the netgroup name.
it: L'attributo LDAP che corrisponde al nome del netgroup.
pt: O atributo LDAP que corresponde ao nome netgroup.

source: The object class of a netgroup entry in LDAP.
it: La classe oggetto di una voce netgroup in LDAP.
pt: A classe de objecto de uma entrada netgroup em LDAP.

source: The LDAP attribute that contains the UUID/GUID of an LDAP netgroup object.
it: L'attributo LDAP che contiene l'UUID/GUID di un oggetto netgroup LDAP.
pt: O atributo LDAP que contém o UUID/GUID de um objeto de netgroup LDAP.

source: The LDAP attribute that contains whether or not is user map enabled for usage.
it: L'attributo LDAP che indica se la mappa utente è abilitata per l'uso.
pt: O atributo LDAP que contém se o mapa de utilizador está ativo ou não para utilização.

source: The LDAP attribute that contains host category such as 'all'.
it: L'attributo LDAP che contiene la categoria host come 'all'.
pt: O atributo LDAP que contém a categoria da máquina tal como 'all'.

source: The LDAP attribute that contains all hosts / hostgroups this rule match against.
it: L'attributo LDAP che contiene tutti gli host / gruppi di host a cui questa regola corrisponde.
pt: O atributo LDAP que contém todas as máquinas / grupos de máquinas com que esta regra corresponde.

source: The LDAP attribute that contains all users / groups this rule match against.
it: L'attributo LDAP che contiene tutti gli utenti / gruppi a cui questa regola corrisponde.
pt: O atributo LDAP que contém todos os utilizadores / grupos que esta regra corresponde.

source: The LDAP attribute that contains the name of SELinux usermap.
it: L'attributo LDAP che contiene il nome della usermap SELinux.
pt: O atributo LDAP que contém o nome do mapa de utilizador SELinux.

source: The LDAP attribute that contains DN of HBAC rule which can be used for matching instead of memberUser and memberHost.
it: L'attributo LDAP che contiene il DN della regola HBAC che può essere utilizzato per la corrispondenza invece di memberUser e memberHost.
pt: O atributo LDAP que contém DN da regra HBAC que pode ser usada para correspondência em vez de memberUser e memberHost.

source: The LDAP attribute that contains SELinux user string itself.
it: L'attributo LDAP che contiene la stringa utente SELinux stessa.
pt: O atributo LDAP que contém a própria string de utilizador SELinux.

source: The LDAP attribute that contains user category such as 'all'.
it: L'attributo LDAP che contiene la categoria utente come 'all'.
pt: O atributo LDAP que contém a categoria de utilizador tal como 'all'.

source: The LDAP attribute that contains unique ID of the user map.
it: L'attributo LDAP che contiene l'ID univoco della mappa utente.
pt: O atributo LDAP que contém o ID único do mapa de utilizador.

source: The option denotes that the SSSD is running on IPA server and should perform lookups of users and groups from trusted domains differently.
it: L'opzione indica che SSSD è in esecuzione sul server IPA e dovrebbe eseguire le ricerche di utenti e gruppi dai domini attendibili in modo diverso.
pt: Esta opção denota que o SSSD está a correr num servidor IPA e deve efetuar procuras de utilizadores e grupos de domínios de confiança de modo diferente.

source: Use the given string as search base for trusted domains.
it: Usa la stringa fornita come base di ricerca per i domini attendibili.
pt: Usa a string dada como base de busca para domínios de confiança.

source: Active Directory domain
it: Dominio Active Directory
pt: Domínio Active Directory

source: Enabled Active Directory domains
it: Domini Active Directory abilitati
pt: Domínios Active Directory ativos

source: Active Directory server address
it: Indirizzo del server Active Directory
pt: Endereço do servidor Active Directory

source: Active Directory backup server address
it: Indirizzo del server di backup Active Directory
pt: Endereço do servidor de salvaguarda Active Directory

source: Active Directory client hostname
it: Nome host del client Active Directory
pt: Nome de máquina cliente do Active Directory

source: LDAP filter to determine access privileges
it: Filtro LDAP per determinare i privilegi di accesso
pt: Filtro LDAP para determinar privilégios de acesso

source: Whether to use the Global Catalog for lookups
it: Se utilizzare il Catalogo Globale per le ricerche
pt: Se deve-se usar o Catálogo Global para procuras

source: Operation mode for GPO-based access control
it: Modalità operativa per il controllo degli accessi basato su GPO
pt: Modo de operação para controlo de acesso baseado em GPO

source: The amount of time between lookups of the GPO policy files against the AD server
it: L'intervallo di tempo tra le ricerche dei file delle policy GPO sul server AD
pt: A quantidade de tempo entre pesquisas dos ficheiros de politica GPO contra o servidor AD

source: PAM service names that map to the GPO (Deny)InteractiveLogonRight policy settings
it: Nomi dei servizi PAM che mappano alle impostazioni della policy GPO (Deny)InteractiveLogonRight
pt: Nomes de serviço PAM que mapeiam as definições de política GPO (Deny)InteractiveLogonRight

source: PAM service names that map to the GPO (Deny)RemoteInteractiveLogonRight policy settings
it: Nomi dei servizi PAM che mappano alle impostazioni della policy GPO (Deny)RemoteInteractiveLogonRight
pt: Nomes de serviço PAM que mapeiam as definições de política GPO (Deny)RemoteInteractiveLogonRight

source: PAM service names that map to the GPO (Deny)NetworkLogonRight policy settings
it: Nomi dei servizi PAM che mappano alle impostazioni della policy GPO (Deny)NetworkLogonRight
pt: Nomes de serviço PAM que mapeiam as definições de política GPO (Deny)NetworkLogonRight

source: PAM service names that map to the GPO (Deny)BatchLogonRight policy settings
it: Nomi dei servizi PAM che mappano alle impostazioni della policy GPO (Deny)BatchLogonRight
pt: Nomes de serviço PAM que mapeiam as definições de política GPO (Deny)BatchLogonRight

source: PAM service names that map to the GPO (Deny)ServiceLogonRight policy settings
it: Nomi dei servizi PAM che mappano alle impostazioni della policy GPO (Deny)ServiceLogonRight
pt: Nomes de serviço PAM que mapeiam as definições de política GPO (Deny)ServiceLogonRight

source: PAM service names for which GPO-based access is always granted
it: Nomi dei servizi PAM per i quali l'accesso basato su GPO è sempre concesso
pt: Nomes de serviço PAM para os quais o acesso baseado em GPO é sempre concedido

source: PAM service names for which GPO-based access is always denied
it: Nomi dei servizi PAM per i quali l'accesso basato su GPO è sempre negato
pt: Nomes de serviço PAM para os quais o acesso baseado em GPO é sempre negado

source: Default logon right (or permit/deny) to use for unmapped PAM service names
it: Diritto di accesso predefinito (o consenti/nega) da utilizzare per i nomi dei servizi PAM non mappati
pt: Direito de logon predefinido (ou permitir/negar) a usar nomes de serviço PAM não mapeados

source: a particular site to be used by the client
it: un sito particolare da utilizzare dal client
pt: um sítio particular a ser usado pelo cliente

source: Maximum age in days before the machine account password should be renewed
it: Età massima in giorni prima che la password dell'account macchina debba essere rinnovata
pt: Idade máxima em dias antes da palavra passe da conta da máquina ter de ser renovada
