Repository: SSSD/sssd
Catalog: po/*.po
Languages: it, pt

source: Set the verbosity of the debug logging
it: Imposta il livello di dettaglio dei messaggi di debug
pt: Definir o detalhe dos relatórios de depuração

source: Include timestamps in debug logs
it: Include marcatura temporale nei messaggi di registro
pt: Incluir data e hora nos relatórios de depuração

source: Include microseconds in timestamps in debug logs
it: Include i microsecondi nella marcatura temporale per il debug
pt: Incluir micro-segundos nos relatórios de depuração

source: Enable/disable debug backtrace
it: Abilita/disabilita il backtrace del debug
pt: Ativa/desativa rastreio de depuração

source: Watchdog timeout before restarting service
it: Timeout di controllo prima di riavviare il servizio
pt: Tempo limite do watchdog antes de reiniciar o serviço

source: Command to start service
it: Comando per avviare il servizio
pt: Comando para iniciar serviço

source: The number of file descriptors that may be opened by this responder
it: Il numero di descrittori file che possono essere aperti da questo responder
pt: O número de descritores de ficheiro que podem ser abetos por este respondedor

source: Idle time before automatic disconnection of a client
it: Tempo di inattività prima della disconnessione automatica di un client
pt: Tempo inactivo antes do desligar automático dum cliente

source: Idle time before automatic shutdown of the responder
it: Tempo di inattività prima della disconnessione automatica di un client
pt: Tempo inactivo antes do encerramento automático do respondedor

source: Always query all the caches before querying the Data Providers
it: Interrogare tutte le cache prima dei provider dati
pt: Consultar sempre todas as caches antes de consultar os Provedores de Dados

source: When SSSD switches to offline mode the amount of time before it tries to go back online will increase based upon the time spent disconnected. This value is in seconds and calculated by the following: offline_timeout + random_offset.
it: Quando SSSD passa alla modalità offline, il tempo prima che tenti di tornare online aumenterà in base al tempo trascorso disconnesso. Questo valore è espresso in secondi ed è calcolato come segue: offline_timeout + random_offset.
pt: Quando o SSSD comuta para modo offline a quantidade de tempo antes de tentar voltar online irá aumentar com base no tempo que passou desligado. Este valor está em segundos e é calculado pelo seguinte: offline_timeout + random_offset.

source: SSSD Services to start
it: Servizi SSSD da avviare
pt: Serviços SSSD a iniciar

source: SSSD Domains to start
it: Domini SSSD da avviare
pt: Domínios SSSD a iniciar

source: Regex to parse username and domain
it: Espressione regolare per leggere nome utente e dominio
pt: Expressão regular para obter nome do utilizador e domínio

source: Printf-compatible format for displaying fully-qualified names
it: Formato compatibile con printf per la visualizzazione di nomi completi
pt: Formato compatível com o printf para mostrar nomes totalmente qualificados

source: Directory on the filesystem where SSSD should store Kerberos replay cache files.
it: Directory dove salvare file di cache delle risposte Kerberos
pt: Directório no sistema de ficheiros onde o SSSD deve armazenar os ficheiros de cache de repetição do Kerberos.

source: Domain to add to names without a domain component.
it: Dominio da aggiungere ai nomi senza una componente di dominio.
pt: Domínio a adicionar aos nomes que não têm um componente de domínio.

source: The user to drop privileges to
it: L'utente a cui abbassare i privilegi
pt: O utilizador a quem retirar privilégios

source: Tune certificate verification
it: Regola il controllo del certificato
pt: Afina verificação de certificado

source: All spaces in group or user names will be replaced with this character
it: Tutti gli spazi nei nomi di gruppo o utente verranno sostituiti con questo carattere
pt: Todos os espaços em nomes de grupo ou utilizador serão substituídos por este caractere

source: Tune sssd to honor or ignore netlink state changes
it: Configura sssd per rispettare o ignorare le modifiche di stato di netlink
pt: Afina o sssd para honrar ou ignorar as alterações do estado da netlink

source: Enable or disable the implicit files domain
it: Abilita o disabilita il dominio implicito dei file
pt: Activa ou desactiva o domínio de ficheiros implícito

source: A specific order of the domains to be looked up
it: Un ordine specifico dei domini da interrogare
pt: Uma ordem especifica dos domínios a serem trancados

source: Controls if SSSD should monitor the state of resolv.conf to identify when it needs to update its internal DNS resolver.
it: Controlla se SSSD debba monitorare lo stato di resolv.conf per identificare quando ha bisogno di aggiornare il suo resolver DNS interno.
pt: Controla se o SSSD deve monitorizar o estado de resolv.conf para identificar quando precisa de atualizar o seu resolver de DNS interno.

source: SSSD monitors the state of resolv.conf to identify when it needs to update its internal DNS resolver. By default, we will attempt to use inotify for this, and will fall back to polling resolv.conf every five seconds if inotify cannot be used.
it: SSSD monitora lo stato di resolv.conf per identificare quando ha bisogno di aggiornare il suo resolver DNS interno. Per impostazione predefinita, tenteremo di usare inotify per questo, e passeremo al polling di resolv.conf ogni cinque secondi se inotify non può essere utilizzato.
pt: O SSSD monitoriza o estado do resolv.conf para identificar quando precisa de atualizar o seu resolvedor DNS interno. Por predefinição, tentamos usar o inotify para isto, e irá voltar a sondar o resolv.conf a cada cinco segundos se o inotify não puder ser usado.

source: Run PAC responder automatically for AD and IPA provider
it: Esegue automaticamente il PAC responder per i provider AD e IPA
pt: Correr respondedor PAC automaticamente para provedor AD ou IPA

source: Enable or disable core dumps for all SSSD processes.
it: Abilita o disabilita i core dump per tutti i processi SSSD.
pt: Activa ou desactiva despejos do núcleo para todos os processos do SSSD.

source: Tune passkey verification behavior
it: Regola il comportamento della verifica della passkey
pt: Afina o comportamento de verificação da passkey

source: Enumeration cache timeout length (seconds)
it: Durata del timeout della cache di enumerazione (secondi)
pt: Validade da cache de enumeração (segundos)

source: Entry cache background update timeout length (seconds)
it: Durata timeout aggiornamento cache in background (secondi)
pt: Validade da atualização da cache em segundo plano (segundos)

source: Negative cache timeout length (seconds)
it: Durata timeout negative cache (secondi)
pt: Tempo limite da cache negativa (segundos)

source: Users that SSSD should explicitly ignore
it: Utenti che SSSD dovrebbe ignorare esplicitamente
pt: Utilizadores que o SSSD deve explicitamente ignorar

source: Groups that SSSD should explicitly ignore
it: Gruppi che SSSD dovrebbe ignorare esplicitamente
pt: Grupos que o SSSD deve explicitamente ignorar

source: Should filtered users appear in groups
it: Indica se mostrare gli utenti filtrati nei gruppi
pt: Devem os utilizadores filtrados aparecer em grupos

source: The value of the password field the NSS provider should return
it: Il valore del campo password che deve essere ritornato dal provider NSS
pt: O valor do campo da palavra passe que o fornecedor NSS deve retornar

source: Override homedir value from the identity provider with this value
it: Sovrascrive il valore homedir dal provider di identità con questo valore
pt: Sobrepõe o valor homedir do provedor de identidade por este valor

source: Substitute empty homedir value from the identity provider with this value
it: Sostituisce il valore homedir vuoto dal provider di identità con questo valore
pt: Substitui o valor vazio do provedor de identidade por este valor

source: Override shell value from the identity provider with this value
it: Sovrascrive il valore della shell dal provider di identità con questo valore
pt: Sobrepõe o valor de shell do provedor de identidade com este valor

source: The list of shells users are allowed to log in with
it: L'elenco delle shell con cui gli utenti sono autorizzati ad accedere
pt: A lista de shells que os utilizadores têm permissão de fazer login com

source: The list of shells that will be vetoed, and replaced with the fallback shell
it: L'elenco delle shell che verranno bloccate e sostituite con la shell di fallback
pt: A lista de shells que serão vetadas, e substituídas pela shell de recurso

source: If a shell stored in central directory is allowed but not available, use this fallback
it: Se una shell memorizzata nella directory centrale è consentita ma non disponibile, usa questa fallback
pt: Se uma shell guardada no directório central estiver autorizada mas não disponível, usa este recurso

source: Shell to use if the provider does not list one
it: Shell da usare se il provider non ne specifica una
pt: Shell a usar se o provedor não listar uma

source: How long will be in-memory cache records valid
it: Per quanto tempo saranno validi i record nella cache in memoria
pt: Durante quanto tempo serão os registos em cache em-memória válidos

source: Size (in megabytes) of the data table allocated inside fast in-memory cache for passwd requests
it: Dimensione (in megabyte) della tabella dati allocata nella cache veloce in memoria per le richieste passwd
pt: Tamanho (em megabytes) da tabela de dados alocada dentro da cache em-memória rápida para pedidos de palavra passe

source: Size (in megabytes) of the data table allocated inside fast in-memory cache for group requests
it: Dimensione (in megabyte) della tabella dati allocata nella cache veloce in memoria per le richieste group
pt: Tamanho (em megabytes) da tabela de dados alocada dentro da cache em-memória rápida para pedidos de grupo

source: Size (in megabytes) of the data table allocated inside fast in-memory cache for initgroups requests
it: Dimensione (in megabyte) della tabella dati allocata nella cache veloce in memoria per le richieste initgroups
pt: Tamanho (em megabytes) da tabela de dados alocada dentro da cache em-memória rápida para pedidos de initgroups

source: The value of this option will be used in the expansion of the override_homedir option if the template contains the format string %H.
it: Il valore di questa opzione verrà utilizzato nell'espansione dell'opzione override_homedir se il template contiene la stringa di formato %H.
pt: O valor desta opção será usado na expansão da opção override_homedir se o modelo conter a string de formato %H.

source: Specifies time in seconds for which the list of subdomains will be considered valid.
it: Specifica il tempo in secondi per cui l'elenco dei sottodomini sarà considerato valido.
pt: Especifica o tempo em segundos no qual a lista de subdomínios será considerada válida.

source: The entry cache can be set to automatically update entries in the background if they are requested beyond a percentage of the entry_cache_timeout value for the domain.
it: La cache delle voci può essere impostata per aggiornare automaticamente le voci in background se vengono richieste oltre una percentuale del valore entry_cache_timeout per il dominio.
pt: A cache de entrada pode ser definida para actualizar automaticamente as entradas em segundo plano se elas forem requisitadas para lá duma percentagem do valor entry_cache_timeout do domínio.

source: How long to allow cached logins between online logins (days)
it: Per quanto tempo accettare login in cache tra login online (giorni)
pt: Durante quanto tempo devem ser permitidas sessões de caches entre sessões online (dias)

source: How many failed logins attempts are allowed when offline
it: Numero di tentativi di login falliti quando offline
pt: Quantas tentativas falhadas de inicio de sessão são permitidas quando offline

source: How long (minutes) to deny login after offline_failed_login_attempts has been reached
it: Per quanto tempo (minuti) negare i tentativi di login dopo che offline_failed_login_attemps è stato raggiunto
pt: Quanto tempo (minutos) para negar a sessão após offline_failed_login_attempts ter sido atingido

source: What kind of messages are displayed to the user during authentication
it: Quale tipo di messaggi viene mostrato all'utente durante l'autenticazione
pt: Que tipo de mensagens são mostradas ao utilizador durante a autenticação

source: Filter PAM responses sent to the pam_sss
it: Filtra le risposte PAM inviate a pam_sss
pt: Filtra respostas PAM enviadas para o pam_sss

source: How many seconds to keep identity information cached for PAM requests
it: Per quanti secondi mantenere le informazioni di identità nella cache per le richieste PAM
pt: Durante quantos segundos manter em cache a informação de identidade para pedidos PAM

source: How many days before password expiration a warning should be displayed
it: Quanti giorni prima della scadenza della password deve essere mostrato un avviso
pt: A quantos dias antes da palavra passe expirar deve ser mostrado um aviso

source: List of trusted uids or user's name
it: Elenco di UID o nomi utente fidati
pt: Lista dos uids ou nomes de utilizador de confiança

source: List of domains accessible even for untrusted users.
it: Elenco dei domini accessibili anche per utenti non fidati.
pt: Lista de domínios acessíveis mesmo para utilizadores não de confiança.

source: Message printed when user account is expired.
it: Messaggio stampato quando l'account utente è scaduto.
pt: Mensagem mostrada quando conta de utilizador está expirada.

source: Message printed when user account is locked.
it: Messaggio stampato quando l'account utente è bloccato.
pt: Mensagem mostrada quando conta de utilizador está trancada.

source: Allow certificate based/Smartcard authentication.
it: Consenti l'autenticazione basata su certificato/Smartcard.
pt: Permitir certificado com base em autenticação Smartcard.

source: Path to certificate database with PKCS#11 modules.
it: Percorso del database dei certificati con moduli PKCS#11.
pt: Caminho para base de dados de certificados com módulos PKCS#11.

source: Tune certificate verification for PAM authentication.
it: Regola la verifica del certificato per l'autenticazione PAM.
pt: Afina verificação de certificados para autenticação PAM.

source: How many seconds will pam_sss wait for p11_child to finish
it: Quanti secondi pam_sss attenderà che p11_child termini
pt: Durante quantos segundos irá o pam_sss esperar pelo p11_child terminar

source: Which PAM services are permitted to contact application domains
it: Quali servizi PAM sono autorizzati a contattare i domini applicativi
pt: Quais serviços PAM têm permissão de contactar domínios de aplicação

source: Allowed services for using smartcards
it: Servizi consentiti per l'utilizzo delle smartcard
pt: Serviços permitidos para usarem smartcards

source: Additional timeout to wait for a card if requested
it: Timeout aggiuntivo per attendere una card se richiesta
pt: Tempo limite adicional para esperar por um cartão se requisitado

source: PKCS#11 URI to restrict the selection of devices for Smartcard authentication
it: URI PKCS#11 per limitare la selezione dei dispositivi per l'autenticazione Smartcard
pt: URI PKCS#11 para restringir a seleção de dispositivos para autenticação Smartcard

source: When shall the PAM responder force an initgroups request
it: Quando il responder PAM deve forzare una richiesta initgroups
pt: Quando deve o respondedor PAM forçar um pedido initgroups

source: List of PAM services that are allowed to authenticate with GSSAPI.
it: Elenco dei servizi PAM autorizzati ad autenticarsi con GSSAPI.
pt: Lista de serviços PAM que têm permissão de autenticarem com GSSAPI.

source: Whether to match authenticated UPN with target user
it: Se confrontare l'UPN autenticato con l'utente di destinazione
pt: Se deve-se corresponder UPN autenticado com utilizador alvo

source: List of pairs <PAM service>:<authentication indicator> that must be enforced for PAM access with GSSAPI authentication
it: Elenco di coppie <servizio PAM>:<indicatore di autenticazione> che devono essere applicate per l'accesso PAM con autenticazione GSSAPI
pt: Lista de pares <serviço PAM>:<indicador de autenticação> que têm de ser impostos para acesso PAM com autenticação GSSAPI

source: Allow passkey device authentication.
it: Consenti l'autenticazione del dispositivo passkey.
pt: Permitir autenticação de dispositivo passkey.

source: How many seconds will pam_sss wait for passkey_child to finish
it: Quanti secondi pam_sss attenderà che passkey_child termini
pt: Quantos segundos irá o pam_sss esperar pelo passkey_child terminar

source: Enable debugging in the libfido2 library
it: Abilita il debug nella libreria libfido2
pt: Ativa depuração na biblioteca libfido2

source: Whether to evaluate the time-based attributes in sudo rules
it: Se valutare gli attributi basati sul tempo nelle regole sudo
pt: Se deve-se avaliar os atributos baseados em hora nas regras sudo

source: If true, SSSD will switch back to lower-wins ordering logic
it: Se vero, SSSD tornerà alla logica di ordinamento lower-wins
pt: Se true, SSSD irá comutar para lógica de ordenação lower-wins

source: Maximum number of rules that can be refreshed at once. If this is exceeded, full refresh is performed.
it: Numero massimo di regole che possono essere aggiornate contemporaneamente. Se questo viene superato, viene eseguito un aggiornamento completo.
pt: Número máximo de regras que podem ser refrescadas de uma vez. Se sito for excedido, é executado refrescar total.

source: Whether to hash host names and addresses in the known_hosts file
it: Se eseguire l'hash dei nomi host e degli indirizzi nel file known_hosts
pt: Se deve-se guarda nomes de máquinas e endereços em cinzas no ficheiro known_hosts

source: How many seconds to keep a host in the known_hosts file after its host keys were requested
it: Per quanti secondi mantenere un host nel file known_hosts dopo che le sue chiavi host sono state richieste
pt: Durante quantos segundos manter uma máquina no ficheiro known_hosts após as chaves dessa máquina serem requisitadas

source: Path to storage of trusted CA certificates
it: Percorso dell'archivio dei certificati CA attendibili
pt: Caminho para armazém de certificados CA de confiança

source: Allow to generate ssh-keys from certificates
it: Consenti di generare chiavi ssh dai certificati
pt: Permite gerar chaves ssh a partir de certificados

source: Use the following matching rules to filter the certificates for ssh-key generation
it: Usa le seguenti regole di corrispondenza per filtrare i certificati per la generazione delle chiavi ssh
pt: Usa as seguintes regras de correspondência para filtrar os cerificados para a geração de chave ssh

source: List of UIDs or user names allowed to access the PAC responder
it: Elenco di UID o nomi utente autorizzati ad accedere al PAC responder
pt: Lista de UIDs ou nomes de utilizador com permissão de acesso ao respondedor PAC

source: How long the PAC data is considered valid
it: Per quanto tempo i dati PAC sono considerati validi
pt: Durante quanto tempo os dados PAC são considerados válidos

source: Validate the PAC
it: Valida il PAC
pt: Valida o PAC

source: List of user attributes the InfoPipe is allowed to publish
it: Elenco degli attributi utente che InfoPipe è autorizzato a pubblicare
pt: Lista de atributos de utilizador que o InfoPipe tem permissão de publicar

source: One of the following strings specifying the scope of session recording: none - No users are recorded. some - Users/groups specified by users and groups options are recorded. all - All users are recorded.
it: Una delle seguenti stringhe che specificano l'ambito della registrazione della sessione: none - Nessun utente viene registrato. some - Gli utenti/gruppi specificati dalle opzioni users e groups vengono registrati. all - Tutti gli utenti vengono registrati.
pt: Uma das seguintes strings que especificam o escopo de registo de sessão: none - Nenhum utilizador é registado. some - Utilizadores/grupos especificados pelas opções users e groups são registados. all - Todos os utilizadores são registados.

source: A comma-separated list of users which should have session recording enabled. Matches user names as returned by NSS. I.e. after the possible space replacement, case changes, etc.
it: Un elenco separato da virgole di utenti per i quali la registrazione della sessione dovrebbe essere abilitata. Corrisponde ai nomi utente restituiti da NSS. Cioè dopo la possibile sostituzione degli spazi, cambiamenti di maiuscolo/minuscolo, ecc.
pt: Uma lista separada por vírgulas de utilizadores que deverão ter registo de sessão activo. Corresponde a nomes de utilizadores como retornados pelo NSS, isto é, após a possível substituição de espaços, alterações de minúscula/maiúscula, etc.

source: A comma-separated list of groups, members of which should have session recording enabled. Matches group names as returned by NSS. I.e. after the possible space replacement, case changes, etc.
it: Un elenco separato da virgole di gruppi, i cui membri dovrebbero avere la registrazione della sessione abilitata. Corrisponde ai nomi dei gruppi restituiti da NSS. Cioè dopo la possibile sostituzione degli spazi, cambiamenti di maiuscolo/minuscolo, ecc.
pt: Uma lista separada por vírgulas de grupos, cujos membros deverão ter registo de sessão activo. Corresponde a nomes de grupos como retornados pelo NSS, isto é, após a possível substituição de espaços, alterações de minúscula/maiúscula, etc.

source: A comma-separated list of users to be excluded from recording, only when scope=all
it: Un elenco separato da virgole di utenti da escludere dalla registrazione, solo quando scope=all
pt: Uma lista de utilizadores separados por vírgulas a serem excluídos de registo, apenas quando scope=all

source: A comma-separated list of groups, members of which should be excluded from recording, only when scope=all.
it: Un elenco separato da virgole di gruppi, i cui membri dovrebbero essere esclusi dalla registrazione, solo quando scope=all.
pt: Uma lista de grupos separados por vírgulas, cujos membros devem ser excluídos de registo, apenas quando scope=all.

source: Identity provider
it: Provider di identità
pt: Provedor de identidade

source: Authentication provider
it: Provider di autenticazione
pt: Provedor de autenticação

source: Access control provider
it: Provider di access control
pt: Provedor de controle de acesso

source: Password change provider
it: Provider di cambio password
pt: Provedor de alteração de palavra passe

source: SUDO provider
it: Provider SUDO
pt: Provedor do SUDO

source: Autofs provider
it: Provider Autofs
pt: Provedor Autofs

source: Host identity provider
it: Provider di identità host
pt: Provedor de identidade de máquina

source: SELinux provider
it: Provider SELinux
pt: Provedor do SELinux

source: Session management provider
it: Provider di gestione sessione
pt: Provedor de gestão de sessão

source: Resolver provider
it: Provider resolver
pt: Provedor de resolvedor

source: Whether the domain is usable by the OS or by applications
it: Se il dominio è utilizzabile dal sistema operativo o dalle applicazioni
pt: Se o domínio é utilizável pelo OS ou pelas aplicações

source: Enable or disable the domain
it: Abilita o disabilita il dominio
pt: Activar ou desactivar o domínio

source: Minimum user ID
it: ID utente minimo
pt: ID de utilizador mínimo

source: Maximum user ID
it: ID utente massimo
pt: ID de utilizador máximo

source: Enable enumerating all users/groups
it: Consentire l'enumerazione di tutti gli utenti/gruppi
pt: Permitir enumeração de todos os utilizadores/grupos
