Repository: SSSD/sssd
Catalog: po/*.po
Languages: it, pt

source: Analyze logged data
it: Analizza dati loggati
pt: Analisa dados guardados em relatório

source: Configuration files tools:
it: Strumenti file di configurazione:
pt: Ferramentas de ficheiros de configuração:

source: Perform static analysis of SSSD configuration
it: Esegui analisi statica della configurazione SSSD
pt: Efetua análise estática da configuração do SSSD

source: Certificate related tools:
it: Strumenti relativi ai certificati:
pt: Ferramentas relacionadas com certificação:

source: Print information about the certificate
it: Stampa informazioni sul certificato
pt: Escreve informação sobre um certificado

source: Show users mapped to the certificate
it: Mostra utenti mappati al certificato
pt: Mostra utilizadores mapeados ao certificado

source: Check mapping and matching rule with a certificate
it: Verifica regola di mappatura e corrispondenza con un certificato
pt: Verifica mapeamento e regra de correspondência com um certificado

source: GPOs related tools:
it: Strumenti relativi alle GPO:
pt: Ferramentas relacionadas com GPOs:

source: Information about cached GPO
it: Informazioni sulla GPO nella cache
pt: Informação acerca de GPO em cache

source: Enumerate cached GPOs
it: Enumera GPO nella cache
pt: Enumera GPOs em cache

source: Remove cached GPO
it: Rimuovi GPO dalla cache
pt: Remover GPO em cache

source: Remove all cached GPOs
it: Rimuovi tutte le GPO dalla cache
pt: Remover todos os GPOs em cache

source: Passkey related tools:
it: Strumenti relativi alle passkey:
pt: Ferramentas relacionadas com passkey:

source: Perform passkey registration
it: Esegui registrazione passkey
pt: Efetua registro da passkey

source: %s is not present in cache.
it: %s non è presente nella cache.
pt: %s não está presente em cache.

source: Name
it: Nome
pt: Nome

source: Cache entry creation date
it: Data creazione voce cache
pt: Data de criação de entrada em cache

source: Cache entry last update time
it: Ora ultimo aggiornamento voce cache
pt: Hora da última atualização de entrada em cache

source: Cache entry expiration time
it: Ora scadenza voce cache
pt: Hora de expiração da entrada em cache

source: Cached in InfoPipe
it: Nella cache di InfoPipe
pt: Colocado em cache em InfoPipe

source: Policy Name
it: Nome Policy
pt: Nome de Política

source: Policy GUID
it: GUID Policy
pt: GUID de Política

source: Policy Path
it: Percorso Policy
pt: Caminho de Política

source: Policy file timeout
it: Timeout file Policy
pt: Tempo de vida de ficheiro de Política

source: Policy version
it: Versione Policy
pt: Versão de Política

source: Error: Unable to get object [%d]: %s
it: Errore: Impossibile ottenere l'oggetto [%d]: %s
pt: Erro: Incapaz de obter objeto [%d]: %s

source: %s: Unable to read value [%d]: %s
it: %s: Impossibile leggere il valore [%d]: %s
pt: %s: Incapaz de ler valor [%d]: %s

source: Specify name.
it: Specificare nome.
pt: Especificar o nome.

source: Unable to parse name %s.
it: Impossibile analizzare il nome %s.
pt: Incapaz de analisar nome %s.

source: Search by SID
it: Cerca per SID
pt: Procurar por SID

source: Search by user ID
it: Cerca per ID utente
pt: Procurar por ID de utilizador

source: Initgroups expiration time
it: Ora scadenza Initgroups
pt: Tempo de expiração de initgroups

source: Search by group ID
it: Cerca per ID gruppo
pt: Procurar por ID de grupo

source: Search by GPO guid
it: Cerca per GUID GPO
pt: Procurar por guid de GPO

source: Failed to parse command line: %s
it: Fallita l'analisi della riga di comando: %s
pt: Falhou ao analisar linha de comandos: %s

source: Failed to print object: %s
it: Fallita la stampa dell'oggetto: %s
pt: Falhou ao escrever objeto: %s

source: talloc failed
it: talloc fallito
pt: talloc falhado

source: Unable to get attribute list!
it: Impossibile ottenere l'elenco degli attributi!
pt: Incapaz de obter lista de atributos!

source: Unable to create filter
it: Impossibile creare il filtro
pt: Incapaz de criar filtro

source: Unable to get GPOs base DN
it: Impossibile ottenere il DN base delle GPO
pt: Incapaz de obter DN base de GPOs

source: Unable to search sysdb: %s
it: Impossibile cercare sysdb: %s
pt: Incapaz de procurar sysdb: %s

source: Unable to convert message to sysdb attrs: %s
it: Impossibile convertire il messaggio in attributi sysdb: %s
pt: Incapaz de converter mensagem para sysdb attrs: %s

source: Could not find GUID attribute from GPO entry
it: Impossibile trovare l'attributo GUID dalla voce GPO
pt: Não foi encontrado atributo GUID de entrada GPO

source: Could not find description attribute from GPO entry
it: Impossibile trovare l'attributo descrizione dalla voce GPO
pt: Não foi encontrado atributo de descrição de entrada GPO

source: Could not delete GPO entry from cache
it: Impossibile eliminare la voce GPO dalla cache
pt: Não pude apagar entrada GPO da cache

source: The GPO path was not yet stored in cache. Please remove files manually from [%s]
it: Il percorso GPO non era ancora memorizzato nella cache. Per favore rimuovi i file manualmente da [%s]
pt: O caminho GPO ainda não está armazenado na cache. Por favor remova ficheiros manualmente de [%s]

source: Could not determine real path for [%s]: %s
it: Impossibile determinare il percorso reale per [%s]: %s
pt: Não pude determinar caminho real para [%s]: %s

source: The cached GPO path [%s] is not under [%s], ignoring.
it: Il percorso GPO nella cache [%s] non è sotto [%s], ignorando.
pt: O caminho GPO em cache [%s] não é sob [%s], a ignorar.

source: Unable to remove downloaded GPO files: %s
it: Impossibile rimuovere i file GPO scaricati: %s
pt: Incapaz de remover ficheiros GPO descarregados: %s

source: Failed to fetch cache entry: %s
it: Fallito il recupero della voce cache: %s
pt: Falhou ao ir buscar entrada de cache: %s

source: Could not determine object domain
it: Impossibile determinare il dominio dell'oggetto
pt: Não pude determinar domínio objeto

source: Could not find GUID attribute in GPO entry
it: Impossibile trovare l'attributo GUID nella voce GPO
pt: Não pude encontrar atributo GUID em entrada GPO

source: Failed to delete GPO: %s
it: Fallita l'eliminazione della GPO: %s
pt: Falhou ao apagar GPO: %s

source: %s removed from cache
it: %s rimosso dalla cache
pt: %s removido da cache

source: Show debug information
it: Mostra informazioni di debug
pt: Mostra informação de depuração

source: Specify base64 encoded certificate.
it: Specifica certificato codificato in base64.
pt: Especifica certificado codificado em base64.

source: Unable to connect to system bus!
it: Impossibile connettersi al bus di sistema!
pt: Incapaz de ligar ao barramento do sistema!

source: - no mapped users found -
it: - nessun utente mappato trovato -
pt: - nenhum utilizador mapeado encontrado -

source: Mapping rule
it: Regola di mappatura
pt: Regra de mapeamento

source: Matching rule
it: Regola di corrispondenza
pt: Regra de correspondência

source: Unable to parse command arguments
it: Impossibile analizzare gli argomenti del comando
pt: Incapaz de analisar argumentos do comando

source: Out of memory!
it: Memoria esaurita!
pt: Memória esgotada!

source: Failed to setup certmap context.
it: Fallita l'impostazione del contesto certmap.
pt: Falhou ao configurar contexto certmap.

source: Failed to add mapping and matching rules with error [%d][%s].
it: Fallita l'aggiunta delle regole di mappatura e corrispondenza con errore [%d][%s].
pt: Falhou ao adicionar regras de mapeamento e correspondência com erro [%d][%s].

source: Failed to decode base64 string.
it: Fallita la decodifica della stringa base64.
pt: Falhou ao descodificar string de base64.

source: Certificate matches rule.
it: Il certificato corrisponde alla regola.
pt: Certificado corresponde a regra.

source: Certificate does not match rule.
it: Il certificato non corrisponde alla regola.
pt: Certificado não corresponde a regra.

source: Error during certificate matching [%d][%s].
it: Errore durante la corrispondenza del certificato [%d][%s].
pt: Erro durante a correspondência do certificado [%d][%s].

source: Failed to generate mapping filter [%d][%s].
it: Fallita la generazione del filtro di mappatura [%d][%s].
pt: Falhou ao gerar filtro de mapeamento [%d][%s].

source: Mapping filter: %s
it: Filtro di mappatura: %s
pt: Filtro de mapeamento: %s

source: Specify a non-default snippet dir (The default is to look in the same place where the main config file is located. For example if the config is set to "/my/path/sssd.conf", the snippet dir "/my/path/conf.d" is used)
it: Specifica una directory snippet non predefinita (L'impostazione predefinita è cercare nella stessa posizione in cui si trova il file di configurazione principale. Ad esempio, se la configurazione è impostata su "/mio/percorso/sssd.conf", viene utilizzata la directory snippet "/mio/percorso/conf.d")
pt: Especifica um directório de trechos não predefinido (A predefinição é procurar no mesmo local onde o ficheiro de configuração principal está localizado. Por exemplo se a configuração estiver definida para "/my/path/sssd.conf", é usado o directório de trechos "/my/path/conf.d")

source: File %1$s does not exist.
it: File %1$s non esiste.
pt: O ficheiro %1$s não existe.

source: There is no configuration.
it: Non c'è configurazione.
pt: Não existe configuração.

source: Configuration validation failed: %s
pt: Validação de configuração falhada: %s

source: Run with high debug level to see details.
pt: Corra com nível de depuração alto para ver detalhes.

source: Failed to run validators
it: Fallita l'esecuzione dei validatori
pt: Falhou ao correr validadores

source: Issues identified by validators: %zu
it: Problemi identificati dai validatori: %zu
pt: Problemas identificados pelos validadores: %zu

source: Messages generated during configuration merging: %zu
it: Messaggi generati durante l'unione della configurazione: %zu
pt: Mensagens geradas durante a fusão de configuração: %zu

source: Used configuration snippet files: %zu
it: File snippet di configurazione utilizzati: %zu
pt: Ficheiros de trechos do configuração usados: %zu

source: Unable to create backup directory [%d]: %s
it: Impossibile creare la directory di backup [%d]: %s
pt: Incapaz de criar directório de salvaguarda [%d]: %s

source: SSSD backup of local data already exists, override?
it: Il backup SSSD dei dati locali esiste già, sovrascrivere?
pt: A salvaguarda SSSD de dados locais já existe, sobrescrever?

source: Unable to export user overrides
it: Impossibile esportare gli override utente
pt: Incapaz de exportar sobreposições do utilizador

source: Unable to export group overrides
it: Impossibile esportare gli override gruppo
pt: Incapaz de exportar sobreposições do grupo

source: Override existing backup
it: Sovrascrivi backup esistente
pt: Sobrescrever salvaguarda existente

source: Unable to import user overrides
it: Impossibile importare gli override utente
pt: Incapaz de importar sobreposições do utilizador

source: Unable to import group overrides
it: Impossibile importare gli override gruppo
pt: Incapaz de importar sobreposições do grupo

source: Start SSSD if it is not running
it: Avvia SSSD se non è in esecuzione
pt: Arranca o SSSD se não estiver a correr

source: Restart SSSD after data import
it: Riavvia SSSD dopo l'importazione dei dati
pt: Reinicia o SSSD após importação de dados

source: Create clean cache files and import local data
it: Crea file cache puliti e importa dati locali
pt: Cria ficheiros de cache limpos e importa dados locais

source: Stop SSSD before removing the cache
it: Ferma SSSD prima di rimuovere la cache
pt: Pára o SSSD antes de remover a cache

source: Start SSSD when the cache is removed
it: Avvia SSSD quando la cache è rimossa
pt: Arranca o SSSD quando a cache é removida

source: Creating backup of local data...
it: Creazione backup dei dati locali in corso...
pt: A criar salvaguarda dos dados locais...

source: Unable to create backup of local data, can not remove the cache.
it: Impossibile creare il backup dei dati locali, impossibile rimuovere la cache.
pt: Incapaz de criar salvaguarda dos dados locais, não pode remover a cache.

source: Removing cache files...
it: Rimozione file cache in corso...
pt: A remover ficheiros de cache...

source: Unable to remove cache files
it: Impossibile rimuovere i file cache
pt: Incapaz de remover ficheiros de cache

source: Restoring local data...
it: Ripristino dati locali in corso...
pt: A restaurar dados locais...

source: Creating cache index for domain %1$s
it: Creazione indice cache per il dominio %1$s
pt: A criar índices de cache para domínio %1$s

source: Deleting cache index for domain %1$s
it: Eliminazione indice cache per il dominio %1$s
pt: A apagar índices de cache para domínio %1$s

source: Indexes for domain %1$s:
it: Indici per il dominio %1$s:
pt: Índices para domínio %1$s:

source: Attribute: %1$s
it: Attributo: %1$s
pt: Atributo: %1$s

source: Target a specific domain
it: Indirizza a un dominio specifico
pt: Apontar a um domínio específico

source: domain
it: dominio
pt: domínio

source: Attribute to index
it: Attributo da indicizzare
pt: Atributo a indexar

source: attribute
it: attributo
pt: atributo

source: Action not provided
it: Azione non fornita
pt: Acção não fornecida

source: Unknown action: %1$s Valid actions are "%2$s", "%3$s and "%4$s"
it: Azione sconosciuta: %1$s Le azioni valide sono "%2$s", "%3$s e "%4$s"
pt: Acção desconhecida: %1$s Acções válidas são "%2$s", "%3$s e "%4$s"

source: Attribute (-a) not provided
it: Attributo (-a) non fornito
pt: Atributo (-a) não fornecido

source: Attribute %1$s not indexed.
it: Attributo %1$s non indicizzato.
pt: Atributo %1$s não indexado.

source: Attribute %1$s already indexed.
it: Attributo %1$s già indicizzato.
pt: Atributo %1$s já indexado.

source: Index operation failed: %1$s
it: Operazione di indicizzazione fallita: %1$s
pt: Operação de indexar falhou: %1$s

source: Don't forget to also update the indexes on the remote providers.
it: Non dimenticare di aggiornare anche gli indici sui provider remoti.
pt: Não se esqueça de também atualizar os índices nos provedores remotos.

source: Show domain list including primary or trusted domain type
it: Mostra l'elenco dei domini includendo il tipo di dominio primario o attendibile
pt: Mostra lista de domínios incluindo tipos de domínio primário ou de confiança

source: Online status: %s
it: Stato online: %s
pt: Estado de Online: %s

source: This domain has no active servers.
it: Questo dominio non ha server attivi.
pt: Este domínio não tem servidores ativos.

source: Active servers:
it: Server attivi:
pt: Servidores ativos:

source: not connected
it: non connesso
pt: não ligado

source: No servers discovered.
it: Nessun server scoperto.
pt: Nenhum servidor descoberto.

source: Discovered %s servers:
it: Scoperti %s server:
pt: Servidores descobertos %s :

source: None so far.
it: Nessuno finora.
pt: Nenhum até agora.

source: Show online status
it: Mostra stato online
pt: Mostra estado online

source: Show information about active server
it: Mostra informazioni sul server attivo
pt: Mostra informação acerca do servidor ativo

source: Show list of discovered servers
it: Mostra elenco dei server scoperti
pt: Mostra lista de servidores descobertos

source: Specify domain name.
it: Specificare nome dominio.
pt: Especifica nome de domínio.

source: Unable to get online status
it: Impossibile ottenere lo stato online
pt: Incapaz de obter o estado de online

source: Unable to get server list
it: Impossibile ottenere l'elenco dei server
pt: Incapaz de obter lista de servidores

source: SSSD is not running.
it: SSSD non è in esecuzione.
pt: SSSD não está a correr.

source: %1$-25s Unknown domain
it: %1$-25s Dominio sconosciuto
pt: %1$-25s Domínio desconhecido

source: %1$-25s Unreachable service
it: %1$-25s Servizio irraggiungibile
pt: %1$-25s Serviço não alcançável

source: Delete log files instead of truncating
it: Elimina file di log invece di troncarli
pt: Apaga ficheiros log em vez de os truncar

source: Deleting log files...
it: Eliminazione file di log in corso...
pt: A apagar ficheiros log...

source: Unable to remove log files
it: Impossibile rimuovere i file di log
pt: Incapaz de remover ficheiros log

source: Truncating log files...
it: Troncamento file di log in corso...
pt: A truncar ficheiros log...

source: Unable to truncate log files
it: Impossibile troncare i file di log
pt: Incapaz de truncar ficheiros log

source: Archiving log files into %s...
it: Archiviazione file di log in %s...
pt: A arquivar ficheiros log em %s...

source: Unable to archive log files
it: Impossibile archiviare i file di log
pt: Incapaz de arquivar ficheiros log

source: Target the SSSD service
it: Indirizza al servizio SSSD
pt: Aponta ao serviço SSSD

source: Target the NSS service
it: Indirizza al servizio NSS
pt: Aponta ao serviço NSS

source: Target the PAM service
it: Indirizza al servizio PAM
pt: Aponta ao serviço PAM

source: Target the SUDO service
it: Indirizza al servizio SUDO
pt: Aponta ao serviço SUDO

source: Target the AUTOFS service
it: Indirizza al servizio AUTOFS
pt: Aponta ao serviço AUTOFS

source: Target the SSH service
it: Indirizza al servizio SSH
pt: Aponta ao serviço SSH

source: Target the PAC service
it: Indirizza al servizio PAC
pt: Aponta ao serviço PAC

source: Target the IFP service
it: Indirizza al servizio IFP
pt: Aponta ao serviço IFP

source: Specify debug level you want to set
it: Specifica il livello di debug che vuoi impostare
pt: Especifique o nível de depuração que deseja definir

source: ERROR: Tevent chain ID support missing, log analyzer is unsupported.
it: ERRORE: Supporto ID catena Tevent mancante, l'analizzatore di log non è supportato.
pt: ERRO: Suporte de ID de cadeia tevent em falta, analisador de log não é suportado.

source: SSSD InfoPipe user lookup result:
it: Risultato ricerca utente SSSD InfoPipe:
pt: Resultado da consulta de utilizador a InfoPipe SSSD:

source: dlopen failed with [%s].
it: dlopen fallito con [%s].
pt: dlopen falhou com [%s].

source: dlsym failed with [%s].
it: dlsym fallito con [%s].
pt: dlsym falhou com [%s].

source: malloc failed.
it: malloc fallito.
pt: malloc falhou.

source: sss_getpwnam_r failed with [%d].
it: sss_getpwnam_r fallito con [%d].
pt: sss_getpwnam_r falhou com [%d].

source: SSSD nss user lookup result:
it: Risultato ricerca utente SSSD nss:
pt: Resultado da consulta de utilizador a nss SSSD:

source: - user name: %s
it: - nome utente: %s
pt: - nome de utilizador: %s

source: - user id: %d
it: - id utente: %d
pt: - id de utilizador: %d

source: - group id: %d
it: - id gruppo: %d
pt: - id de grupo: %d

source: - home directory: %s
it: - directory home: %s
pt: - directório home: %s

source: PAM action [auth|acct|setc|chau|open|clos], default:
it: Azione PAM [auth|acct|setc|chau|open|clos], predefinito:
pt: Acção PAM [auth|acct|setc|chau|open|clos], predefinição:

source: PAM service, default:
it: Servizio PAM, predefinito:
pt: Serviço PAM, predefinição:

source: Specify user name.
it: Specificare nome utente.
pt: Especifique nome de utilizador.

source: user: %s action: %s service: %s
it: utente: %s azione: %s servizio: %s
pt: utilizador: %s acção: %s serviço: %s

source: User name lookup with [%s] failed.
it: Ricerca nome utente con [%s] fallita.
pt: Pesquisa de nome de utilizador com [%s] falhou.

source: InfoPipe User lookup with [%s] failed.
it: Ricerca Utente InfoPipe con [%s] fallita.
pt: Consulta de Utilizador InfoPipe com [%s] falhou.

source: pam_start failed: %s
it: pam_start fallito: %s
pt: pam_start falhou: %s

source: testing pam_authenticate
it: test pam_authenticate
pt: a testar pam_authenticate

source: pam_get_item failed: %s
it: pam_get_item fallito: %s
pt: pam_get_item falhou: %s

source: pam_authenticate for user [%s]: %s
it: pam_authenticate per utente [%s]: %s
pt: pam_authenticate para utilizador [%s]: %s

source: testing pam_chauthtok
it: test pam_chauthtok
pt: a testar pam_chauthtok

source: testing pam_acct_mgmt
it: test pam_acct_mgmt
pt: a testar pam_acct_mgmt

source: testing pam_setcred
it: test pam_setcred
pt: a testar pam_setcred

source: testing pam_open_session
it: test pam_open_session
pt: a testar pam_open_session

source: testing pam_close_session
it: test pam_close_session
pt: a testar pam_close_session

source: unknown action
it: azione sconosciuta
pt: acção desconhecida

source: PAM Environment:
it: Ambiente PAM:
pt: Ambiente PAM:

source: Specify a non-default config file
it: Specificare un file di configurazione specifico
pt: Especificar um ficheiro de configuração não predefinido

source: Informs that the responder has been socket-activated
it: Informa che il responder è stato attivato via socket
pt: Informa que o respondedor tem sido activado-por-socket

source: - no env -
it: - nessun env -
