Repository: SSSD/sssd
Catalog: po/*.po
Languages: it, pt

source: Option for tuning the machine account renewal task
it: Opzione per regolare l'attività di rinnovo dell'account macchina
pt: Opção para afinar a tarefa de renovação da conta da máquina

source: Whether to update the machine account password in the Samba database
it: Se aggiornare la password dell'account macchina nel database Samba
pt: Se deve-se atualizar a palavra passe da conta da máquina na base de dados do Samba

source: Use LDAPS port for LDAP and Global Catalog requests
it: Utilizza la porta LDAPS per le richieste LDAP e Global Catalog
pt: Usa porto LDAPS para pedidos LDAP e Catálogo Global

source: Do not filter domain local groups from other domains
it: Non filtrare i gruppi locali di dominio da altri domini
pt: Não filtrar grupos locais do domínio de outros domínios

source: Kerberos server address
it: Indirizzo del server Kerberos
pt: Endereço do servidor Kerberos

source: Kerberos backup server address
it: Indirizzo del server di backup Kerberos
pt: Endereço do servidor de salvaguarda do Kerberos

source: Kerberos realm
it: Realm Kerberos
pt: Reino Kerberos

source: Authentication timeout
it: Timeout di autenticazione
pt: Tempo limite da autenticação

source: Whether to create kdcinfo files
it: Se creare file kdcinfo
pt: Se deve-se criar ficheiros kdcinfo

source: Where to drop krb5 config snippets
it: Dove depositare gli snippet di configurazione krb5
pt: Onde deixar os trechos de configuração krb5

source: Directory to store credential caches
it: Directory in cui salvare le credenziali
pt: Directório para armazenar as caches de credenciais

source: Location of the user's credential cache
it: Percorso della cache delle credenziali utente
pt: Localização da cache de credenciais do utilizador

source: Location of the keytab to validate credentials
it: Percorso del keytab per la validazione delle credenziali
pt: Localização da tabela de chaves (keytab) para validar credenciais

source: Enable credential validation
it: Abilita la validazione delle credenziali
pt: Activar validação de credenciais

source: Store password if offline for later online authentication
it: Memorizza la password se offline per l'autenticazione online successiva
pt: Armazena palavra passe se offline para autenticação posterior online

source: Renewable lifetime of the TGT
it: Durata rinnovabile del TGT
pt: Tempo de vida renovável do TGT

source: Lifetime of the TGT
it: Durata del TGT
pt: Tempo de vida do TGT

source: Time between two checks for renewal
it: Intervallo di tempo tra due controlli di rinnovo
pt: Tempo entre duas verificações para renovação

source: Enables FAST
it: Abilita FAST
pt: Ativa FAST

source: Selects the principal to use for FAST
it: Seleziona il principal da utilizzare per FAST
pt: Seleciona o uso principal para FAST

source: Use anonymous PKINIT to request FAST credentials
it: Utilizza PKINIT anonimo per richiedere credenziali FAST
pt: Usa PKINIT anônimo para pedido de credenciais FAST

source: Enables principal canonicalization
it: Abilita la canonicalizzazione del principal
pt: Ativa canonização de principal

source: Enables enterprise principals
it: Abilita i principal aziendali
pt: Ativa principais de empresa

source: Enables using of subdomains realms for authentication
it: Abilita l'uso dei realm dei sottodomini per l'autenticazione
pt: Ativa o uso de reinos de sub-domínios para autenticação

source: A mapping from user names to Kerberos principal names
it: Una mappatura dai nomi utente ai nomi principal Kerberos
pt: Um mapeamento de nomes de utilizador para nomes de principais do Kerberos

source: Server where the change password service is running if not on the KDC
it: Server dove viene eseguito il servizio di cambio password, se non nel KDC
pt: Servidor onde está o serviço de alteração de palavra passe a correr, se não no KDC

source: ldap_uri, The URI of the LDAP server
it: ldap_uri, l'indirizzo del server LDAP
pt: ldap_uri, O URI do servidor LDAP

source: ldap_backup_uri, The URI of the LDAP server
it: ldap_backup_uri, l'URI del server LDAP
pt: ldap_backup_uri, O URI do servidor LDAP

source: The default base DN
it: Il base DN predefinito
pt: O DN base predefinido

source: How to read rootDSE from LDAP server
pt: Como ler rootDSE a partir do servidor LDAP

source: The Schema Type in use on the LDAP server, rfc2307
it: Lo Schema Type utilizzato dal server LDAP, rfc2307
pt: O Tipo de Esquema em utilização no servidor LDAP, rfc2307

source: Mode used to change user password
it: Modalità utilizzata per cambiare la password utente
pt: Modo usado para a alteração da palavra passe do utilizador

source: The default bind DN
it: Il bind DN predefinito
pt: O DN de união predefinido

source: The type of the authentication token of the default bind DN
it: Il tipo di token di autenticazione del bind DN predefinito
pt: O tipo de testemunho de autenticação do DN de união predefinido

source: The authentication token of the default bind DN
it: Il token di autenticazione del bind DN predefinito
pt: O testemunho de autenticação do DN de união predefinido

source: Length of time to attempt connection
it: Durata del tentativo di connessione
pt: Período de tempo para tentar ligação

source: Length of time to attempt synchronous LDAP operations
it: Durata del tentativo di esecuzione di operazioni LDAP sincrone
pt: Tempo de espera para tentar operações LDAP síncronas

source: Length of time between attempts to reconnect while offline
it: Durata tra tentativi di riconnessione quando offline
pt: Tempo de espera entre tentativas para religar quando desligado

source: Use only the upper case for realm names
it: Usare solo maiuscole per i nomi dei realm
pt: Usar apenas maiúsculas para nomes de reino

source: File that contains CA certificates
it: File contenente i certificati CA
pt: Ficheiro que contêm os certificados CA

source: Path to CA certificate directory
it: Percorso della directory dei cerficati della CA
pt: Caminho para o directório do certificado CA

source: File that contains the client certificate
it: File contenente il certificato client
pt: Ficheiro que contém o certificado do cliente

source: File that contains the client key
it: File contenente la chiave client
pt: Ficheiro que contém a chave do cliente

source: List of possible ciphers suites
it: Lista delle possibili cipher suite
pt: Lista das possíveis suítes de cifras

source: Require TLS certificate verification
it: Richiedere la verifica del certificato TLS
pt: Requer verificação de certificados TLS

source: Specify the sasl mechanism to use
it: Specificare il meccanismo sasl da usare
pt: Especifique o mecanismo sasl a utilizar

source: Specify the sasl authorization id to use
it: Specificare l'id di autorizzazione sasl da usare
pt: Especifique o id de autorização sasl a usar

source: Specify the sasl authorization realm to use
it: Specifica il realm di autorizzazione sasl da utilizzare
pt: Especifique o reino de autorização sasl a usar

source: Specify the minimal SSF for LDAP sasl authorization
it: Specifica l'SSF minimo per l'autorizzazione sasl LDAP
pt: Especifica o SSL mínimo para autorização sasl do LDAP

source: Specify the maximal SSF for LDAP sasl authorization
it: Specifica l'SSF massimo per l'autorizzazione sasl LDAP
pt: Especifica o SSL máximo para autorização sasl do LDAP

source: Kerberos service keytab
it: Keytab del servizio Kerberos
pt: Keytab do serviço Kerberos

source: Use Kerberos auth for LDAP connection
it: Usare autorizzazione Kerberos per la connessione LDAP
pt: Utilizar autenticação Kerberos para ligação LDAP

source: Follow LDAP referrals
it: Seguire i referral LDAP
pt: Seguir os referenciais do LDAP

source: Lifetime of TGT for LDAP connection
it: Durata del TGT per la connessione LDAP
pt: Tempo de vida do TGT para ligação a LDAP

source: How to dereference aliases
it: Metodo di deferenziazione degli alias
pt: Como diferenciar os nomes alternativos (aliases)

source: Service name for DNS service lookups
it: Nome del servizio per le ricerche del servizio DNS
pt: Nome de serviço para consultas de serviço DNS

source: The number of records to retrieve in a single LDAP query
it: Il numero di record da recuperare in una singola query LDAP
pt: O número de registos a obter numa única consulta LDAP

source: The number of members that must be missing to trigger a full deref
it: Il numero di membri che devono mancare per attivare un deref completo
pt: O número de membros que têm de estar em falta para acionar um deref completo

source: Ignore unreadable LDAP references
it: Ignora i riferimenti LDAP illeggibili
pt: Ignorar referências LDAP ilegíveis

source: Whether the LDAP library should perform a reverse lookup to canonicalize the host name during a SASL bind
it: Se la libreria LDAP debba eseguire una ricerca inversa per canonicalizzare il nome host durante un bind SASL
pt: Se a biblioteca LDAP deve efetuar uma busca reversa para canonizar o nome de máquina durante uma união SASL

source: Allows to retain local users as members of an LDAP group for servers that use the RFC2307 schema.
it: Consente di mantenere gli utenti locali come membri di un gruppo LDAP per i server che utilizzano lo schema RFC2307.
pt: Permite reter utilizadores locais como membros dum grupo LDAP para servidores que usam o esquema RFC2307.

source: entryUSN attribute
it: Attributo entryUSN
pt: Atributo entryUSN

source: lastUSN attribute
it: Attributo lastUSN
pt: Atributo lastUSN

source: How long to retain a connection to the LDAP server before disconnecting
it: Per quanto tempo mantenere una connessione al server LDAP prima di disconnettersi
pt: Durante quanto tempo reter uma ligação a um servidor LDAP antes de desligar

source: Disable the LDAP paging control
it: Disabilita il controllo di paginazione LDAP
pt: Desativar o controlo de paginação do LDAP

source: Disable Active Directory range retrieval
it: Disabilita il recupero dell'intervallo di Active Directory
pt: Desativar a obtenção de alcance do Active Directory

source: Use the ppolicy extension
it: Utilizza l'estensione ppolicy
pt: Usar a extensão ppolicy

source: Force a password change when remaining grace logins reach or go below this threshold
it: Forza un cambio password quando i login di cortesia rimanenti raggiungono o scendono al di sotto di questa soglia
pt: Força a mudança da palavra passe quando os logins de graça restantes atingem ou estão abaixo deste limiar

source: Length of time to wait for a search request
it: Durata attesa per le richieste di ricerca
pt: Tempo de espera por um pedido de pesquisa

source: Length of time to wait for a enumeration request
it: Periodo di tempo di attesa per una richiesta di enumerazione
pt: Tempo a esperar por um pedido de enumeração

source: Length of time between enumeration updates
it: Durata tra gli aggiornamenti alle enumeration
pt: Período de tempo entre atualizações de enumeração

source: Maximum period deviation between enumeration updates
it: Massima deviazione del periodo tra gli aggiornamenti dell'enumerazione
pt: Máximo período de desvio entre atualizações de enumeração

source: Length of time between cache cleanups
it: Intervallo di tempo per la pulizia cache
pt: Duração de tempo entre limpezas da cache

source: Maximum time deviation between cache cleanups
it: Massima deviazione temporale tra le pulizie della cache
pt: Desvio de tempo máximo entre limpezas da cache

source: Require TLS for ID lookups
it: Richiedere TLS per gli ID lookup
pt: Requer TLS para consultas de ID

source: Use ID-mapping of objectSID instead of pre-set IDs
it: Utilizza la mappatura ID di objectSID invece degli ID preimpostati
pt: Usar ID-mapping do objectSID em vez de IDs pré-definidos

source: Base DN for user lookups
it: Base DN per i lookup utente
pt: DN base para pesquisa de utilizadores

source: Scope of user lookups
it: Ambito di applicazione dei lookup utente
pt: Escopo das pesquisas de utilizador

source: Filter for user lookups
it: Filtro per i lookup utente
pt: Filtro para as pesquisas de utilizador

source: Objectclass for users
it: Objectclass per gli utenti
pt: Classe de objecto para utilizadores

source: Username attribute
it: Attributo del nome utente
pt: Atributo do nome do utilizador

source: UID attribute
it: Attributo UID
pt: Atributo UID

source: Primary GID attribute
it: Attributo del GID primario
pt: Atributo GID primário

source: GECOS attribute
it: Attributo GECOS
pt: Atributo GECOS

source: Home directory attribute
it: Attributo della home directory
pt: Atributo do directório home

source: Shell attribute
it: Attributo della shell
pt: Atributo da Shell

source: UUID attribute
it: Attributo UUID
pt: Atributo UUID

source: objectSID attribute
it: Attributo objectSID
pt: Atributo objectSID

source: Active Directory primary group attribute for ID-mapping
it: Attributo del gruppo primario di Active Directory per la mappatura ID
pt: Atributo de grupo principal do Active Directory para mapeamento de ID

source: User principal attribute (for Kerberos)
it: Attributo user principal (per Kerberos)
pt: Atributo principal do utilizador (para Kerberos)

source: Full Name
it: Nome completo
pt: Nome Completo

source: memberOf attribute
it: Attributo memberOf
pt: Atributo memberOf

source: Modification time attribute
it: Attributo data di modifica
pt: Atributo da alteração da hora

source: shadowLastChange attribute
it: Attributo shadowLastChange
pt: Atributo shadowLastChange

source: shadowMin attribute
it: Attributo shadowMin
pt: Atributo shadowMin

source: shadowMax attribute
it: Attributo shadowMax
pt: Atributo shadowMax

source: shadowWarning attribute
it: Attributo shadowWarning
pt: Atributo shadowWarning

source: shadowInactive attribute
it: Attributo shadowInactive
pt: Atributo shadowInactive

source: shadowExpire attribute
it: Attributo shadowExpire
pt: Atributo shadowExpire

source: shadowFlag attribute
it: Attributo shadowFlag
pt: Atributo shadowFlag

source: Attribute listing authorized PAM services
it: Attributo che elenca i servizi PAM autorizzati
pt: Atributo que lista serviços PAM autorizados

source: Attribute listing authorized server hosts
it: Attributo che elenca gli host server autorizzati
pt: Atributo que lista máquinas servidor autorizadas

source: Attribute listing authorized server rhosts
it: Attributo che elenca gli rhost server autorizzati
pt: Atributo que lista rhosts servidor autorizados

source: krbLastPwdChange attribute
it: Attributo krbLastPwdChange
pt: Atributo krbLastPwdChange

source: krbPasswordExpiration attribute
it: Attributo krbPasswordExpiration
pt: Atributo krbPasswordExpiration

source: Attribute indicating that server side password policies are active
it: Attributo che indica che le policy password lato server sono attive
pt: Atributo que indica que as políticas de palavra passe do lado do servidor estão ativas

source: accountExpires attribute of AD
it: Attributo accountExpires di AD
pt: Atributo accountExpires do AD

source: userAccountControl attribute of AD
it: Attributo userAccountControl di AD
pt: Atributo userAccountControl do AD

source: nsAccountLock attribute
it: Attributo nsAccountLock
pt: Atributo nsAccountLock

source: loginDisabled attribute of NDS
it: Attributo loginDisabled di NDS
pt: Atributo loginDisabled do NDS

source: loginExpirationTime attribute of NDS
it: Attributo loginExpirationTime di NDS
pt: Atributo loginExpirationTime do NDS

source: loginAllowedTimeMap attribute of NDS
it: Attributo loginAllowedTimeMap di NDS
pt: Atributo loginAllowedTimeMap do NDS

source: SSH public key attribute
it: Attributo chiave pubblica SSH
pt: Atributo de chave pública SSH

source: attribute listing allowed authentication types for a user
it: attributo che elenca i tipi di autenticazione consentiti per un utente
pt: atributo que lista os tipos de autenticação autorizados para um utilizador

source: attribute containing the X509 certificate of the user
it: attributo contenente il certificato X509 dell'utente
pt: atributo que contém o certificado X509 do utilizador

source: attribute containing the email address of the user
it: attributo contenente l'indirizzo email dell'utente
pt: atributo que contém o endereço email do utilizador

source: attribute containing the passkey mapping data of the user
it: attributo contenente i dati di mappatura della passkey dell'utente
pt: atributo que contém os dados de mapeamento passkey do utilizador

source: A list of extra attributes to download along with the user entry
it: Un elenco di attributi extra da scaricare insieme alla voce utente
pt: Uma lista de atributos extra a descarregar juntamente com a entrada do utilizador

source: Base DN for group lookups
it: DN base per le ricerche di gruppo
pt: DN base para pesquisa de grupos

source: Objectclass for groups
it: Objectclass per i gruppi
pt: Classe de objeto para grupos

source: Group name
it: Nome gruppo
pt: Nome do Grupo

source: Group password
it: Password gruppo
pt: Palavra-passe do Grupo

source: GID attribute
it: Attributo GID
pt: Atributo GID

source: Group member attribute
it: Attributo membro gruppo
pt: Atributo de membro de grupo

source: Group UUID attribute
it: Attributo UUID gruppo
pt: Atributo UUID de grupo

source: Modification time attribute for groups
it: Attributo tempo di modifica per i gruppi
pt: Atributo de modificação de tempo para grupos

source: Type of the group and other flags
it: Tipo del gruppo e altri flag
pt: Tipo de grupo e outras bandeiras

source: The LDAP group external member attribute
it: L'attributo membro esterno del gruppo LDAP
pt: O atributo de membro externo do grupo LDAP

source: Maximum nesting level SSSD will follow
it: Livello massimo di annidamento che SSSD seguirà
pt: Nível máximo de aninhamento que o SSSD irá seguir

source: Filter for group lookups
it: Filtro per le ricerche di gruppo
pt: Filtro para pesquisas de grupo

source: Scope of group lookups
it: Ambito delle ricerche di gruppo
pt: Escopo para pesquisas de grupo

source: Base DN for netgroup lookups
it: DN base per le ricerche di netgroup
pt: DN base para pesquisas de netgroup

source: Objectclass for netgroups
it: Objectclass per i netgroup
pt: Classe de objeto para netgroups

source: Netgroup name
it: Nome netgroup
pt: Nome do netgroup

source: Netgroups members attribute
it: Attributo membri netgroup
pt: Atributo de membros de netgroups

source: Netgroup triple attribute
it: Attributo tripletta netgroup
pt: Atributo triplo de netgroup

source: Modification time attribute for netgroups
it: Attributo tempo di modifica per i netgroup
pt: Atributo de modificação de tempo para netgroups

source: Base DN for service lookups
it: DN base per le ricerche di servizio
pt: DN base para pesquisa de serviços

source: Objectclass for services
it: Objectclass per i servizi
pt: Classe de objeto para serviços

source: Service name attribute
it: Attributo nome servizio
pt: Atributo de nome de serviço

source: Service port attribute
it: Attributo porta servizio
pt: Atributo de porto de serviço

source: Service protocol attribute
it: Attributo protocollo servizio
pt: Atributo de protocolo de serviço

source: Lower bound for ID-mapping
it: Limite inferiore per la mappatura ID
pt: Vínculo inferior para mapeamento de ID

source: Upper bound for ID-mapping
it: Limite superiore per la mappatura ID
pt: Vínculo superior para mapeamento de ID

source: Number of IDs for each slice when ID-mapping
it: Numero di ID per ogni slice durante la mappatura ID
pt: Número de IDs para cada fatia ao fazer mapeamento de ID

source: Use autorid-compatible algorithm for ID-mapping
it: Utilizza algoritmo compatibile con autorid per la mappatura ID
pt: Usar algoritmo compatível com autorid para mapeamento de ID

source: Name of the default domain for ID-mapping
it: Nome del dominio predefinito per la mappatura ID
pt: Nome do domínio predefinido para mapeamento de ID

source: SID of the default domain for ID-mapping
it: SID del dominio predefinito per la mappatura ID
pt: SID do domínio predefinido para mapeamento de ID

source: Number of secondary slices
it: Numero di slice secondarie
pt: Número de fatias secundarias

source: Whether to use Token-Groups
it: Se utilizzare i Token-Groups
pt: Se deve-se usar Token-Groups

source: Set lower boundary for allowed IDs from the LDAP server
it: Imposta il limite inferiore per gli ID consentiti dal server LDAP
pt: Define limite inferior para IDS permitidos do servidor LDAP

source: Set upper boundary for allowed IDs from the LDAP server
it: Imposta il limite superiore per gli ID consentiti dal server LDAP
pt: Define limite superior para IDS permitidos do servidor LDAP

source: DN for ppolicy queries
it: DN per le query ppolicy
pt: DN para consultas ppolicy

source: How many maximum entries to fetch during a wildcard request
it: Quante voci massime recuperare durante una richiesta wildcard
pt: Qual o máximo de entradas a obter durante um pedido de wildcard

source: Set libldap debug level
it: Imposta il livello di debug di libldap
pt: Define nível de depuração da libldap

source: Policy to evaluate the password expiration
it: Politica per controllare la scadenza della password
pt: Politica para avaliar a expiração da palavra passe

source: Which attributes shall be used to evaluate if an account is expired
it: Quali attributi devono essere utilizzati per valutare se un account è scaduto
pt: Quais atributos devem ser usados para avaliar se uma conta está expirada

source: URI of an LDAP server where password changes are allowed
it: URI di un server LDAP dove sono consentite le modifiche della password
pt: URI dum servidor LDAP onde as mudanças de palavra passe são permitidas

source: URI of a backup LDAP server where password changes are allowed
it: URI di un server LDAP di backup dove sono consentite le modifiche della password
pt: URI dum servidor LDAP de salvaguarda onde alterações de palavra passe são permitidas

source: DNS service name for LDAP password change server
it: Nome del servizio DNS per il server di modifica password LDAP
pt: Nome de serviço DNS para servidor de mudança de palavra passe LDAP

source: Whether to update the ldap_user_shadow_last_change attribute after a password change
it: Se aggiornare l'attributo ldap_user_shadow_last_change dopo un cambio password
pt: Se deve-se atualizar o atributo ldap_user_shadow_last_change após mudança da palavra passe

source: Base DN for sudo rules lookups
it: DN base per le ricerche delle regole sudo
pt: DN base para pesquisas de regras sudo

source: Automatic full refresh period
it: Periodo di aggiornamento completo automatico
pt: Período de refrescamento total automático

source: Automatic smart refresh period
it: Periodo di aggiornamento intelligente automatico
pt: Período de refrescamento inteligente automático

source: Smart and full refresh random offset
it: Offset casuale per aggiornamento intelligente e completo
pt: Desvio aleatório do refrescamento inteligente e total

source: Whether to filter rules by hostname, IP addresses and network
it: Se filtrare le regole per nome host, indirizzi IP e rete
pt: Se deve-se filtra regras pelo nome de máquina, endereços IP e rede

source: Hostnames and/or fully qualified domain names of this machine to filter sudo rules
it: Nomi host e/o nomi di dominio completi di questa macchina per filtrare le regole sudo
pt: Nomes de máquina e/ou nomes de domínio totalmente qualificados desta máquina para filtrar regras sudo

source: IPv4 or IPv6 addresses or network of this machine to filter sudo rules
it: Indirizzi IPv4 o IPv6 o rete di questa macchina per filtrare le regole sudo
pt: Endereços IPv4 ou IPv6 ou rede desta máquina para filtrar regras sudo

source: Whether to include rules that contains netgroup in host attribute
it: Se includere regole che contengono netgroup nell'attributo host
pt: Se deve-se incluir regras que contêm netgroup no seu atributo host
